{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.eventListener.breakpoint": "Attiva/Disattiva i punti di interruzione del listener di eventi",
			"add.xhr.breakpoint": "Aggiungi punto di interruzione XHR/recupero",
			"attach.node.process": "Collega al processo Node",
			"base.cascadeTerminateToConfigurations.label": "Elenco di sessioni di debug che verranno arrestate in seguito alla terminazione della sessione di debug.",
			"base.enableDWARF.label": "Stabilisce se il debugger tenterà di leggere i simboli del debug DWARF da WebAssembly, operazione che potrebbe richiedere un utilizzo intensivo delle risorse. Richiede l'estensione `ms-vscode.wasm-dwarf-debugging` per funzionare.",
			"breakpoint.xhr.any": "Qualsiasi XHR/recupero",
			"breakpoint.xhr.contains": "Interrompi quando l'URL contiene:",
			"browser.address.description": "Indirizzo IP o nome host su cui è in ascolto il browser di cui viene eseguito il debug.",
			"browser.attach.port.description": "Porta da usare per eseguire il debug remoto del browse, specificata come `--remote-debugging-port` all'avvio del browser.",
			"browser.baseUrl.description": "URL di base per la risoluzione di baseUrl di percorsi. baseURL viene tagliato quando si esegue il mapping di URL ai file su disco. L'impostazione predefinita è il dominio dell'URL di avvio.",
			"browser.browserAttachLocation.description": "Forza il collegamento del browser in un'unica posizione. In un'area di lavoro remota, accessibile ad esempio tramite SSH o WSL, può essere usata per collegarsi al browser nel computer remoto anziché in locale.",
			"browser.browserLaunchLocation.description": "Forza l'avvio del browser in un'unica posizione. In un'area di lavoro remota, accessibile ad esempio tramite SSH o WSL, può essere usata per aprire il browser nel computer remoto anziché in locale.",
			"browser.cleanUp.description": "Indica l'operazione eseguita dalla pulizia al termine della sessione di debug, ovvero chiusura della sola scheda di cui è in corso il debug oppure dell'intero browser.",
			"browser.cwd.description": "Directory di lavoro facoltativa per l'eseguibile di runtime.",
			"browser.disableNetworkCache.description": "Controlla se ignorare la cache di rete per ogni richiesta",
			"browser.env.description": "Dizionario facoltativo di coppie chiave-valore di ambiente per il browser.",
			"browser.file.description": "File HTML locale da aprire nel browser",
			"browser.includeDefaultArgs.description": "Indica se gli argomenti predefiniti di avvio del browser (per disabilitare le funzioni che possono rendere più difficile il debug) saranno inclusi nell'avvio.",
			"browser.includeLaunchArgs.description": "Avanzate: indica se nel browser sono impostati argomenti di avvio/debug predefiniti. Il debugger presuppone che il browser usi il debug della pipe, come quello fornito con '--remote-debugging-pipe'.",
			"browser.inspectUri.description": "Formato da usare per riscrivere inspectUri. Si tratta di una stringa modello che interpola le chiavi in `{curlyBraces}`. Le chiavi disponibili sono:\r\n - `url.*` è l'indirizzo analizzato dell'applicazione in esecuzione, ad esempio `{url.port}`, `{url.hostname}`\r\n - `port` è la porta di debug su cui Chrome rimane in ascolto.\r\n - `browserInspectUri` è l'URI di controllo nel browser avviato\r\n - `browserInspectUriPath` è la parte del percorso dell'URI di controllo nel browser avviato (ad esempio: \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\").\r\n - `wsProtocol` è il protocollo WebSocket suggerito. È impostato su `wss` se l'URL originale è `https`; altrimenti è `ws`.\r\n",
			"browser.launch.port.description": "Porta su cui è in ascolto il browser. Con l'impostazione predefinita \"0\" il debugger del browser verrà eseguito tramite pipe. Questo approccio è in genere più sicuro e costituisce la scelta consigliata a meno che non sia necessario collegarsi al browser da un altro strumento.",
			"browser.pathMapping.description": "Mapping di URL/percorsi di cartelle locali per risolvere gli script nel browser in script su disco",
			"browser.perScriptSourcemaps.description": "Indica se gli script vengono caricati singolarmente con mapping di origine univoci contenenti il nome di base del file di origine. Può essere impostato per ottimizzare la gestione di mapping di origine quando si gestiscono numerosi script di piccole dimensioni. Se è impostata su \"auto\", verranno rilevati i casi noti se appropriato.",
			"browser.profileStartup.description": "Se è true, la profilatura inizierà all'avvio del processo",
			"browser.restart": "Indica se riconnettersi in caso di chiusura della connessione al browser",
			"browser.revealPage": "Sposta stato attivo sulla scheda",
			"browser.runtimeArgs.description": "Argomenti facoltativi passati all'eseguibile del runtime.",
			"browser.runtimeExecutable.description": "Corrisponde a 'canary', 'stable', 'custom' o al percorso dell'eseguibile del browser. L'impostazione custom si riferisce a un wrapper o a una build personalizzata oppure alla variabile di ambiente CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "Corrisponde a 'canary', 'stable', 'dev', 'custom' o al percorso dell'eseguibile del browser. L'impostazione custom si riferisce a un wrapper o a una build personalizzata oppure alla variabile di ambiente EDGE_PATH.",
			"browser.server.description": "Consente di configurare un server Web per l'avvio. Accetta la stessa configurazione dell'attività di avvio 'node'.",
			"browser.skipFiles.description": "Matrice di nomi di file o cartelle o GLOB di percorso da ignorare durante il debug. Sono consentiti modelli e negazioni con asterischi, ad esempio '[\"**/node_modules/**\", \"!**/node_modules/my-module/**\"]'",
			"browser.smartStep.description": "Esegue automaticamente un'istruzione alla volta delle righe non sottoposte a mapping nei file dei mapping di origine, ad esempio il codice che TypeScript produce automaticamente durante la generazione di JavaScript per async/await o altre funzionalità.",
			"browser.sourceMapPathOverrides.description": "Set di mapping per riscrivere i percorsi dei file di origine dalle posizioni indicate nel mapping di origine alle relative posizioni sul disco. Per dettagli, vedere il file README.",
			"browser.sourceMapRenames.description": "Indica se usare il mapping \"names\" nei mapping di origine. Con questa opzione è necessario richiedere il contenuto di origine e tale operazione può risultare lenta con alcuni debugger.",
			"browser.sourceMaps.description": "Usa i source map JavaScript (se esistenti).",
			"browser.targetSelection": "Indica se collegarsi a tutte le destinazioni corrispondenti al filtro URL (\"automatic\") o chiedere di sceglierne uno (\"pick\").",
			"browser.timeout.description": "Numero di millisecondi in cui vengono effettuati i tentativi di connessione al browser. Il valore predefinito è 10000 ms.",
			"browser.url.description": "Cerca una scheda con l'URL esatto e la collega ad esso se viene trovata",
			"browser.urlFilter.description": "Cerca una pagina con questo URL e la collega ad esso se viene trovata. Può contenere caratteri jolly (*).",
			"browser.userDataDir.description": "Per impostazione predefinita, il browser viene avviato con un profilo utente separato in una cartella temporanea. Usare questa opzione per eseguirne l'override. Impostare su false per avviare con il profilo utente predefinito. Non è possibile avviare un nuovo browser se è già in esecuzione un'istanza da `userDataDir`.",
			"browser.vueComponentPaths": "Elenco dei criteri GLOB di file per la ricerca dei componenti `*.vue`. Per impostazione predefinita, la ricerca viene eseguita nell'intera area di lavoro. Deve essere specificato a causa delle ricerche aggiuntive richiede dai source map di Vue nell'interfaccia della riga di comando di Vue versione 4. Per disabilitare questa gestione speciale, impostare questa opzione su una matrice vuota.",
			"browser.webRoot.description": "Specifica il percorso assoluto dell'area di lavoro nella radice di webserver. Viene usato per risolvere percorsi come `/app.js` in file su disco. Forma abbreviata di pathMapping per \"/\"",
			"chrome.attach.description": "Si collega a un'istanza di Chrome già in modalità di debug",
			"chrome.attach.label": "Chrome: Collega",
			"chrome.label": "App Web (Chrome)",
			"chrome.launch.description": "Avvia Chrome per eseguire il debug di un URL",
			"chrome.launch.label": "Chrome: Avvia",
			"commands.callersAdd.label": "Escludere chiamante",
			"commands.callersAdd.paletteLabel": "Escludere il chiamante dalla sospensione nella posizione corrente",
			"commands.callersGoToCaller.label": "Andare alla posizione del chiamante",
			"commands.callersGoToTarget.label": "Andare alla posizione di destinazione",
			"commands.callersRemove.label": "Rimuovere chiamante escluso",
			"commands.callersRemoveAll.label": "Rimuovi tutti i chiamanti esclusi",
			"commands.disableSourceMapStepping.label": "Disabilitare istruzione mappata all’origine",
			"commands.enableSourceMapStepping.label": "Abilitare istruzione mappata all'origine",
			"commands.networkClear.label": "Cancella log di rete",
			"commands.networkCopyURI.label": "Copia URL richiesta",
			"commands.networkOpenBody.label": "Apri corpo risposta",
			"commands.networkOpenBodyInHexEditor.label": "Aprire il corpo della risposta nell'editor esadecimale",
			"commands.networkReplayXHR.label": "Richiesta di riproduzione",
			"commands.networkViewRequest.label": "Visualizzare la richiesta come cURL",
			"configuration.autoAttachMode": "Consente di configurare i processi da collegare e di cui eseguire automaticamente il debug quando `#debug.node.autoAttach#` è impostato su on. Un processo Node avviato con il flag `--inspect` verrà sempre collegato indipendentemente da questa impostazione.",
			"configuration.autoAttachMode.always": "Collega automaticamente a ogni processo Node.js avviato nel terminale.",
			"configuration.autoAttachMode.disabled": "La funzionalità di collegamento automatico è disabilitata e non visualizzata nella barra di stato.",
			"configuration.autoAttachMode.explicit": "Collega automaticamente solo quando è specificato `--inspect`.",
			"configuration.autoAttachMode.smart": "Collega automaticamente durante l'esecuzione di script non presenti in una cartella node_modules.",
			"configuration.autoAttachSmartPatterns": "Consente di configurare i criteri GLOB per determinare quando collegarsi in modalità `#debug.javascript.autoAttachFilter#` \"intelligente\". `$KNOWN_TOOLS$` viene sostituito con un elenco di nomi di strumenti di esecuzione codice e test comuni. [Altre informazioni disponibili nella documentazione di VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.automaticallyTunnelRemoteServer": "Durante il debug di un'app Web remota, configura l'eventuale tunneling automatico del server remoto nel computer locale.",
			"configuration.breakOnConditionalError": "Indica se arrestare l'esecuzione quando i punti di interruzione condizionali generano un errore.",
			"configuration.debugByLinkOptions": "Opzioni usate durante il debug di collegamenti aperto su cui viene fatto clic all'interno del terminale di debug. Impostare su \"false\" per disabilitare questo comportamento.",
			"configuration.defaultRuntimeExecutables": "Valore predefinito `runtimeExecutable` usato per le configurazioni di avvio, se non specificato. Può essere usato per configurare percorsi personalizzati per installazioni di Node.js o browser.",
			"configuration.enableNetworkView": "Abilita la visualizzazione di rete sperimentale per le destinazioni che la supportano.",
			"configuration.npmScriptLensLocation": "Indica se visualizzare una finestra di CodeLens \"Esegui\" ed \"Esegui debug\" negli script npm. Può trovarsi in \"all\", negli script, in \"top\" della sezione script o in \"never\".",
			"configuration.pickAndAttachOptions": "Opzioni predefinite usate durante il debug di un processo tramite il comando `Debug: Collega al processo di terminale Node.js`",
			"configuration.resourceRequestOptions": "Opzioni della richiesta da usare durante il caricamento delle risorse, ad esempio i mapping di origine, nel debugger. Può essere necessario configurare questa impostazione se, ad esempio, i mapping di origine richiedono l'autenticazione oppure usano un certificato autofirmato. Le opzioni vengono usate per creare una richiesta tramite la libreria [`got`](https://github.com/sindresorhus/got).\r\n\r\nPer eseguire un'azione comune, quale disabilitare la verifica dei certificati, è possibile passare `{ \"https\": { \"rejectUnauthorized\": false } }`.",
			"configuration.terminalOptions": "Opzioni di avvio predefinite per gli script npm e del terminale di debug di JavaScript.",
			"configuration.unmapMissingSources": "Consente di configurare se il mapping del file con mapping di origine in cui non è possibile leggere il file originale verrà annullato automaticamente. Se è false (impostazione predefinita), viene visualizzato un prompt.",
			"createDiagnostics.label": "Esegui diagnosi dei problemi dei punti di interruzione",
			"customDescriptionGenerator.description": "Consente di personalizzare la descrizione testuale degli oggetti (variabili locali e così via) visualizzata dal debugger. Esempi:\r\n      1. this.toString() // Viene chiamato toString per stampare tutti gli oggetti\r\n      2. this.customDescription ? this.customDescription() : defaultValue // Usa il metodo customDescription, se disponibile; altrimenti restituisce defaultValue\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Usa il metodo customDescription, se disponibile; altrimenti restituisce defaultValue\r\n      ",
			"customPropertiesGenerator.description": "Consente di personalizzare le proprietà visualizzate per un oggetto nel debugger (variabili locali e così via). Esempi:\r\n    1. { ...this, extraProperty: '12345' } // Aggiunge un elemento extraProperty 12345 a tutti gli oggetti\r\n    2. this.customProperties ? this.customProperties() : this // Usa il metodo customProperties, se disponibile; in caso contrario, usa le proprietà in this (le proprietà predefinite)\r\n    3. function () { return this.customProperties ? this.customProperties() : this } // Usa il metodo customDescription, se disponibile; in caso contrario, restituisce le proprietà predefinite\r\n\r\n    Deprecated: si tratta di un'implementazione temporanea di questa funzionalità finché non verrà implementata nel modo descritto in questo articolo: https://github.com/microsoft/vscode/issues/102181",
			"debug.npm.edit": "Modifica package.json",
			"debug.npm.noScripts": "Nel file package.json non sono stati trovati script npm",
			"debug.npm.noWorkspaceFolder": "Per eseguire il debug di script npm, è necessario aprire una cartella dell'area di lavoro.",
			"debug.npm.parseError": "Non è stato possibile leggere {0}: {1}",
			"debug.npm.script": "Script npm di debug",
			"debug.terminal.attach": "Collega al processo di terminale Node.js",
			"debug.terminal.label": "Terminale di debug di JavaScript",
			"debug.terminal.program.description": "Comando da eseguire nel terminale avviato. Se non viene specificato, il terminale verrà aperto senza avviare alcun programma.",
			"debug.terminal.snippet.label": "Esegui \"npm start\" in un terminale di debug",
			"debug.terminal.toggleAuto": "Attiva/Disattiva collegamento automatico al terminale Node.js",
			"debug.terminal.welcome": "[Terminale di debug di JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nÈ possibile usare il terminale di debug di JavaScript per eseguire il debug di processi Node.js eseguiti dalla riga di comando.",
			"debug.terminal.welcomeWithLink": "[Terminale di debug di JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nÈ possibile usare il terminale di debug di JavaScript per eseguire il debug di processi Node.js eseguiti dalla riga di comando.\r\n\r\n[URL di debug](command:extension.js-debug.debugLink)",
			"debug.unverifiedBreakpoints": "Non è stato possibile impostare alcuni punti di interruzione. Se si verifica un problema, è possibile [risolvere i problemi della configurazione di avvio](command:extension.js-debug.createDiagnostics).",
			"debugLink.label": "Aprire collegamento",
			"edge.address.description": "Durante il debug di webview, indirizzo IP o nome host su cui è in ascolto la webview. Se non è impostato, verrà individuato automaticamente.",
			"edge.attach.description": "Si collega a un'istanza di Microsoft Edge già in modalità di debug",
			"edge.attach.label": "Microsoft Edge: Collega",
			"edge.label": "App Web (Edge)",
			"edge.launch.description": "Avvia Microsoft Edge per eseguire il debug di un URL",
			"edge.launch.label": "Microsoft Edge: Avvia",
			"edge.port.description": "Durante il debug di webview, porta su cui è in ascolto la webview. Se non è impostata, verrà individuata automaticamente.",
			"edge.useWebView.attach.description": "Oggetto contenente 'pipeName' di una pipe di debug per una webview2 ospitata dalla piattaforma UWP. Si tratta di \"MyTestSharedMemory\" durante la creazione della pipe \"\\\\.\\pipe\\LOCAL\\MyTestSharedMemory\"",
			"edge.useWebView.launch.description": "Quando è 'true', il debugger considererà l'eseguibile di runtime come un'applicazione host che contiene una webview e consentirà di eseguire il debug del contenuto dello script della webview.",
			"edit.xhr.breakpoint": "Modifica punto di interruzione XHR/recupero",
			"enableContentValidation.description": "Attiva/Disattiva la verifica della corrispondenza del contenuto dei file su disco con quello dei file caricati nel runtime. Questa opzione è utile in diversi scenari e obbligatoria in alcuni, ma può causare problemi se, ad esempio, sono presenti trasformazioni lato server degli script.",
			"errors.timeout": "{0}: timeout dopo {1} ms",
			"extension.description": "Estensione per il debug di programmi Node.js e di Chrome.",
			"extensionHost.label": "Sviluppo di estensioni per VS Code",
			"extensionHost.launch.config.name": "Avvia estensione",
			"extensionHost.launch.debugWebWorkerHost": "Consente di configurare se è necessario provare a collegarsi all'host dell'estensione Web worker.",
			"extensionHost.launch.debugWebviews": "Configura i tentativi di collegamento alle webview nell'istanza di VS Code avviata. Funziona solo nella versione desktop di VS Code.",
			"extensionHost.launch.env.description": "Variabili di ambiente passate all'host dell'estensione.",
			"extensionHost.launch.rendererDebugOptions": "Opzioni di avvio di Chrome usate durante il collegamento al processo del renderer con `debugWebviews` o `debugWebWorkerHost`.",
			"extensionHost.launch.runtimeExecutable.description": "Percorso assoluto di VS Code.",
			"extensionHost.launch.stopOnEntry.description": "Arresta automaticamente l'host dell'estensione dopo l'avvio.",
			"extensionHost.launch.testConfiguration": "Percorso di un file di configurazione di test per l'[interfaccia della riga di comando di test](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).",
			"extensionHost.launch.testConfigurationLabel": "Singola configurazione da eseguire dal file. Se non specificato, potrebbe essere richiesto di effettuare una selezione.",
			"extensionHost.snippet.launch.description": "Avvia un'estensione VS Code in modalità di debug",
			"extensionHost.snippet.launch.label": "Sviluppo di estensioni per VS Code",
			"getDiagnosticLogs.label": "Salvare i log di debug JS di diagnostica",
			"longPredictionWarning.disable": "Non visualizzare più questo messaggio",
			"longPredictionWarning.message": "La configurazione dei punti di interruzione sta richiedendo più tempo del previsto. Per velocizzare l'operazione, aggiornare 'outFiles' nel file launch.json.",
			"longPredictionWarning.noFolder": "Non ci sono cartelle dell'area di lavoro aperte.",
			"longPredictionWarning.open": "Apri launch.json",
			"node.address.description": "Indirizzo TCP/IP del processo di cui eseguire il debug. Il valore predefinito è 'localhost'.",
			"node.attach.attachExistingChildren.description": "Indica se effettuare un tentativo di collegamento a processi figlio già generati.",
			"node.attach.attachSpawnedProcesses.description": "Indica se impostare le variabili di ambiente nel processo collegato per tenere traccia degli elementi figlio generati.",
			"node.attach.config.name": "Collega",
			"node.attach.continueOnAttach": "Se è true, i programmi avviati e in attesa in `--inspect-brk` verranno ripresi automaticamente",
			"node.attach.processId.description": "ID del processo a cui collegarsi.",
			"node.attach.restart.description": "Prova a riconnettersi al programma in caso di perdita della connessione. Se è impostata su `true`, verrà effettuato un tentativo al secondo per un tempo indefinito. È possibile personalizzare l'intervallo e il numero massimo di tentativi specificando `delay` e `maxAttempts` in un oggetto.",
			"node.attachSimplePort.description": "Se è impostata, si collega al processo tramite la porta specificata. In genere non è più necessaria per i programmi Node.js e non include più la funzionalità per eseguire il debug dei processi figlio, ma può essere utile in scenari più complessi, ad esempio con gli avvii di Deno e Docker. Se è impostata su 0, verrà scelta una porta casuale e il parametro --inspect-brk verrà aggiunto automaticamente agli argomenti di avvio.",
			"node.console.title": "Console di debug nodo",
			"node.disableOptimisticBPs.description": "Non imposta punti di interruzione in un file finché non viene caricato un mapping di origine per tale file.",
			"node.enableTurboSourcemaps.description": "Configura se usare un nuovo meccanismo più veloce per l'individuazione del mapping di origine",
			"node.experimentalNetworking.description": "Abilitare l'ispezione sperimentale in Node.js. Se impostata su 'auto', questa opzione è abilitata per le versioni di Node.js che la supportano. Può essere impostata su 'on' o 'off' per abilitarla o disabilitarla in modo esplicito.",
			"node.killBehavior.description": "Consente di configurare la modalità di terminazione dei processi di debug all'arresto della sessione. Può essere:\r\n\r\n- forceful (impostazione predefinita): arresta forzatamente l'albero processi. Invia SIGKILL in posix oppure `taskkill.exe /F` in Windows.\r\n- polite: arresta normalmente l'albero processi. È possibile che l'esecuzione dei processi con comportamento anomalo prosegua dopo che vengono arrestati in questo modo. Invia SIGTERM in posix oppure `taskkill.exe` senza flag `/F` (force) in Windows.\r\n- none: i processi non vengono terminati.",
			"node.label": "Node.js",
			"node.launch.args.description": "Argomenti della riga di comando passati al programma.\r\n\r\nPuò trattarsi di una matrice di stringhe o di una singola stringa. Quando il programma viene avviato in un terminale, se si imposta questa proprietà su una singola stringa, gli argomenti non verranno preceduti da un carattere di escape per la shell.",
			"node.launch.autoAttachChildProcesses.description": "Collega automaticamente il debugger ad un nuovo processo figlio.",
			"node.launch.config.name": "Avvia",
			"node.launch.console.description": "Indica dove avviare la destinazione di debug.",
			"node.launch.console.externalTerminal.description": "Terminale esterno che può essere configurato tramite impostazioni utente",
			"node.launch.console.integratedTerminal.description": "terminale integrato di Visual Studio Code",
			"node.launch.console.internalConsole.description": "console di debug di Visual Studio Code (che non include il supporto per leggere dati di input da un programma)",
			"node.launch.cwd.description": "Percorso assoluto della directory di lavoro per il programma di cui viene eseguito il debug. Se è stato impostato localRoot, cwd corrisponderà a tale valore, altrimenti userà il valore di workspaceFolder",
			"node.launch.env.description": "Variabili di ambiente passate al programma. Con il valore `null` la variabile viene rimossa dall'ambiente.",
			"node.launch.envFile.description": "Percorso assoluto di un file che contiene le definizioni delle variabili di ambiente.",
			"node.launch.logging": "Configurazione della registrazione",
			"node.launch.logging.cdp": "Percorso del file di log per i messaggi di Chrome DevTools Protocol",
			"node.launch.logging.dap": "Percorso del file di log per i messaggi di Debug Adapter Protocol",
			"node.launch.outputCapture.description": "Origine da cui acquisire i messaggi di output: API di debug predefinita se è impostata su `console` oppure flussi stdout/stderr se è impostata su `std`. ",
			"node.launch.program.description": "Percorso assoluto del programma. Per ipotizzare il valore generato, esaminare package.json e i file aperti. Modificare questo attributo.",
			"node.launch.restart.description": "Provare a riavviare il programma se il codice di uscita restituito è diverso da zero.",
			"node.launch.runtimeArgs.description": "Argomenti facoltativi passati all'eseguibile del runtime.",
			"node.launch.runtimeExecutable.description": "Runtime da usare. Corrisponde a un percorso assoluto o al nome di un runtime disponibile in PATH. Se viene omesso, si presuppone che sia `node`.",
			"node.launch.runtimeSourcemapPausePatterns": "Elenco di criteri in corrispondenza dei quali inserire manualmente punti di interruzione dei punti di ingresso. Può essere utile per consentire al debugger di impostare punti di interruzione durante l'uso di mapping di origine che non esistono o non possono essere rilevati prima dell'avvio, ad esempio [con il framework Serverless](https://github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Versione del runtime di `node` da usare. Richiede 'nvm'.",
			"node.launch.useWSL.deprecation": "'useWSL' è deprecato e il relativo supporto verrà rimosso. Usare l'estensione 'Remote - WSL'.",
			"node.launch.useWSL.description": "Usa il sottosistema Windows per Linux.",
			"node.localRoot.description": "Percorso della directory locale che contiene il programma.",
			"node.pauseForSourceMap.description": "Indica se attendere il caricamento dei source map per ogni script in arrivo. Questa impostazione implica un sovraccarico delle prestazioni e può essere disabilitata senza problemi quando non viene eseguita su disco, purché `rootPath` non sia disabilitato.",
			"node.port.description": "Porta di debug a cui connettersi. Il valore predefinito è 9229.",
			"node.processattach.config.name": "Connetti a processo",
			"node.profileStartup.description": "Se è true, la profilatura inizierà all'avvio del processo",
			"node.remote.host.header.description": "Intestazione host esplicita da usare durante la connessione al WebSocket dell'ispettore. Se non viene specificato alcun valore, l'intestazione dell'host verrà impostata su 'localhost'. Ciò è utile se l'ispettore viene eseguito dietro un proxy che accetta solo intestazioni host specifiche.",
			"node.remoteRoot.description": "Percorso assoluto della directory remota che contiene il programma.",
			"node.resolveSourceMapLocations.description": "Elenco di criteri di corrispondenza minima per le posizioni (cartelle e URL) in cui è possibile usare source map per risolvere file locali. Può essere usato per evitare di passare erroneamente al codice con source mapping esterno. Per escludere i criteri, aggiungere il prefisso \"!\". Può essere impostato su una matrice vuota o su Null per evitare la restrizione.",
			"node.showAsyncStacks.description": "Mostra le chiamate asincrone che hanno causato lo stack di chiamate corrente.",
			"node.snippet.attach.description": "Collega a un programma node in esecuzione",
			"node.snippet.attach.label": "Node.js: collega",
			"node.snippet.attachProcess.description": "Apre l'utilità di selezione processi per selezionare il processo Node a cui collegarsi",
			"node.snippet.attachProcess.label": "Node.js: collega al processo",
			"node.snippet.electron.description": "Esegue il debug del processo principale Electron",
			"node.snippet.electron.label": "Node.js: Processo principale Electron",
			"node.snippet.gulp.description": "Esegue il debug dell'attività gulp (assicurarsi che nel progetto sia installata un'istanza locale di gulp)",
			"node.snippet.gulp.label": "Node.js: attività gulp",
			"node.snippet.launch.description": "Avvia un programma Node in modalità di debug",
			"node.snippet.launch.label": "Node.js: avvia il programma",
			"node.snippet.mocha.description": "Esegue il debug di test Mocha",
			"node.snippet.mocha.label": "Node.js: test Mocha",
			"node.snippet.nodemon.description": "Usa nodemon per riavviare una sessione di debug in seguito a modifiche dell'origine",
			"node.snippet.nodemon.label": "Node.js: configurazione di nodemon",
			"node.snippet.npm.description": "Avvia un programma Node tramite uno script `debug` di npm",
			"node.snippet.npm.label": "Node.js: avvio tramite npm",
			"node.snippet.remoteattach.description": "Collega alla porta di debug di un programma Node remoto",
			"node.snippet.remoteattach.label": "Node.js: collega a programma remoto",
			"node.snippet.yo.description": "Esegue il debug del generatore yeoman (per installare, eseguire `npm link` nella cartella del progetto)",
			"node.snippet.yo.label": "Node.js: generatore yeoman",
			"node.sourceMapPathOverrides.description": "Set di mapping per riscrivere i percorsi dei file di origine dal percorso indicato nel mapping di origine al relativo percorso su disco.",
			"node.sourceMaps.description": "Usa i source map JavaScript (se esistenti).",
			"node.stopOnEntry.description": "Arresta automaticamente il programma dopo l'avvio.",
			"node.timeout.description": "Numero di millisecondi in cui vengono effettuati i tentativi di connessione a Node.js. Il valore predefinito è 10000 ms.",
			"node.versionHint.description": "Consente di specificare in modo esplicito la versione di Node in esecuzione, che può essere usata per disabilitare o abilitare determinati comportamenti nei casi in cui il rilevamento automatico delle versioni non funziona.",
			"node.websocket.address.description": "Indirizzo esatto del WebSocket a cui collegarsi. Se non è specificato, verrà individuato dall'indirizzo e dalla porta.",
			"openEdgeDevTools.label": "Apri Devtools per il browser",
			"outFiles.description": "Se sono abilitati i source map, questi criteri GLOB specificano i file JavaScript generati. Se un criterio inizia con `!`, i file sono esclusi. Se non viene specificato, si presuppone che il codice generato si trovi nella stessa directory dell'origine.",
			"pretty.print.script": "Riformattazione per il debug",
			"profile.start": "Accetta profilo prestazioni",
			"profile.stop": "Arresta profilo prestazioni",
			"remove.eventListener.breakpoint.all": "Rimuovi tutti i punti di interruzione del listener di eventi",
			"remove.xhr.breakpoint": "Rimuovi punto di interruzione XHR/recupero",
			"remove.xhr.breakpoint.all": "Rimuovi tutti i punti di interruzione XHR/recupero",
			"requestCDPProxy.label": "Richiedi proxy CDP per la sessione di debug",
			"skipFiles.description": "Matrice di criteri GLOB per i file da ignorare durante il debug. Il criterio `<node_internals>/**` consente di trovare una corrispondenza per tutti i moduli Node.js interni.",
			"smartStep.description": "Esegue automaticamente un'istruzione alla volta del codice generato di cui non è possibile eseguire il mapping all'origine iniziale.",
			"start.with.stop.on.entry": "Avvia il debug e arrestalo in corrispondenza della voce",
			"startWithStopOnEntry.label": "Avvia il debug e arrestalo in corrispondenza della voce",
			"timeouts.generalDescription": "Timeout per diverse operazioni del debugger.",
			"timeouts.generalDescription.markdown": "Timeout per diverse operazioni del debugger.",
			"timeouts.hoverEvaluation.description": "Tempo fino a quando la valutazione del valore per i simboli al passaggio del mouse non viene interrotta. Se impostata su 0, la valutazione al passaggio del mouse non si verifica mai.",
			"timeouts.sourceMaps.description": "Timeout correlati alle operazioni dei source map.",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Tempo aggiuntivo in millisecondi consentito per attendere l'elaborazione dei source map in una singola sessione una volta esaurito il tempo minimo (sourceMapMinPause)",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Tempo minimo in millisecondi per attendere l'elaborazione dei singoli source map durante l'analisi di uno script",
			"toggle.skipping.this.file": "Attiva/disattiva Ignora questo file",
			"trace.boolean.description": "L'analisi può essere impostata su 'true' per scrivere i log di diagnostica sul disco.",
			"trace.description": "Consente di configurare il tipo di output diagnostica prodotto.",
			"trace.logFile.description": "Consente di configurare il percorso in cui vengono scritti i log del disco.",
			"trace.stdio.description": "Indica se restituire i dati di analisi del browser o dell'applicazione avviata.",
			"workspaceTrust.description": "Per eseguire il debug del codice in questa area di lavoro, è necessaria l'attendibilità."
		},
		"bundle": {
			"A profiling session is already running, would you like to stop it and start a new session?": "Una sessione di profilatura è già in esecuzione. Arrestarla e avviarne una nuova?",
			"Add XHR Breakpoint": "Aggiungi punto di interruzione XHR",
			"Add new URL...": "Aggiungi nuovo URL...",
			"Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Modificare i criteri GLOB nell'attributo 'outFiles' in modo che includano il codice JavaScript generato.",
			"Always": "Sempre",
			"Always in this Workspace": "Sempre in questa area di lavoro",
			"An error occurred taking a profile from the target.": "Si è verificato un errore durante l'acquisizione di un profilo dalla destinazione.",
			"Animation Frame Fired": "Frame di animazione generato",
			"Any XHR or fetch": "Qualsiasi XHR o recupero",
			"Assertion failed": "Asserzione non riuscita",
			"Attach to process: '{0}' doesn't look like a process id.": "Collegamento a processo: '{0}' non sembra essere un ID processo.",
			"Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Collegamento a processo: non è possibile abilitare la modalità di debug per il processo '{0}' ({1}).",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "L'attributo 'runtimeVersion' richiede il version manager 'nvm-windows' o 'nvs' di Node.js.",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvs', 'nvm' or 'fnm' to be installed.": "L'attributo 'runtimeVersion' richiede l'installazione del version manager 'nvs' o 'fnm' di Node.js.",
			"Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "L'attributo 'runtimeVersion' con una versione/architettura richiede l'installazione di 'nvs'.",
			"Bidder Bidding Phase Start": "Inizio fase di offerta dell'offerente",
			"Bidder Reporting Phase Start": "Inizio fase reporting dell’offerente",
			"Block": "Blocca",
			"Break when URL Contains": "Interrompi quando l'URL contiene",
			"Breaks on all throw errors, even if they're caught later.": "Imposta un'interruzione in corrispondenza di tutti gli errori di generazione, anche se vengono rilevati in seguito.",
			"Breaks only on errors or promise rejections that are not handled.": "Si interrompe solo in corrispondenza di errori o rifiuti di promesse non gestiti.",
			"Browser connection failed, will retry: {0}": "La connessione del browser non è riuscita. Verrà effettuato un nuovo tentativo: {0}",
			"CPU Profile": "Profilo CPU",
			"CPU profile saved as \"{0}\" in your workspace folder": "Profilo CPU salvato come \"{0}\" nella cartella dell'area di lavoro",
			"CSP violation \"{0}\"": "Violazione \"{0}\" dei criteri di sicurezza del contenuto",
			"Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "Non è possibile trovare il file binario \"{0}\" di Node.js: {1}. Assicurarsi che Node.js sia installato e sia indicato in PATH o impostare \"runtimeExecutable\" nel file launch.json",
			"Can't load environment variables from file ({0}).": "Non è possibile caricare le variabili di ambiente dal file ({0}).",
			"Cancel Animation Frame": "Annulla frame di animazione",
			"Cannot connect to the target at {0}: {1}": "Non è possibile connettersi alla destinazione in {0}: {1}",
			"Cannot find `{0}` installed in {1}": "Non è possibile trovare '{0}' installato in {1}",
			"Cannot find a program to debug": "Non è stato trovato alcun programma di cui eseguire il debug",
			"Cannot find test configuration with label `{0}`, got: {1}": "Non è possibile trovare la configurazione di test con etichetta '{0}', ottenuto: {1}",
			"Cannot launch debug target in terminal ({0}).": "Non è possibile avviare la destinazione di debug nel terminale ({0}).",
			"Cannot restart asynchronous frame": "Non è possibile riavviare il frame asincrono",
			"Cannot set an empty value": "Non è possibile impostare un valore vuoto",
			"Catch Block": "Blocco catch",
			"Caught Exceptions": "Eccezioni rilevate",
			"Close AudioContext": "Chiudi AudioContext",
			"Closure": "Chiusura",
			"Closure ({0})": "Chiusura ({0})",
			"Console profile started": "Profilo console avviato",
			"Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "Impossibile connettersi ad alcuna pipe webview UWP. Assicurarsi che la visualizzazione Web sia ospitata in modalità di debug e che 'pipeName' in 'launch.json' sia corretto.",
			"Could not find a location for the variable": "Non è stato trovato alcun percorso per la variabile",
			"Could not query the provided object": "Non è stato possibile eseguire una query sull'oggetto specificato",
			"Could not read source map for {0}: {1}": "Non è stato possibile leggere il source map per {0}: {1}",
			"Could not read {0}: {1}": "Non è stato possibile leggere {0}: {1}",
			"Create AudioContext": "Crea AudioContext",
			"Create canvas context": "Crea contesto canvas",
			"Debug Anyway": "Esegui comunque il debug",
			"Debug URL": "Esegui debug dell'URL",
			"Details": "Dettagli",
			"Don't show again": "Non visualizzare più questo messaggio",
			"Duration": "Durata",
			"Duration of Profile": "Durata del profilo",
			"Edit XHR Breakpoint": "Modifica punto di interruzione XHR",
			"Edit package.json": "Modifica package.json",
			"Enables Node.js [auto attach]({0}) debugging in \"{1}\" mode/{Locked='[auto attach]({0})'}the 2nd placeholder is the setting value": "Abilita il debug di Node.js [auto attach]({0}) in modalità \"{1}\"",
			"Enter a URL or a pattern to match": "Immettere un URL o un criterio per la corrispondenza",
			"Eval": "Valutazione",
			"Frame could not be restarted": "Non è stato possibile riavviare il frame",
			"Generates a .cpuprofile file you can open in VS Code or the Edge/Chrome devtools": "Genera un file con estensione cpuprofile che è possibile aprire in VS Code o in Edge/Chrome devtools",
			"Generates a .heapprofile file you can open in VS Code or the Edge/Chrome devtools": "Genera un file con estensione heappro che è possibile aprire in VS Code o in Edge/Chrome devtools",
			"Generates a .heapsnapshot file you can open in VS Code or the Edge/Chrome devtools": "Genera un file con estensione heapsnapshot che è possibile aprire in VS Code o in Edge/Chrome devtools",
			"Global": "Globale",
			"Globals": "Globali",
			"Got it!": "OK",
			"Heap Profile": "Profilo heap",
			"Heap Snapshot": "Snapshot heap",
			"How long to run the profile": "Tempo di esecuzione del profilo",
			"Ignore": "Ignora",
			"Installation complete! The extension will be used after you restart your debug session.": "Installazione completata. L'estensione verrà usata dopo il riavvio della sessione di debug.",
			"Installing the DWARF debugger...": "Installazione del debugger DWARF in corso...",
			"Invalid expression": "Espressione non valida",
			"Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "La condizione raggiunta non è valida: \"{0}\". È prevista un'espressione simile a \"> 42\" o \"== 2\".",
			"It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Sembra che sia già in esecuzione un browser da {0}. Chiuderlo prima di provare a eseguire il debug, altrimenti VS Code potrebbe non essere in grado di connettersi ad esso.",
			"It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Sembra che la sessione di debug sia già stata terminata. Provare a ripetere il debug, quindi eseguire il comando \"Debug: Esegui diagnosi dei problemi dei punti di interruzione\".",
			"It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "La configurazione dei punti di interruzione sta richiedendo più tempo del previsto. Per velocizzare l'operazione, aggiornare 'outFiles' nel file launch.json.",
			"JavaScript Debug Terminal": "Terminale di debug di JavaScript",
			"JavaScript debug adapter": "Adattatore di debug JavaScript",
			"Launch Chrome against localhost": "Avvia Chrome con localhost",
			"Launch Edge against localhost": "Avvia Edge con localhost",
			"Launch Program": "Avvia programma",
			"Launch configuration created based on 'package.json'.": "Configurazione di lancio creata sulla base di 'package.json'.",
			"Launch configuration for '{0}' project created.": "Configurazione di lancio creata per '{0}' progetto/i.",
			"Local": "Locale",
			"Locals": "Locali",
			"Lost connection to debugee, reconnecting in {0}ms\r\n": "Connessione persa all'oggetto del debug. Verrà effettuato un nuovo tentativo di connessione tra {0} ms\r\n",
			"Manual": "Manuale",
			"Module": "Modulo",
			"Networking not available.": "Rete non disponibile.",
			"Never": "Mai",
			"No": "No",
			"No npm scripts found in the workspace folder.": "Non sono stati trovati script npm nella cartella dell'area di lavoro.",
			"No npm scripts found in your package.json": "Nel file package.json non sono stati trovati script npm",
			"No package.json files found in your workspace.": "Non sono stati trovati file package.json nell'area di lavoro.",
			"No workspace folder open.": "Non ci sono cartelle dell'area di lavoro aperte.",
			"Node Attributes": "Attributi nodo",
			"Node.js version '{0}' not installed using version manager {1}.": "La versione '{0}' di Node.js non è stata installata con lo strumento di gestione delle versioni {1}.",
			"Not Now": "Non ora",
			"Only objects can be queried": "È possibile eseguire query solo sugli oggetti",
			"Open launch.json": "Apri launch.json",
			"Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "L'output è stato troncato ai primi {0} caratteri. Eseguire '{1}' per copiare l'output completo.",
			"Parameters": "Parametri",
			"Paused": "Operazione sospesa",
			"Paused before Out Of Memory exception": "Sospeso prima dell'eccezione di memoria insufficiente",
			"Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "Sospeso in corrispondenza del punto di interruzione della strumentazione per la violazione dei criteri di sicurezza del contenuto. Direttiva \"{0}\"",
			"Paused on DOM breakpoint": "Sospeso in corrispondenza del punto di interruzione DOM",
			"Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "Sospeso in corrispondenza del punto di interruzione della strumentazione per errori WebGL. Errore \"{0}\"",
			"Paused on XMLHttpRequest or fetch": "Sospeso in corrispondenza di XMLHttpRequest o di fetch",
			"Paused on assert": "Sospeso in corrispondenza dell'asserzione",
			"Paused on breakpoint": "Sospeso in corrispondenza del punto di interruzione",
			"Paused on debug() call": "Sospeso in corrispondenza della chiamata di debug()",
			"Paused on debugger statement": "Sospeso in corrispondenza dell'istruzione del debugger",
			"Paused on event listener": "Sospeso in corrispondenza del listener di eventi",
			"Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "Sospeso in corrispondenza del punto di interruzione \"{0}\" del listener di eventi. Attivato su \"{1}\"",
			"Paused on exception": "Sospeso in corrispondenza dell'eccezione",
			"Paused on frame entry": "Sospeso in corrispondenza della voce del frame",
			"Paused on instrumentation breakpoint": "Sospeso in corrispondenza del punto di interruzione della strumentazione",
			"Paused on instrumentation breakpoint \"{0}\"": "Sospeso in corrispondenza del punto di interruzione \"{0}\" della strumentazione",
			"Paused on {0}": "Sospeso in caso di {0}",
			"Pick Breakpoint": "Seleziona punto di interruzione",
			"Pick the node.js process to attach to": "Selezionare il processo node.js a cui collegarsi",
			"Please enter a number": "Immettere un numero",
			"Please enter a number greater than 1": "Immetti un numero maggiore di 1",
			"Please stop the running profile before starting a new one.": "Arrestare il profilo in esecuzione prima di avviarne uno nuovo.",
			"Process picker failed ({0})": "Selezione del processo non riuscita ({0})",
			"Profile duration in seconds, e.g \"5\"": "Durata del profilo in secondi, ad esempio \"5\"",
			"Profiling": "Profilatura",
			"Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "La profilatura con i punti di interruzione abilitati può modificare le prestazioni del codice. Può essere utile per convalidare i risultati con le condizioni di terminazione \"duration\" o \"manual\".",
			"Read More": "Altre informazioni",
			"Request Animation Frame": "Richiedi frame di animazione",
			"Resume AudioContext": "Riprendi AudioContext",
			"Return value": "Valore restituito",
			"Run Current File": "Esegui file corrente",
			"Run Node.js tool": "Esegui strumento Node.js",
			"Run Script: {0}": "Esegui script: {0}",
			"Run for a specific amount of time": "Esegui per un intervallo di tempo specifico",
			"Run until a specific breakpoint is hit": "Esegui finché non viene raggiunto un punto di interruzione specifico",
			"Run until manually stopped": "Esegui finché non viene arrestato manualmente",
			"Runs a Node.js command-line installed in the workspace node_modules.": "Esegue una riga di comando Node.js installata nell'area di lavoro node_modules.",
			"Saving": "Salvataggio",
			"Script": "Script",
			"Script Blocked by Content Security Policy": "Script bloccato dai criteri di sicurezza del contenuto",
			"Script First Statement": "Prima istruzione script",
			"Select a tab": "Selezionare una scheda",
			"Select a tool to run": "Selezionare uno strumento da eseguire",
			"Select current working directory for new terminal": "Selezionare la cartella di lavoro corrente per un nuovo terminale.",
			"Select test configuration to run": "Consente di selezionare la configurazione di test da eseguire.",
			"Select the page where you want to open the devtools": "Selezionare la pagina in cui si vuole aprire Devtools",
			"Select the session you want to inspect:": "Selezionare la sessione da ispezionare:",
			"Seller Reporting Phase Start": "Inizio fase reporting del venditore",
			"Seller Scoring Phase Start": "Inizio fase di assegnazione punteggio venditore",
			"Set innerHTML": "Imposta innerHTML",
			"Skipped by skipFiles": "Ignorato da skipFiles",
			"Skipped by smartStep": "Ignorato da smartStep",
			"Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Alcuni punti di interruzione potrebbero non funzionare nella versione di Node.js usata. È consigliabile eseguire l'aggiornamento per le correzioni di bug, prestazioni e sicurezza più recenti. Dettagli: https://aka.ms/AAcsvqm",
			"Source not a source map": "Origine non source map",
			"Source not found": "Origine non trovata",
			"Stack frame not found": "Stack frame non trovato",
			"Starting profile...": "Avvio del profilo in corso...",
			"Stopping profile...": "Arresto del profilo in corso...",
			"Suspend AudioContext": "Sospendi AudioContext",
			"Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Errore di sintassi durante l'impostazione del punto di interruzione con condizione {0} alla riga {1}: {2}",
			"Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "Pagina di destinazione non trovata. Potrebbe essere necessario aggiornare l'elemento \"urlFilter\" in modo che corrisponda alla pagina di cui eseguire il debug.",
			"The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "La versione di Node in \"{0}\" è obsoleta (versione {1}). È necessario almeno Node 8.x.",
			"The URL provided is invalid": "L'URL specificato non è valido",
			"The browser process exited with code {0} before connecting to the debug server. Make sure the `runtimeExecutable` is configured correctly and that it can run without errors.": "Il processo del browser è terminato con il codice {0} prima di connettersi al server di debug. Assicurarsi che il `runtimeExecutable` sia configurato correttamente e che possa essere eseguito senza errori.",
			"The configured `cwd` {0} does not exist.": "Il valore configurato {0} di `cwd` non esiste.",
			"The configured `cwd` {0} is not a folder.": "Il `cwd` {0} configurato non è una cartella.",
			"This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Questo è un percorso di file mancante a cui fa riferimento un mapping di origine. Eseguire invece il debug della versione compilata?",
			"Thread is not paused": "Il thread non viene sospeso",
			"Thread is not paused on exception": "Il thread non viene sospeso in corrispondenza di un'eccezione",
			"Thread not found": "Thread non trovato",
			"Type of profile": "Tipo di profilo",
			"URL contains \"{0}\"": "L'URL contiene \"{0}\"",
			"UWP webview debugging is not available on your platform.": "Il debug della visualizzazione Web della piattaforma UWP non è disponibile nella piattaforma.",
			"Unable to attach to browser": "Non è possibile collegarsi al browser",
			"Unable to evaluate": "Non è possibile valutare",
			"Unable to evaluate on async stack frame": "Non è possibile eseguire la valutazione in base allo stack frame asincrono",
			"Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "Nel sistema non è stata trovata alcuna installazione del browser. Provare a installarlo o a specificare un percorso assoluto del browser nella sezione \"runtimeExecutable\" del file launch.json.",
			"Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "Non è possibile trovare {0} versione {1}. Le versioni individuate automaticamente disponibili sono: {2}. È possibile impostare \"runtimeExecutable\" nel file launch.json su uno di questi valori o specificare un percorso assoluto del file eseguibile del browser.",
			"Unable to launch browser: \"{0}\"": "Non è possibile avviare il browser: \"{0}\"",
			"Unable to pause": "Non è possibile sospendere",
			"Unable to pretty print": "Non è possibile riformattare",
			"Unable to resume": "Non è possibile riprendere",
			"Unable to retrieve source content": "Non è possibile recuperare il contenuto di origine",
			"Unable to set variable value": "Non è possibile impostare il valore della variabile",
			"Unable to step in": "Non è possibile eseguire l'istruzione",
			"Unable to step next": "Non è possibile eseguire il passaggio successivo",
			"Unable to step out": "Non è possibile uscire dall'istruzione/routine",
			"Unbound breakpoint": "Punto di interruzione non associato",
			"Uncaught Exceptions": "Eccezioni non rilevate",
			"Unknown error": "Errore sconosciuto",
			"VS Code can provide better debugging experience for WebAssembly via \"DWARF Debugging\" extension. Would you like to install it?/\"DWARF Debugging\" is the extension name and should not be localized.": "VS Code può offrire un'esperienza di debug migliore per WebAssembly tramite l'estensione \"DWARF Debugging\". Desideri installarla?",
			"Variable not found": "Variabile non trovata",
			"Variables not available in async stacks": "Variabili non disponibili negli stack asincroni",
			"WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "AVVISO: l'elaborazione dei source map di {0} ha richiesto più di {1} ms, di conseguenza l'esecuzione è continuata senza attendere l'impostazione di tutti i punti di interruzione per lo script.",
			"We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "Non è possibile avviare un browser in modalità di debug da questa posizione. Se si vuole eseguire il debug di questa pagina Web, aprire l'area di lavoro da VS Code sul desktop.",
			"We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "Non è possibile avviare un browser in modalità di debug da questa posizione. Per abilitare il debug, aprire l'area di lavoro in VS Code sul desktop.",
			"WebGL Error Fired": "Errore di WebGL generato",
			"WebGL Warning Fired": "Avviso di WebGL generato",
			"With Block": "Blocco with",
			"Would you like to save a configuration in your launch.json for easy access later?": "Salvare una configurazione nel file launch.json per accedervi più facilmente in un secondo momento?",
			"XHR/Fetch URLs": "URL XHR/recupero",
			"Yes": "Sì",
			"You may install the `{}` module via npm for enhanced WebAssembly debugging": "È possibile installare il modulo '{}' tramite npm per il debug avanzato di WebAssembly",
			"You need to open a workspace folder to debug npm scripts.": "Per eseguire il debug di script npm, è necessario aprire una cartella dell'area di lavoro.",
			"You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Si sta eseguendo una versione obsoleta di Node.js. È consigliabile eseguire l'aggiornamento per ottenere le correzioni di bug, per le prestazioni e la sicurezza più recenti.",
			"an old debug session": "una sessione di debug meno recente",
			"breakpoint.provisionalBreakpoint": "breakpoint.provisionalBreakpoint",
			"path does not exist": "il percorso non esiste",
			"process id: {0} ({1})": "ID processo: {0} ({1})",
			"process id: {0}, debug port: {1} ({2})": "ID processo: {0}, porta di debug: {1} ({2})",
			"setInterval fired": "setInterval generato",
			"setTimeout fired": "setTimeout generato",
			"the configured userDataDir": "la directory userDataDir configurata",
			"{0} (couldn't describe: {1})": "{0} (non è stato possibile descrivere: {1})",
			"{0} Click to Stop Profiling": "{0} Fare clic per arrestare la profilatura",
			"{0} Click to Stop Profiling ({1} sessions)": "{0} Fare clic per arrestare la profilatura ({1} sessioni)",
			"{0} Click to Stop Profiling ({1})": "{0} Fare clic per arrestare la profilatura ({1})"
		}
	}
}