{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.eventListener.breakpoint": "Alternar puntos de interrupción de escucha de eventos",
			"add.xhr.breakpoint": "Agregar punto de interrupción de XHR/captura",
			"attach.node.process": "Conectarse con el proceso de Node",
			"base.cascadeTerminateToConfigurations.label": "Lista de sesiones de depuración que también se detendrán cuando se termine esta sesión de depuración.",
			"base.enableDWARF.label": "Alterna si el depurador intentará leer los símbolos de depuración DWARF de WebAssembly, que pueden usar muchos recursos. Requiere la extensión \"ms-vscode.wasm-stretch-debugging\" para funcionar.",
			"breakpoint.xhr.any": "Cualquier XHR/captura",
			"breakpoint.xhr.contains": "Interrumpir cuando la dirección URL contenga:",
			"browser.address.description": "La dirección IP o el nombre de host donde escucha el explorador depurado.",
			"browser.attach.port.description": "Puerto para usar con la depuración remota del explorador, indicado como \"--remote-debugging-port\" al iniciar el explorador.",
			"browser.baseUrl.description": "Dirección URL base para resolver rutas de acceso baseUrl. baseURL se recorta al asignar direcciones URL a los archivos del disco. El valor predeterminado es el dominio de la dirección URL de inicio.",
			"browser.browserAttachLocation.description": "Fuerza que el explorador se asocie en una ubicación. En un área de trabajo remota (por ejemplo, a través de SSH o WSL) se puede usar para asociarse a un explorador en la máquina remota, en lugar de localmente.",
			"browser.browserLaunchLocation.description": "Fuerza que el explorador se inicie en una ubicación. En un área de trabajo remota (por ejemplo, a través de SSH o WSL), se puede usar para abrir el explorador en la máquina remota en lugar de localmente.",
			"browser.cleanUp.description": "Limpieza que debe hacerse después de finalizar la sesión de depuración. Se puede cerrar solo la pestaña que se está depurando o bien cerrar todo el explorador.",
			"browser.cwd.description": "Directorio de trabajo opcional para el archivo ejecutable del entorno de ejecución.",
			"browser.disableNetworkCache.description": "Controla si se omite la memoria caché de red para cada solicitud.",
			"browser.env.description": "Diccionario opcional de pares clave/valor de entorno para el explorador.",
			"browser.file.description": "Archivo HTML local para abrirlo en el explorador",
			"browser.includeDefaultArgs.description": "Si los argumentos predeterminados de inicio del explorador (para deshabilitar las características que pueden dificultar la depuración) se incluirán en el lanzamiento.",
			"browser.includeLaunchArgs.description": "Avanzado: si se establecen argumentos predeterminados de inicio o depuración en el explorador. El depurador asumirá que el explorador usará depuración de canalización, como la que se proporciona con \"--remote-debugging-pipe\".",
			"browser.inspectUri.description": "Formato que se va a usar para reescribir el valor inspectUri: es una cadena de plantilla que interpola las claves en ''{curlyBraces}\". Las claves disponibles son:\r\n - \"url.*\" es la dirección analizada de la aplicación en ejecución. Por ejemplo, ''{url.port}\", \"{url.hostname}'\r\n'. - \"port\" es el puerto de depuración en el que Chrome está escuchando.\r\n - \"browserInspectUri\" es el URI del inspector en el explorador iniciado.\r\n - \"browserInspectUriPath\" es la parte de la ruta de acceso del URI del inspector en el explorador iniciado (por ejemplo, \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\").\r\n - \"wsProtocol\" es el protocolo websocket sugerido. Se establece en \"wss\" si la dirección URL original es \"https\"o en \"ws\" en caso contrario.\r\n",
			"browser.launch.port.description": "Puerto en que escucha el explorador. Se establece de manera predeterminada en \"0\", lo que provoca que el explorador se depure mediante canalizaciones. Esto suele ser más seguro y debe elegirse a menos que tenga que adjuntar el explorador desde otra herramienta.",
			"browser.pathMapping.description": "Asignación de direcciones URL/rutas a carpetas locales, para resolver scripts en el navegador a scripts en disco",
			"browser.perScriptSourcemaps.description": "Especifica si los scripts se cargan de forma individual con mapas de origen únicos que contengan el nombre base del archivo de código fuente. Puede establecerse para optimizar el tratamiento de los mapas de origen cuando se trabaja con un gran volumen de scripts pequeños. Si se establece en \"Automático\", se detectarán casos conocidos en los que esta operación sea adecuada.",
			"browser.profileStartup.description": "Si es true, la generación de perfiles comenzará tan pronto como se inicie el proceso",
			"browser.restart": "Si se debe reconectar si está cerrada la conexión del explorador",
			"browser.revealPage": "Pestaña de enfoque",
			"browser.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
			"browser.runtimeExecutable.description": "\"canary\", \"stable\", \"custom\" o ruta al ejecutable del explorador. Si se elige \"custom\", puede ser un encapsulador ajustable, una compilación ajustable o una variable de entorno CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "Puede ser un \"valor controlado\", \"estable\", desarrollo, \"personalizado\" o una ruta de acceso al ejecutable del explorador. El valor \"personalizado\" significa un contenedor personalizado, una compilación personalizada o una variable de entorno EDGE_PATH.",
			"browser.server.description": "Configura un servidor web para que se inicie. Toma la misma configuración que la tarea de lanzamiento \"node\".",
			"browser.skipFiles.description": "Matriz de nombres de archivo o carpeta, o patrones globales de ruta de acceso, que se omitirán durante la depuración. Se permiten patrones de estrella y negaciones, por ejemplo, \"[\"**/node_modules/**\", \"!**/node_modules/my-module/**\"]\"",
			"browser.smartStep.description": "Ejecuta paso a paso líneas no asignadas de archivos sin mapa de origen de forma automática. Por ejemplo, código que TypeScript produce automáticamente durante la compilación de async/await u otras características.",
			"browser.sourceMapPathOverrides.description": "Conjunto de asignaciones para reescribir las ubicaciones de los archivos de origen en sus ubicaciones en el disco, a partir de lo que indica el mapa de origen. Consulte el archivo LÉAME para obtener más detalles.",
			"browser.sourceMapRenames.description": "Indica si se debe usar la asignación \"names\" en mapas de origen. Para ello, es necesario solicitar contenido de origen, que puede ser lento con determinados depuradores.",
			"browser.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
			"browser.targetSelection": "Indica si se debe adjuntar a todos los destinos que coinciden con el filtro de dirección URL (\"automático\") o se le pide que seleccione uno (\"seleccionar\").",
			"browser.timeout.description": "Vuelva a intentar este número de milisegundos para conectarse al explorador. El valor predeterminado es 10000 ms.",
			"browser.url.description": "Buscará una pestaña con esta URL exacta y la adjuntará, si se encuentra",
			"browser.urlFilter.description": "Buscará una página con esta dirección URL y, si la encuentra, asociará la depuración a ella. Puede tener caracteres comodín (*).",
			"browser.userDataDir.description": "De forma predeterminada, el explorador se inicia con un perfil de usuario independiente en una carpeta temporal. Use esta opción para invalidarlo. Establézcalo en false para que se inicie con su perfil de usuario predeterminado. No se puede iniciar un nuevo explorador si ya se está ejecutando una instancia desde \"userDataDir\".",
			"browser.vueComponentPaths": "Lista de patrones globales de archivos para buscar componentes \"*.vue\". De forma predeterminada, busca en el área de trabajo al completo. Esto debe especificarse, debido a las búsquedas adicionales que los mapas de origen de Vue requieren en la CLI de Vue 4. Para deshabilitar este tratamiento especial, establézcalo en una matriz vacía.",
			"browser.webRoot.description": "Especifica la ruta de acceso absoluta del área de trabajo a la raíz del servidor web. Se usa para resolver rutas de acceso del tipo \"/app.js\" a archivos del disco. Forma abreviada para la asignación de rutas de acceso con \"/\".",
			"chrome.attach.description": "Adjuntar a una instancia de Chrome ya en modo de depuración",
			"chrome.attach.label": "Chrome: Asociar",
			"chrome.label": "Aplicación web (Chrome)",
			"chrome.launch.description": "Inicie Chrome para depurar una URL",
			"chrome.launch.label": "Chrome: Inicio",
			"commands.callersAdd.label": "Excluir al autor de la llamada",
			"commands.callersAdd.paletteLabel": "Excluir al autor de la llamada de la pausa en la ubicación actual",
			"commands.callersGoToCaller.label": "Ir a la ubicación del autor de la llamada",
			"commands.callersGoToTarget.label": "Ir a la ubicación de destino",
			"commands.callersRemove.label": "Quitar al autor de la llamada excluido",
			"commands.callersRemoveAll.label": "Quitar todos los autores de la llamada excluidos",
			"commands.disableSourceMapStepping.label": "Deshabilitar la ejecución paso a paso asignada de origen",
			"commands.enableSourceMapStepping.label": "Habilitar la ejecución paso a paso asignada de origen",
			"commands.networkClear.label": "Borrar registro de red",
			"commands.networkCopyURI.label": "Copiar URL de solicitud",
			"commands.networkOpenBody.label": "Abrir cuerpo de respuesta",
			"commands.networkOpenBodyInHexEditor.label": "Abrir cuerpo de respuesta en el editor hexadecimal",
			"commands.networkReplayXHR.label": "Solicitud de reproducción",
			"commands.networkViewRequest.label": "Ver solicitud como cURL",
			"configuration.autoAttachMode": "Configura los procesos que se van a asociar y a depurar automáticamente cuando \"#debug.node.autoAttach#\" esté activado. Un proceso de Node iniciado con la marca \"--inspect\" se asociará siempre, independientemente de esta configuración.",
			"configuration.autoAttachMode.always": "Asocia automáticamente a todos los procesos de Node.js iniciados en el terminal.",
			"configuration.autoAttachMode.disabled": "Conexión automática está desactivada y no se muestra en la barra de estado.",
			"configuration.autoAttachMode.explicit": "Solo se puede asociar automáticamente cuando se proporciona la marca \"--inspect\".",
			"configuration.autoAttachMode.smart": "Asocia automáticamente cuando se ejecutan scripts que no están en una carpeta node_modules.",
			"configuration.autoAttachSmartPatterns": "Configura patrones globales para determinar cuándo asociar en modo \"smart\" \"#debug.javascript.autoAttachFilter#\". \"$KNOWN _TOOLS $\" se reemplaza por una lista de nombres de ejecutores de pruebas y código comunes. [Más información en la documentación de VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.automaticallyTunnelRemoteServer": "Al depurar una aplicación web remota, se establece si se debe hacer un túnel automático del servidor remoto al equipo local.",
			"configuration.breakOnConditionalError": "Controla si se debe detener cuando los puntos de interrupción condicionales producen un error.",
			"configuration.debugByLinkOptions": "Opciones utilizadas al depurar vínculos abiertos en los que se ha hecho clic desde dentro del terminal de depuración. Se puede establecer en \"false\" para deshabilitar este comportamiento.",
			"configuration.defaultRuntimeExecutables": "Valor predeterminado de \"runtimeExecutable\" que se usa para las configuraciones de inicio, si no se especifica un valor. Se puede usar para configurar rutas de acceso personalizadas a Node.js o a las instalaciones del explorador.",
			"configuration.enableNetworkView": "Habilita la vista de red experimental para los destinos que la admiten.",
			"configuration.npmScriptLensLocation": "Lugar en que se debe mostrar una lente de código \"Ejecutar\" y \"Depurar\" en los scripts npm. Puede estar en todos, en scripts, sobre la sección del script o bien no mostrarse nunca.",
			"configuration.pickAndAttachOptions": "Opciones predeterminadas que se usan al depurar un proceso mediante el comando \"Debug: Attach to Node.js Process\"",
			"configuration.resourceRequestOptions": "Opciones de solicitud que se van a usar al cargar los recursos (como los mapas de origen) en el depurador. Puede ser necesario configurar esto si los mapas de origen requieren autenticación o el uso de un certificado autofirmado, por ejemplo. Las opciones se usan para crear una solicitud con la biblioteca [\"got\"](https://github.com/sindresorhus/got).\r\n\r\nUn caso habitual para deshabilitar la comprobación de certificados puede realizarse si se pasa \"{ \"https\": { \"rejectUnauthorized\": false } }\".",
			"configuration.terminalOptions": "Opciones de inicio predeterminadas para el terminal de depuración de JavaScript y los scripts npm.",
			"configuration.unmapMissingSources": "Configura si el archivo sin mapa de origen donde no se puede leer el archivo original se desasignará automáticamente. Si es false (predeterminado), se muestra un mensaje.",
			"createDiagnostics.label": "Diagnosticar problemas de punto de interrupción",
			"customDescriptionGenerator.description": "Personaliza la descripción de texto que el depurador muestra para los objetos (variables locales, etc...). Ejemplos:\r\n      1. this.toString() // Llama a toString para imprimir todos los objetos\r\n.      2. this.customDescription ? this.customDescription() : defaultValue // Usa el método customDescription si está disponible, si no devuelve defaultValue.\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Usa el método customDescription si está disponible, si no devuelve defaultValue.\r\n      ",
			"customPropertiesGenerator.description": "Personalice las propiedades que se muestran para un objeto en el depurador (variables locales, etc.). Ejemplos:\r\n    1. { ...this, extraProperty: '12345' } // Agregue una propiedad extraproperty 12345 a todos los objetos.\r\n    2. this.customProperties ? this.customProperties() : this // Use el método customProperties, si está disponible; en caso contrario, use las propiedades de este (las propiedades predeterminadas).\r\n    3. function () { return this.customProperties ? this.customProperties() : this } // Use el método customDescription, si está disponible; en caso contrario, se devuelven las propiedades predeterminadas.\r\n\r\n    En desuso: esta es una implementación temporal de esta característica hasta que tengamos tiempo para implementarla de la forma aquí descrita: https://github.com/microsoft/vscode/issues/102181",
			"debug.npm.edit": "Editar package.json",
			"debug.npm.noScripts": "No se han encontrado scripts npm en su package.json",
			"debug.npm.noWorkspaceFolder": "Debe abrir una carpeta de área de trabajo para depurar scripts npm.",
			"debug.npm.parseError": "No se pudo leer {0}: {1}",
			"debug.npm.script": "Depurar script npm",
			"debug.terminal.attach": "Asociar al proceso del terminal Node.js",
			"debug.terminal.label": "Terminal de depuración de JavaScript",
			"debug.terminal.program.description": "Comando para ejecutar en el terminal iniciado. Si no se proporciona, el terminal se abrirá sin iniciar un programa.",
			"debug.terminal.snippet.label": "Ejecute \"npm start\" en un terminal de depuración",
			"debug.terminal.toggleAuto": "Alternar la asociación automática de Node.js del terminal",
			"debug.terminal.welcome": "[Terminal de depuración de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nPuede usar el terminal de depuración de JavaScript para depurar los procesos de Node.js que se ejecutan en la línea de comandos.",
			"debug.terminal.welcomeWithLink": "[Terminal de depuración de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nPuede usar el terminal de depuración de JavaScript para depurar los procesos de Node.js que se ejecutan en la línea de comandos.\r\n\r\n[Dirección URL de depuración](command:extension.js-debug.debugLink)",
			"debug.unverifiedBreakpoints": "No se pudieron establecer algunos de los puntos de interrupción. Si tiene un problema, puede [solucionar problemas de la configuración de inicio](command:extension.js-debug.createDiagnostics).",
			"debugLink.label": "Abrir vínculo",
			"edge.address.description": "Al depurar vistas web, la dirección IP o el nombre de host en que está escuchando la vista web. Se detectará automáticamente si no se establece.",
			"edge.attach.description": "Adjuntar a una instancia de Microsoft Edge ya en modo de depuración",
			"edge.attach.label": "Edge: Asociar",
			"edge.label": "Aplicación web (Edge)",
			"edge.launch.description": "Iniciar Microsoft Edge para depurar una dirección URL",
			"edge.launch.label": "Edge: Iniciar",
			"edge.port.description": "Al depurar vistas web, el puerto en que escucha el depurador de la vista web. Se detectará automáticamente si no se establece.",
			"edge.useWebView.attach.description": "Objeto que contiene el \"pipeName\" de una canalización de depuración para una Webview2 hospedada por UWP. Este es el valor \"MyTestSharedMemory\" al crear la canalización \"\\\\.\\pipe\\LOCAL\\MyTestSharedMemory\"",
			"edge.useWebView.launch.description": "Cuando sea \"verdadero\", el depurador tratará el ejecutable del entorno de ejecución como una aplicación host que contiene un elemento WebView que le permite depurar el contenido del script WebView.",
			"edit.xhr.breakpoint": "Editar punto de interrupción de XHR/captura",
			"enableContentValidation.description": "Alterna si se comprueba si el contenido de los archivos en el disco coincide con lo que se ha cargado en el entorno de ejecución. Resulta útil en diversos escenarios y es necesario en otros, pero puede causar problemas si, por ejemplo, se aplica la transformación de scripts del lado servidor.",
			"errors.timeout": "{0}: tiempo de espera después de {1} ms",
			"extension.description": "Extensión para depurar programas Node.js y Chrome.",
			"extensionHost.label": "Desarrollo de extensiones de VS Code",
			"extensionHost.launch.config.name": "Extensión de inicio",
			"extensionHost.launch.debugWebWorkerHost": "Configura si debe intentarse la conexión con el host de extensiones de trabajo web.",
			"extensionHost.launch.debugWebviews": "Configura si se debe intentar adjuntar a vistas web en la instancia de VS Code iniciada. Esto solo funcionará en VS Code de escritorio.",
			"extensionHost.launch.env.description": "Variables de entorno pasadas al host de extensiones.",
			"extensionHost.launch.rendererDebugOptions": "Opciones de inicio de Chrome que se usan al asociarse al proceso de representador, con \"debugWebviews\" o \"debugWebWorkerHost\".",
			"extensionHost.launch.runtimeExecutable.description": "Ruta de acceso absoluta a VS Code.",
			"extensionHost.launch.stopOnEntry.description": "El host de extensiones se detiene automáticamente tras el inicio.",
			"extensionHost.launch.testConfiguration": "Ruta de acceso a un archivo de configuración de prueba para la [CLI de prueba](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).",
			"extensionHost.launch.testConfigurationLabel": "Una única configuración para ejecutar desde el archivo. Si no se especifica, es posible que se le pida que elija.",
			"extensionHost.snippet.launch.description": "Iniciar una extensión de VS Code en modo de depuración",
			"extensionHost.snippet.launch.label": "Desarrollo de extensiones de VS Code",
			"getDiagnosticLogs.label": "Guardar los registros de depuración JS de diagnóstico",
			"longPredictionWarning.disable": "No volver a mostrar",
			"longPredictionWarning.message": "Los puntos de interrupción están tardando en configurarse. Puede acelerarlo actualizando \"outFiles\" en su archivo launch.json.",
			"longPredictionWarning.noFolder": "No hay ninguna carpeta del área de trabajo abierta.",
			"longPredictionWarning.open": "Abrir launch.json",
			"node.address.description": "Dirección TCP/IP del proceso que se va a depurar. El valor predeterminado es \"localhost\".",
			"node.attach.attachExistingChildren.description": "Si se intenta adjuntar a procesos secundarios ya generados.",
			"node.attach.attachSpawnedProcesses.description": "Si se deben establecer variables de entorno en el proceso adjunto para realizar un seguimiento de los elementos secundarios generados.",
			"node.attach.config.name": "Adjuntar",
			"node.attach.continueOnAttach": "Si es true, reanudaremos automáticamente los programas iniciados y esperando en \"--inspect-brk\"",
			"node.attach.processId.description": "Identificador del proceso al que se va a asociar.",
			"node.attach.restart.description": "Intente volver a conectarse al programa si se pierde la conexión. Si se establece en \"true\", se intentará una vez por segundo, para siempre. En su lugar, puede personalizar el intervalo y el número máximo de intentos mediante la especificación de los valores \"delay\" y \"maxAttempts\" en un objeto.",
			"node.attachSimplePort.description": "Si se establece, se asocia al proceso a través del puerto especificado. Esto generalmente ya no es necesario en programas de Node.js y pierde la capacidad de depurar los procesos secundarios. Sin embargo, puede ser útil en escenarios más esotéricos, como en los lanzamientos de Deno y Docker. Si se establece en 0, se elegirá un puerto aleatorio y se agregará --inspect-brk a los argumentos de inicio de forma automática.",
			"node.console.title": "Consola de depuración de nodos",
			"node.disableOptimisticBPs.description": "No establezca puntos de interrupción en ningún archivo hasta que se haya cargado un mapa de origen para el archivo.",
			"node.enableTurboSourcemaps.description": "Configura si se va a usar un mecanismo nuevo y más rápido para la detección de mapas de origen",
			"node.experimentalNetworking.description": "Habilite la inspección experimental en Node.js. Cuando se establece en \"auto\", se habilita para las versiones de Node.js que lo admiten. Se puede establecer en \"activado\" o \"desactivado\" para habilitarlo o deshabilitarlo explícitamente.",
			"node.killBehavior.description": "Configure el modo en que terminan los procesos de depuración al detener la sesión. Puede ser:\r\n\r\n- forceful (predeterminado): anula de manera forzosa el árbol de procesos. Envía SIGKILL en posix o \"taskkill.exe /F\" en Windows.\r\n- polite: anula correctamente el árbol de procesos. Es posible que los procesos con un comportamiento erróneo se sigan ejecutando después de apagar de esta forma. Envía SIGTERM en posix o \"taskkill.exe\" sin la marca \"/F\" (forzar) en Windows.\r\n- none: no se producirá ninguna terminación.",
			"node.label": "Node.js",
			"node.launch.args.description": "Argumentos de línea de comandos que se pasan al programa.\r\n\r\nPuede ser una matriz de cadenas o una sola cadena. Cuando el programa se inicia en un terminal, establecer esta propiedad en una sola cadena hará que los argumentos no se escapen para el shell.",
			"node.launch.autoAttachChildProcesses.description": "Asociar automáticamente el depurador a los procesos secundarios nuevos.",
			"node.launch.config.name": "Iniciar",
			"node.launch.console.description": "Lugar donde debe iniciarse el destino de depuración.",
			"node.launch.console.externalTerminal.description": "Terminal externo que puede configurarse desde Configuración del usuario.",
			"node.launch.console.integratedTerminal.description": "Terminal integrado de VS Code",
			"node.launch.console.internalConsole.description": "Consola de depuración de VS Code (que no admite la lectura de entradas de un programa)",
			"node.launch.cwd.description": "Ruta de acceso absoluta al directorio de trabajo del programa que se está depurando. Si ha establecido localRoot, cwd coincidirá con ese valor; de lo contrario, se revertirá a su workspaceFolder.",
			"node.launch.env.description": "Variables de entorno pasadas al programa. El valor \"null\" elimina la variable del entorno.",
			"node.launch.envFile.description": "Ruta de acceso absoluta a un archivo que contiene definiciones de variables de entorno.",
			"node.launch.logging": "Configuración de registro",
			"node.launch.logging.cdp": "Ruta al archivo de registro para los mensajes del protocolo DevTools de Chrome",
			"node.launch.logging.dap": "Ruta de acceso al archivo de registro para los mensajes del Protocolo de adaptador de depuración",
			"node.launch.outputCapture.description": "Ubicación desde donde se van a capturar los mensajes de salida: la API de depuración predeterminada si se establece en \"console\" o las secuencias stdout/stderr si se establece en \"std\".",
			"node.launch.program.description": "Ruta de acceso absoluta al programa. El valor generado se infiere de package.json y de los archivos abiertos. Edite este atributo.",
			"node.launch.restart.description": "Pruebe a reiniciar el programa si se cierra un código de salida distinto de cero.",
			"node.launch.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
			"node.launch.runtimeExecutable.description": "Entorno de ejecución que debe usarse. Puede ser una ruta de acceso absoluta o el nombre de un entorno de ejecución disponible en PATH. Si se omite, se utiliza \"node\".",
			"node.launch.runtimeSourcemapPausePatterns": "Lista de patrones en los que se insertan manualmente puntos de interrupción de punto de entrada. Puede ser útil para proporcionar al depurador una oportunidad para establecer puntos de interrupción al usar mapas origen que no existen o que no se pueden detectar antes de iniciar, como [con Serverless Framework](https://github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Versión del entorno de ejecución de \"Node\" que debe usarse. Requiere \"NVM\".",
			"node.launch.useWSL.deprecation": "\"useWSL\" está en desuso y se eliminará el soporte correspondiente. Utilice la extensión \"Remote - WSL\" en su lugar.",
			"node.launch.useWSL.description": "Utilice el subsistema de Windows para Linux.",
			"node.localRoot.description": "Ruta de acceso al directorio local que contiene el programa.",
			"node.pauseForSourceMap.description": "Si desea esperar a que se carguen los mapas de origen para cada script entrante. Esto tiene una sobrecarga de rendimiento y puede deshabilitarse de forma segura cuando se queda sin disco, siempre y cuando \"rootPath\" no esté deshabilitado.",
			"node.port.description": "El puerto de depuración al que se va a asociar. El valor predeterminado es 9229.",
			"node.processattach.config.name": "Asociar al proceso",
			"node.profileStartup.description": "Si es cierto, comenzará a generar perfiles tan pronto como se inicie el proceso.",
			"node.remote.host.header.description": "Encabezado host explícito que se va a usar al conectarse al websocket del inspector. Si no se especifica, el encabezado de host se establecerá en \"localhost\". Esto es útil cuando el inspector se ejecuta detrás de un proxy que solo acepta un encabezado host determinado.",
			"node.remoteRoot.description": "Ruta de acceso absoluta al directorio remoto que contiene el programa.",
			"node.resolveSourceMapLocations.description": "Lista de patrones de minimatch para ubicaciones (carpetas y direcciones URL) en las que se pueden utilizar mapas de origen para resolver archivos locales. Se puede utilizar para evitar la interrupción incorrecta en el código asignado de origen externo. Los patrones se pueden prefijar con \"!\" para excluirlos. Se puede establecer en una matriz vacía o nula para evitar restricciones.",
			"node.showAsyncStacks.description": "Muestra las llamadas asincrónicas que llevan a la pila de llamadas actual.",
			"node.snippet.attach.description": "Adjuntar a un nodo en ejecución",
			"node.snippet.attach.label": "Node.js: Attach",
			"node.snippet.attachProcess.description": "Abrir el selector de procesos para elegir el proceso de Node para conectarse",
			"node.snippet.attachProcess.label": "Node.js: adjuntar a proceso",
			"node.snippet.electron.description": "Depurar el proceso principal de Electron",
			"node.snippet.electron.label": "Node.js: proceso principal de Electron",
			"node.snippet.gulp.description": "Depurar tarea de Gulp (asegúrese de tener Gulp instalado localmente en el proyecto)",
			"node.snippet.gulp.label": "Node.js: tarea de Gulp",
			"node.snippet.launch.description": "Iniciar un programa de nodo en modo de depuración",
			"node.snippet.launch.label": "Node.js: iniciar programa",
			"node.snippet.mocha.description": "Depurar pruebas de Mocha",
			"node.snippet.mocha.label": "Node.js: pruebas de Mocha",
			"node.snippet.nodemon.description": "Use nodemon para reiniciar una sesión de depuración en los cambios de origen",
			"node.snippet.nodemon.label": "Node.js: configuración de Nodemon",
			"node.snippet.npm.description": "Inicia un programa de Node con un script \"debug\" de npm.",
			"node.snippet.npm.label": "Node.js: iniciar mediante npm",
			"node.snippet.remoteattach.description": "Adjuntar al puerto de depuración de un programa de nodo remoto",
			"node.snippet.remoteattach.label": "Node.js: adjuntar a programa remoto",
			"node.snippet.yo.description": "Depurar generador de Yeoman (se instala ejecutando \"npm link\" en la carpeta del proyecto).",
			"node.snippet.yo.label": "Node.js: generador de Yeoman",
			"node.sourceMapPathOverrides.description": "Un conjunto de mapeos para reescribir las localizaciones de los ficheros fuente con lo que los mapas fuente indican, a sus ubicaciones en disco.",
			"node.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
			"node.stopOnEntry.description": "El programa se detiene automáticamente tras el inicio.",
			"node.timeout.description": "Vuelva a probar con este número de milisegundos para conectarse a Node.js. El valor predeterminado es 10000 ms.",
			"node.versionHint.description": "Permite especificar explícitamente la versión del nodo que se está ejecutando, que se puede usar para deshabilitar o habilitar determinados comportamientos en los casos en los que la detección automática de versiones no funciona.",
			"node.websocket.address.description": "Dirección de WebSocket exacta a la que se va a asociar. Si no se especifica, se detectará a partir de la dirección y el puerto.",
			"openEdgeDevTools.label": "Abrir las herramientas de desarrollo del explorador",
			"outFiles.description": "Si los mapas de origen están habilitados, estos patrones globales especifican los archivos JavaScript generados. Si un patrón comienza con '!' los archivos se excluyen. Si no se especifica, el código generado se espera en el mismo directorio que su origen.",
			"pretty.print.script": "Bastante impresión para depuración",
			"profile.start": "Tomar el perfil de rendimiento",
			"profile.stop": "Detener el perfil de rendimiento",
			"remove.eventListener.breakpoint.all": "Quitar todos los puntos de interrupción de escucha de eventos",
			"remove.xhr.breakpoint": "Quitar punto de interrupción de XHR/captura",
			"remove.xhr.breakpoint.all": "Quitar todos los puntos de interrupción de XHR/captura",
			"requestCDPProxy.label": "Solicitar proxy de CDP para la sesión de depuración",
			"skipFiles.description": "Una matriz de patrones globales para que los archivos omitan al depurar. El patrón \"<node_internals>/**\" coincide con todos los módulos internos de Node.js.",
			"smartStep.description": "Explore automáticamente el código generado que no se puede volver a asignar al código fuente original.",
			"start.with.stop.on.entry": "Iniciar depuración y detenerla tras el inicio",
			"startWithStopOnEntry.label": "Iniciar depuración y detenerla tras el inicio",
			"timeouts.generalDescription": "Tiempos de espera de varias operaciones del depurador",
			"timeouts.generalDescription.markdown": "Tiempos de espera de varias operaciones del depurador",
			"timeouts.hoverEvaluation.description": "Tiempo hasta que se anula la evaluación del valor de los símbolos al mantener el puntero. Si se establece en 0, la evaluación al mantener el mouse nunca agota el tiempo de espera.",
			"timeouts.sourceMaps.description": "Tiempos de espera relacionados con las operaciones de mapas de origen",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Tiempo extra en milisegundos permitido por cada sesión para esperar a que se procesen las asignaciones de origen, después de que se agote el tiempo mínimo (sourceMapMinPause)",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Tiempo mínimo en milisegundos dedicado a esperar a que cada asignación de origen se procese cuando se está analizando un script",
			"toggle.skipping.this.file": "Cambiar y omitir este archivo",
			"trace.boolean.description": "El seguimiento se puede establecer en \"true\" para escribir registros de diagnóstico en el disco.",
			"trace.description": "Configura qué salida de diagnóstico se produce.",
			"trace.logFile.description": "Configura dónde se escriben los registros de disco.",
			"trace.stdio.description": "Si desea devolver datos de seguimiento desde la aplicación o el explorador iniciados.",
			"workspaceTrust.description": "Se necesita confianza para depurar el código de esta área de trabajo."
		},
		"bundle": {
			"A profiling session is already running, would you like to stop it and start a new session?": "Ya se está ejecutando una sesión de generación de perfiles. ¿Quiere detenerla e iniciar una sesión nueva?",
			"Add XHR Breakpoint": "Agregar punto de interrupción de XHR",
			"Add new URL...": "Agregar nueva dirección URL...",
			"Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Ajusta modelos globales en los atributos ‘outFiles’ para cubrir el código JavaScript generado.",
			"Always": "Siempre",
			"Always in this Workspace": "Siempre en esta área de trabajo",
			"An error occurred taking a profile from the target.": "Error al tomar un perfil del destino.",
			"Animation Frame Fired": "Fotograma de animación activado",
			"Any XHR or fetch": "Cualquier XHR o captura",
			"Assertion failed": "Error de aserción",
			"Attach to process: '{0}' doesn't look like a process id.": "Asociar al proceso: '{0}' no parece un id de proceso.",
			"Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Asociar al proceso: no se puede habilitar el modo de depuración para el proceso '{0}' ({1}).",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "El atributo \"runtimeVersion\" requiere el administrador de versiones \"nvm-windows\" o \"nvs\" de Node.js.",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvs', 'nvm' or 'fnm' to be installed.": "El atributo \"runtimeVersion\" requiere que se instale el administrador de versiones de Node.js \"nvs\", \"nvm\" o \"fnm\".",
			"Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "El atributo \"runtimeVersion\" con un tipo o arquitectura requiere que se instale \"nvs\".",
			"Bidder Bidding Phase Start": "Inicio de la fase pujas",
			"Bidder Reporting Phase Start": "Inicio de la fase de informes de pujas",
			"Block": "Bloquear",
			"Break when URL Contains": "Interrumpir cuando la dirección URL contenga",
			"Breaks on all throw errors, even if they're caught later.": "Se interrumpe en todos los errores de inicio, incluso si se detectan más tarde.",
			"Breaks only on errors or promise rejections that are not handled.": "Solo se interrumpe en caso de errores o rechazos de promesas que no se controlan.",
			"Browser connection failed, will retry: {0}": "Error en la conexión del explorador, se reintentará: {0}",
			"CPU Profile": "Perfil de CPU",
			"CPU profile saved as \"{0}\" in your workspace folder": "Perfil de CPU guardado como \"{0}\" en la carpeta del área de trabajo",
			"CSP violation \"{0}\"": "Infracción de CSP \"{0}\"",
			"Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "No se encuentra el binario de Node.js \"{0}\": {1}. Asegúrese de que Node.js esté instalado y en PATH, o bien establezca \"runtimeExecutable\" en launch.json.",
			"Can't load environment variables from file ({0}).": "No se pueden cargar las variables de entorno del archivo ({0}).",
			"Cancel Animation Frame": "Cancelar el fotograma de animación",
			"Cannot connect to the target at {0}: {1}": "No se puede conectar con el destino en {0}: {1}",
			"Cannot find `{0}` installed in {1}": "No se encuentra “{0}” instalado en {1}",
			"Cannot find a program to debug": "No se encuentra ningún programa para depurar.",
			"Cannot find test configuration with label `{0}`, got: {1}": "No se encuentra la configuración de prueba con la etiqueta “{0}”, se obtuvo: {1}",
			"Cannot launch debug target in terminal ({0}).": "No se puede iniciar el destino de depuración en el terminal ({0}).",
			"Cannot restart asynchronous frame": "No se puede reiniciar un fotograma asincrónico",
			"Cannot set an empty value": "No se puede establecer un valor vacío",
			"Catch Block": "Bloque catch",
			"Caught Exceptions": "Excepciones detectadas",
			"Close AudioContext": "Cerrar AudioContext",
			"Closure": "Clausura",
			"Closure ({0})": "Clausura ({0})",
			"Console profile started": "Perfil de consola iniciado",
			"Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "No se pudo conectar a ninguna canalización de vista web UWP. Asegúrese de que la vista web esté hospedada en modo de depuración y de que el valor de \"pipeName\" de \"launch.json\" sea correcto.",
			"Could not find a location for the variable": "No se pudo encontrar una ubicación para la variable",
			"Could not query the provided object": "No se pudo consultar el objeto proporcionado.",
			"Could not read source map for {0}: {1}": "No se pudo leer el mapa de origen de {0}: {1}",
			"Could not read {0}: {1}": "No se pudo leer {0}: {1}",
			"Create AudioContext": "Crear AudioContext",
			"Create canvas context": "Crear contexto del lienzo",
			"Debug Anyway": "Depurar de todos modos",
			"Debug URL": "Depurar dirección URL",
			"Details": "Detalles",
			"Don't show again": "No volver a mostrar",
			"Duration": "Duración",
			"Duration of Profile": "Duración del perfil",
			"Edit XHR Breakpoint": "Editar punto de interrupción de XHR",
			"Edit package.json": "Editar package.json",
			"Enables Node.js [auto attach]({0}) debugging in \"{1}\" mode/{Locked='[auto attach]({0})'}the 2nd placeholder is the setting value": "Habilita la depuración de Node.js [auto attach]({0}) en el modo \"{1}\"",
			"Enter a URL or a pattern to match": "Escriba una dirección URL o un patrón para coincidir",
			"Eval": "Eval",
			"Frame could not be restarted": "No se pudo reiniciar el marco",
			"Generates a .cpuprofile file you can open in VS Code or the Edge/Chrome devtools": "Genera un archivo .cpuprofile que se puede abrir en VS Code o Edge/Chrome DevTools",
			"Generates a .heapprofile file you can open in VS Code or the Edge/Chrome devtools": "Genera un archivo .heapprofile que se puede abrir en VS Code o Edge/Chrome DevTools",
			"Generates a .heapsnapshot file you can open in VS Code or the Edge/Chrome devtools": "Genera un archivo .heapsnapshot que se puede abrir en VS Code o Edge/Chrome DevTools",
			"Global": "Global",
			"Globals": "Globales",
			"Got it!": "¡Entendido!",
			"Heap Profile": "Perfil de montón",
			"Heap Snapshot": "Instantánea de montón",
			"How long to run the profile": "Tiempo que se va a ejecutar el perfil",
			"Ignore": "Ignorar",
			"Installation complete! The extension will be used after you restart your debug session.": "Instalación completada La extensión se usará después de reiniciar la sesión de depuración.",
			"Installing the DWARF debugger...": "Instalando el depurador DWARF...",
			"Invalid expression": "Expresión no válida",
			"Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "La condición de acierto \"{0}\" no es válida. Se esperaba una expresión como \"> 42\" o \"== 2\".",
			"It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Parece que ya se está ejecutando un explorador desde {0}. Ciérrelo antes de intentar la depuración; de lo contrario, es posible que VS Code posible no pueda conectarse a él.",
			"It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Parece que la sesión de depuración ya ha finalizado. Intente volver a depurar y, luego, ejecute el comando \"Debug: Diagnose Breakpoint Problems\".",
			"It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "Los puntos de interrupción están tardando en configurarse. Puede acelerarlo actualizando \"outFiles\" en su archivo launch.json.",
			"JavaScript Debug Terminal": "Terminal de depuración de JavaScript",
			"JavaScript debug adapter": "Adaptador de depuración de JavaScript",
			"Launch Chrome against localhost": "Iniciar Chrome para localhost",
			"Launch Edge against localhost": "Iniciar Microsoft Edge para localhost",
			"Launch Program": "Iniciar el programa",
			"Launch configuration created based on 'package.json'.": "La configuración de inicio fue creada basada en \"package.json\".",
			"Launch configuration for '{0}' project created.": "La configuración de inicio del proyecto '{0}' fue creada. ",
			"Local": "Local",
			"Locals": "Locales",
			"Lost connection to debugee, reconnecting in {0}ms\r\n": "Se perdió la conexión con el elemento que se va a depurar; se volverá a conectar en {0} ms\r\n",
			"Manual": "Manual",
			"Module": "Módulo",
			"Networking not available.": "Redes no disponibles.",
			"Never": "Nunca",
			"No": "No",
			"No npm scripts found in the workspace folder.": "No se encontraron scripts npm en la carpeta del área de trabajo.",
			"No npm scripts found in your package.json": "No se han encontrado scripts npm en su package.json",
			"No package.json files found in your workspace.": "No se encontraron archivos package.json en el área de trabajo.",
			"No workspace folder open.": "No hay ninguna carpeta del área de trabajo abierta.",
			"Node Attributes": "Atributos de nodo",
			"Node.js version '{0}' not installed using version manager {1}.": "La versión de Node.js \"{0}\" no se instaló con el administrador de versiones {1}.",
			"Not Now": "Ahora no",
			"Only objects can be queried": "Solo se pueden consultar objetos",
			"Open launch.json": "Abrir launch.json",
			"Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "La salida se ha truncado a los primeros {0} caracteres. Ejecute \"{1}\" para copiar la salida completa.",
			"Parameters": "Parámetros",
			"Paused": "En pausa",
			"Paused before Out Of Memory exception": "En pausa antes de la excepción de memoria insuficiente",
			"Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "En pausa por un punto de interrupción de instrumentación de infracción de la directiva de seguridad de contenido, directiva \"{0}\"",
			"Paused on DOM breakpoint": "En pausa por un punto de interrupción de DOM",
			"Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "En pausa por un punto de interrupción de instrumentación de error de WebGL, error \"{0}\"",
			"Paused on XMLHttpRequest or fetch": "En pausa por XMLHttpRequest o \"fetch\"",
			"Paused on assert": "En pausa por una aserción",
			"Paused on breakpoint": "En pausa por un punto de interrupción",
			"Paused on debug() call": "En pausa por una llamada a debug()",
			"Paused on debugger statement": "En pausa por una instrucción del depurador",
			"Paused on event listener": "En pausa por una escucha de eventos",
			"Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "En pausa por un punto de interrupción de escucha de eventos \"{0}\", desencadenado en \"{1}\"",
			"Paused on exception": "En pausa por una excepción",
			"Paused on frame entry": "En pausa por una entrada de marco",
			"Paused on instrumentation breakpoint": "En pausa por un punto de interrupción de instrumentación",
			"Paused on instrumentation breakpoint \"{0}\"": "En pausa por un punto de interrupción de instrumentación \"{0}\"",
			"Paused on {0}": "En pausa en {0}",
			"Pick Breakpoint": "Seleccionar un punto de interrupción",
			"Pick the node.js process to attach to": "Seleccione el proceso node. js para adjuntarlo a",
			"Please enter a number": "Escriba un número.",
			"Please enter a number greater than 1": "Especifique un número mayor que 1.",
			"Please stop the running profile before starting a new one.": "Detenga el perfil en ejecución antes de iniciar uno nuevo.",
			"Process picker failed ({0})": "Falló el selector de proceso ({0})",
			"Profile duration in seconds, e.g \"5\"": "Duración del perfil en segundos; por ejemplo, \"5\"",
			"Profiling": "Generación de perfiles",
			"Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "La generación de perfiles con los puntos de interrupción habilitados puede cambiar el rendimiento del código. Puede resultar útil validar los resultados con las condiciones de terminación \"duración\" o \"manual\".",
			"Read More": "Más información",
			"Request Animation Frame": "Solicitar fotograma de animación",
			"Resume AudioContext": "Reanudar AudioContext",
			"Return value": "Valor devuelto",
			"Run Current File": "Ejecutar el archivo actual",
			"Run Node.js tool": "Ejecutar herramienta Node.js",
			"Run Script: {0}": "Ejecutar el script: {0}",
			"Run for a specific amount of time": "Ejecutar durante un período de tiempo específico",
			"Run until a specific breakpoint is hit": "Ejecutar hasta que se alcance un punto de interrupción específico",
			"Run until manually stopped": "Ejecutar hasta que se detenga manualmente",
			"Runs a Node.js command-line installed in the workspace node_modules.": "Ejecuta una línea de comandos Node.js instalada en el área de trabajo node_modules.",
			"Saving": "Guardando",
			"Script": "Script",
			"Script Blocked by Content Security Policy": "Script bloqueado por la directiva de seguridad de contenido",
			"Script First Statement": "Primera instrucción del script",
			"Select a tab": "Seleccionar una pestaña",
			"Select a tool to run": "Seleccionar una herramienta para ejecutar",
			"Select current working directory for new terminal": "Seleccione el directorio de trabajo actual para el nuevo terminal",
			"Select test configuration to run": "Seleccionar la configuración de prueba para ejecutar",
			"Select the page where you want to open the devtools": "Seleccione la página en la que quiere abrir las herramientas de desarrollo",
			"Select the session you want to inspect:": "Seleccione la sesión que quiere inspeccionar:",
			"Seller Reporting Phase Start": "Inicio de la fase de informes de vendedores",
			"Seller Scoring Phase Start": "Inicio de la fase de puntuación de vendedores",
			"Set innerHTML": "Establecer innerHTML",
			"Skipped by skipFiles": "Omitido por skipFiles",
			"Skipped by smartStep": "Omitido por smartStep",
			"Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Es posible que algunos puntos de interrupción no funcionen en su versión de Node.js. Se recomienda realizar la actualización para las correcciones de errores, de rendimiento y de seguridad más recientes. Detalles: https://aka.ms/AAcsvqm",
			"Source not a source map": "El origen no es un mapa de origen",
			"Source not found": "No se encontró el origen",
			"Stack frame not found": "No se encontró el marco de pila",
			"Starting profile...": "Iniciando el perfil...",
			"Stopping profile...": "Deteniendo perfil...",
			"Suspend AudioContext": "Suspender AudioContext",
			"Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Error de sintaxis al establecer el punto de interrupción con la condición {0} en la línea {1}: {2}",
			"Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "No se encontró la página de destino. Puede que tenga que actualizar el valor de \"urlFilter\" para que coincida con el de la página que quiere depurar.",
			"The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "La versión de Node en \"{0}\" está obsoleta (versión {1}); se requiere Node 8. x como mínimo.",
			"The URL provided is invalid": "La dirección URL proporcionada no es válida.",
			"The browser process exited with code {0} before connecting to the debug server. Make sure the `runtimeExecutable` is configured correctly and that it can run without errors.": "El proceso del explorador se cerró con el código {0} antes de conectarse al servidor de depuración. Asegúrese de que \"runtimeExecutable\" está configurado correctamente y que se puede ejecutar sin errores.",
			"The configured `cwd` {0} does not exist.": "El “cwd” {0} configurado no existe.",
			"The configured `cwd` {0} is not a folder.": "El {0} configurado \"cwd\" no es una carpeta.",
			"This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Esta es una ruta de acceso de archivo ausente a la que hace referencia una mapa de origen. ¿Quiere depurar la versión compilada en su lugar?",
			"Thread is not paused": "El subproceso no está en pausa",
			"Thread is not paused on exception": "El subproceso no está en pausa por la excepción",
			"Thread not found": "No se encontró el subproceso",
			"Type of profile": "Tipo de perfil",
			"URL contains \"{0}\"": "La dirección URL contiene \"{0}\"",
			"UWP webview debugging is not available on your platform.": "La depuración de la vista web UWP no está disponible en su plataforma.",
			"Unable to attach to browser": "No se puede asociar al explorador",
			"Unable to evaluate": "No se puede evaluar",
			"Unable to evaluate on async stack frame": "No se puede evaluar en un marco de pila asincrónica",
			"Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "No se encuentra ninguna instalación del explorador en el sistema. Prueba a instalarlo o proporciona una ruta de acceso completa al explorador en \"runtimeExecutable\", en el archivo launch.json.",
			"Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "No se encuentra {0} versión {1}. Las versiones detectadas automáticamente disponibles son: {2}. Puede establecer \"runtimeExecutable\" en launch.json en una de ellas o proporcionar una ruta de acceso absoluta al ejecutable del explorador.",
			"Unable to launch browser: \"{0}\"": "No se puede iniciar el explorador: \"{0}\"",
			"Unable to pause": "No se puede pausar",
			"Unable to pretty print": "No se pueden imprimir con sangría",
			"Unable to resume": "No se puede reanudar",
			"Unable to retrieve source content": "No se puede recuperar el contenido de origen",
			"Unable to set variable value": "No se puede establecer el valor de la variable",
			"Unable to step in": "No se puede entrar",
			"Unable to step next": "No se puede realizar el paso siguiente",
			"Unable to step out": "No se puede salir",
			"Unbound breakpoint": "Punto de interrupción sin enlazar",
			"Uncaught Exceptions": "Excepciones no detectadas",
			"Unknown error": "Error desconocido",
			"VS Code can provide better debugging experience for WebAssembly via \"DWARF Debugging\" extension. Would you like to install it?/\"DWARF Debugging\" is the extension name and should not be localized.": "VS Code puede proporcionar una mejor experiencia de depuración para WebAssembly a través de la extensión \"Depuración de DWARF\". ¿Le gustaría instalarlo?",
			"Variable not found": "No se encontró la variable",
			"Variables not available in async stacks": "Variables no disponibles en las pilas asincrónicas",
			"WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "ADVERTENCIA: El procesamiento de mapas de origen de {0} tardó más de {1} ms, por lo que se siguió ejecutando sin esperar a que se establecieran todos los puntos de interrupción del script.",
			"We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "No se puede iniciar ningún explorador en modo de depuración desde aquí. Si quiere depurar esta página web, abra el área de trabajo desde VS Code en el escritorio.",
			"We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "No se puede iniciar ningún explorador en modo de depuración desde aquí. Abra el área de trabajo en VS Code en el escritorio para habilitar la depuración.",
			"WebGL Error Fired": "Error de WebGL desencadenado",
			"WebGL Warning Fired": "Advertencia de WebGL desencadenada",
			"With Block": "Con bloque",
			"Would you like to save a configuration in your launch.json for easy access later?": "¿Desea guardar una configuración en el archivo launch.json para un acceso fácil más adelante?",
			"XHR/Fetch URLs": "URL XHR/captura",
			"Yes": "Sí",
			"You may install the `{}` module via npm for enhanced WebAssembly debugging": "Puede instalar el módulo '{}' a través de npm para la depuración mejorada de WebAssembly",
			"You need to open a workspace folder to debug npm scripts.": "Debe abrir una carpeta de área de trabajo para depurar scripts npm.",
			"You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Está ejecutando una versión obsoleta de Node.js. Se recomienda actualizarla para acceder a las correcciones de errores, rendimiento y seguridad más recientes.",
			"an old debug session": "una sesión de depuración antigua",
			"breakpoint.provisionalBreakpoint": "breakpoint.provisionalBreakpoint",
			"path does not exist": "la ruta de acceso no existe",
			"process id: {0} ({1})": "Id. del proceso: {0} ({1})",
			"process id: {0}, debug port: {1} ({2})": "Id. del proceso: {0}, puerto de depuración: {1} ({2})",
			"setInterval fired": "setInterval activado",
			"setTimeout fired": "setTimeout activado",
			"the configured userDataDir": "el valor userDataDir configurado",
			"{0} (couldn't describe: {1})": "{0} (no se puede describir: {1})",
			"{0} Click to Stop Profiling": "{0} Hacer clic aquí para detener la generación de perfiles",
			"{0} Click to Stop Profiling ({1} sessions)": "{0} Hacer clic para detener la generación de perfiles (sesiones{1} )",
			"{0} Click to Stop Profiling ({1})": "{0} Hacer clic aquí para detener la generación de perfiles ({1})."
		}
	}
}