{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.eventListener.breakpoint": "Activer/désactiver les points d’arrêt de l’écouteur d’événements",
			"add.xhr.breakpoint": "Ajouter un point d’arrêt XHR/récupération (fetch)",
			"attach.node.process": "Attacher au processus Node",
			"base.cascadeTerminateToConfigurations.label": "Liste de sessions de débogage qui, à la fin de cette session de débogage, sont également arrêtées.",
			"base.enableDWARF.label": "Indique si le débogueur essaiera de lire les symboles de débogage DE LA MACHINE À PARTIR de WebAssembly, ce qui peut entraîner une utilisation intensive des ressources. Nécessite l’extension ’ms-vscode.wasm-dwarf-debugging’ pour fonctionner.",
			"breakpoint.xhr.any": "N’importe quel XHR/récupération (fetch)",
			"breakpoint.xhr.contains": "Arrêter lorsque l’URL contient :",
			"browser.address.description": "Adresse IP ou nom d'hôte écouté par le navigateur débogué.",
			"browser.attach.port.description": "Port à utiliser pour le débogage à distance du navigateur, indiqué sous la forme '--remote-debugging-port' au lancement du navigateur.",
			"browser.baseUrl.description": "URL de base pour résoudre baseUrl pour les chemins. baseURL est tronqué en cas de mappage des URL aux fichiers sur le disque. La valeur par défaut est le domaine de l'URL de lancement.",
			"browser.browserAttachLocation.description": "Force l'attachement du navigateur à un seul emplacement. Dans un espace de travail distant (via ssh ou WSL, par exemple), cela permet d'effectuer l'attachement à un navigateur sur la machine distante, et non localement.",
			"browser.browserLaunchLocation.description": "Force le lancement du navigateur à un emplacement spécifique. Dans un espace de travail distant (via ssh ou WSL, par exemple), cela permet d'ouvrir le navigateur sur la machine distante, et non localement.",
			"browser.cleanUp.description": "Nettoyage à effectuer après la fin de la session de débogage. Fermeture uniquement de l'onglet en cours de débogage ou fermeture de l'ensemble du navigateur.",
			"browser.cwd.description": "Répertoire de travail facultatif pour l'exécutable du runtime.",
			"browser.disableNetworkCache.description": "Contrôle si le cache réseau de chaque requête doit être ignoré",
			"browser.env.description": "Dictionnaire facultatif des paires clés/valeur de l'environnement pour le navigateur.",
			"browser.file.description": "Fichier html local à ouvrir dans le navigateur",
			"browser.includeDefaultArgs.description": "Indique si les arguments de lancement de navigateur par défaut (pour désactiver les fonctionnalités qui peuvent compliquer le débogage) sont inclus dans le lancement.",
			"browser.includeLaunchArgs.description": "Avancé : indique si des arguments de lancement/débogage par défaut sont définis sur le navigateur. Le débogueur suppose que le navigateur utilise le débogage de canal comme celui fourni avec '--remote-debugging-pipe'.",
			"browser.inspectUri.description": "Format à utiliser pour réécrire inspectUri : il s’agit d’une chaîne de modèle qui interpole les clés dans `{curlyBraces}`. Clés disponibles :\r\n - `url.*` est l’adresse analysée de l’application en cours d’exécution. Par exemple `{url.port}`, `{url.hostname}`\r\n - `port` est le port de débogage que Chrome écoute.\r\n - `browserInspectUri` est l’URI d’inspecteur sur le navigateur démarré\r\n - `browserInspectUriPath` est le segment du chemin d’accès correspondant à l’URI d’inspecteur sur le navigateur démarré. Par exemple : \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\".\r\n - `wsProtocol` est le protocole WebSocket conseillé. Sa valeur est `wss` si l’URL d’origine est `https`, sinon `ws`.\r\n",
			"browser.launch.port.description": "Port d'écoute du navigateur. La valeur par défaut est \"0\", ce qui entraîne le débogage du navigateur via des canaux. Cette méthode, généralement plus sécurisée, est recommandée, sauf si vous devez effectuer un attachement au navigateur à partir d'un autre outil.",
			"browser.pathMapping.description": "Mappage des URL/chemins de dossiers locaux pour résoudre les scripts dans le navigateur en scripts sur le disque",
			"browser.perScriptSourcemaps.description": "Indique si les scripts sont chargés individuellement avec des mappages de source uniques contenant le nom de base du fichier source. Ce paramètre peut être défini pour optimiser la gestion des mappages de source en présence d'un grand nombre de petits scripts. Si la valeur est \"auto\", nous détectons les cas connus le cas échéant.",
			"browser.profileStartup.description": "Si la valeur est true, le profilage commence dès le lancement du processus",
			"browser.restart": "Détermine s'il est nécessaire de se reconnecter en cas de fermeture de la connexion du navigateur",
			"browser.revealPage": "Onglet Focus",
			"browser.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
			"browser.runtimeExecutable.description": "'canary', 'stable', 'custom' ou chemin de l'exécutable du navigateur. 'Custom' désigne un wrapper personnalisé, une génération personnalisée ou une variable d'environnement CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "Indiquez 'canary', 'stable', ''dev'', 'custom' ou le chemin de l'exécutable du navigateur. Custom signifie wrapper personnalisé, build personnalisée ou variable d'environnement EDGE_PATH.",
			"browser.server.description": "Configure un serveur web pour le démarrage. Prend la même configuration que la tâche de lancement 'node'.",
			"browser.skipFiles.description": "Tableau de noms de fichiers ou de dossiers, ou globs de chemin d’accès, à ignorer lors du débogage. Les modèles et les négations en étoile sont autorisés, par exemple `[\"**/node_modules/**\", \"!**/node_modules/my-module/**\"]`",
			"browser.smartStep.description": "Exécutez un pas à pas automatique parmi les lignes non mappées des fichiers de mappage de source. Il peut s'agir, par exemple, du code produit automatiquement par TypeScript durant la compilation d'async/await ou d'autres fonctionnalités.",
			"browser.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir des indications du mappage de source vers les emplacements appropriés sur le disque. Pour plus d'informations, consultez le README.",
			"browser.sourceMapRenames.description": "Indique si vous devez utiliser le mappage « names » dans les mappages sources. Cela nécessite une demande de contenu source, ce qui peut s’avérer lent avec certains débogueurs.",
			"browser.sourceMaps.description": "Utilisez des mappages de sources JavaScript (le cas échéant).",
			"browser.targetSelection": "Spécifie s'il est nécessaire d'effectuer un attachement à toutes les cibles qui correspondent au filtre URL (\"automatique\"), ou s'il est nécessaire d'effectuer un choix (\"sélection\").",
			"browser.timeout.description": "Réessayez pendant ce nombre de millisecondes d'établir la connexion au navigateur. La valeur par défaut est 10000 ms.",
			"browser.url.description": "Recherche un onglet avec cette URL exactement et s'y attache le cas échéant",
			"browser.urlFilter.description": "Cherche une page avec cette URL et l'attache, le cas échéant. Les caractères génériques * sont autorisés.",
			"browser.userDataDir.description": "Par défaut, le navigateur est lancé avec un profil d'utilisateur distinct dans un dossier temporaire. Utilisez cette option pour remplacer le profil. Définissez la valeur false pour le lancer avec votre profil d'utilisateur par défaut. Impossible de lancer un nouveau navigateur si une instance est déjà en cours d’exécution à partir de « userDataDir ».",
			"browser.vueComponentPaths": "Liste de modèles Glob de fichier pour la recherche des composants '*.vue'. Par défaut, la recherche est effectuée dans l'ensemble de l'espace de travail. Vous devez l'indiquer en raison des recherches supplémentaires nécessaires aux mappages de sources de Vue dans Vue CLI 4. Vous pouvez désactiver cette gestion particulière en affectant un tableau vide à cette valeur.",
			"browser.webRoot.description": "Ceci spécifie le chemin absolu de l'espace de travail à la racine du serveur web. Permet de résoudre les chemins tels que '/app.js' en fichiers sur disque. Raccourci d'un pathMapping pour \"/\"",
			"chrome.attach.description": "Attacher à une instance de Chrome déjà en mode débogage",
			"chrome.attach.label": "Chrome : attacher",
			"chrome.label": "Application web (Chrome)",
			"chrome.launch.description": "Lancer Chrome pour déboguer une URL",
			"chrome.launch.label": "Chrome : lancer",
			"commands.callersAdd.label": "Exclure l’appelant",
			"commands.callersAdd.paletteLabel": "Exclure l’appelant de la mise en pause à l’emplacement actuel",
			"commands.callersGoToCaller.label": "Accéder à l’emplacement de l’appelant",
			"commands.callersGoToTarget.label": "Accéder à l’emplacement cible",
			"commands.callersRemove.label": "Supprimer l’appelant exclu",
			"commands.callersRemoveAll.label": "Supprimer tous les appelants exclus",
			"commands.disableSourceMapStepping.label": "Désactiver l’exécution pas à pas mappé source",
			"commands.enableSourceMapStepping.label": "Activer l’exécution pas à pas mappé source",
			"commands.networkClear.label": "Effacer le journal réseau",
			"commands.networkCopyURI.label": "Copier l’URL de requête",
			"commands.networkOpenBody.label": "Ouvrir le corps de réponse",
			"commands.networkOpenBodyInHexEditor.label": "Ouvrir le corps de réponse dans l’Éditeur hexadécimal",
			"commands.networkReplayXHR.label": "Relire la requête",
			"commands.networkViewRequest.label": "Afficher la requête en tant que cURL",
			"configuration.autoAttachMode": "Configure les processus à attacher et déboguer automatiquement quand '#debug.node.autoAttach#' est activé. Un processus Node lancé avec l'indicateur '--inspect' est toujours attaché, quel que soit ce paramètre.",
			"configuration.autoAttachMode.always": "Effectue l'attachement automatique à chaque processus Node.js lancé dans le terminal.",
			"configuration.autoAttachMode.disabled": "L'attachement automatique est désactivé et n'est pas affiché dans la barre d’état.",
			"configuration.autoAttachMode.explicit": "Effectue l'attachement automatique uniquement quand '--inspect' est indiqué.",
			"configuration.autoAttachMode.smart": "Effectue l'attachement automatique durant l'exécution de scripts qui ne se trouvent pas dans un dossier node_modules.",
			"configuration.autoAttachSmartPatterns": "Configure des modèles Glob qui permettent de déterminer quand effectuer l'attachement en mode '#debug.javascript.autoAttachFilter#' \"intelligent\". '$KNOWN_TOOLS$' est remplacé par une liste de noms d'exécuteurs de tests et de codes courants. [Pour plus d'informations, lisez la documentation de VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.automaticallyTunnelRemoteServer": "Quand vous déboguez une application web à distance, configure s'il faut automatiquement \"tunneler\" le serveur distant vers votre machine locale.",
			"configuration.breakOnConditionalError": "Indique s’il faut arrêter lorsque les points d’arrêt conditionnels génèrent une erreur.",
			"configuration.debugByLinkOptions": "Options utilisées pendant le débogage de liens ouverts sur lesquels l'utilisateur a cliqué à partir du terminal de débogage. Peut être défini sur \"false\" pour désactiver ce comportement.",
			"configuration.defaultRuntimeExecutables": "Il s'agit du 'runtimeExecutable' par défaut utilisé pour les configurations de lancement, en l'absence d'indications. Vous pouvez l'utiliser pour configurer des chemins personnalisés vers Node.js ou des installations de navigateur.",
			"configuration.enableNetworkView": "Active la vue de réseau expérimentale pour les cibles qui la prennent en charge.",
			"configuration.npmScriptLensLocation": "Indique où CodeLens doit être affiché pour \"Exécuter\" et \"Déboguer\" dans vos scripts npm. Les options sont : \"tous\" les scripts, \"en haut\" de la section de script ou \"jamais\".",
			"configuration.pickAndAttachOptions": "Options par défaut utilisées pour le débogage d'un processus via la commande Déboguer : attacher au processus Node.js",
			"configuration.resourceRequestOptions": "Options de requête à utiliser durant le chargement des ressources, telles que les mappages de sources, dans le débogueur. Vous devrez peut-être configurer ce paramètre si vos mappages de sources nécessitent une authentification ou s’ils utilisent un certificat autosigné. Les options sont utilisées pour créer une requête à l’aide de la bibliothèque [`got`](https://github.com/sindresorhus/got).\r\n\r\nUn moyen courant de désactiver la vérification de certificat est de passer `{ \"https\": { \"rejectUnauthorized\": false } }`.",
			"configuration.terminalOptions": "Options de lancement par défaut pour le terminal de débogage JavaScript et les scripts npm.",
			"configuration.unmapMissingSources": "Configure le démappage automatique ou non du fichier faisant l'objet d'un mappage de source quand le fichier d'origine ne peut pas être lu. Si la valeur est false (par défaut), une invite s'affiche.",
			"createDiagnostics.label": "Diagnostiquer les problèmes aux points d’arrêt",
			"customDescriptionGenerator.description": "Personnalisez la description textuelle que le débogueur affiche pour les objets (variables locales, etc.). Exemples :\r\n      1. this.toString() // Appelle toString pour afficher tous les objets\r\n      2. this.customDescription ? this.customDescription() : defaultValue // Utilise la méthode customDescription si elle est disponible. Sinon, renvoie defaultValue\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Utilise la méthode customDescription si elle est disponible. Sinon, renvoie defaultValue\r\n      ",
			"customPropertiesGenerator.description": "Personnaliser les propriétés affichées pour un objet dans le débogueur (variables locales, etc.). Exemples :\r\n    1. { ...this, extraProperty: '12345' } // Ajoute une propriété extraProperty avec la valeur 12345 à tous les objets\r\n    2. this.customProperties ? this.customProperties() : this // Utilise la méthode customProperties si elle est disponible. Sinon, utilise les propriétés de this (propriétés par défaut)\r\n    3. function () { return this.customProperties ? this.customProperties() : this } // Utilise la méthode customDescription si elle est disponible. Sinon, renvoie les propriétés par défaut\r\n\r\n    Déprécié : Il s’agit d’une implémentation temporaire de cette fonctionnalité disponible jusqu’à son implémentation prochaine ainsi qu’elle est décrite ici : https://github.com/microsoft/vscode/issues/102181",
			"debug.npm.edit": "Modifier package.json",
			"debug.npm.noScripts": "Aucun script npm dans votre package.json",
			"debug.npm.noWorkspaceFolder": "Vous devez ouvrir un dossier d'espace de travail pour déboguer les scripts npm.",
			"debug.npm.parseError": "Impossible de lire {0} : {1}",
			"debug.npm.script": "Déboguer le script npm",
			"debug.terminal.attach": "Attacher au processus de terminal Node.js",
			"debug.terminal.label": "Terminal de débogage de JavaScript",
			"debug.terminal.program.description": "Commande à exécuter dans le terminal lancé. Si non fournie, le terminal s'ouvre sans lancer de programme.",
			"debug.terminal.snippet.label": "Exécuter \"npm start\" dans un terminal de débogage",
			"debug.terminal.toggleAuto": "Activer/désactiver l'attachement automatique au terminal Node.js",
			"debug.terminal.welcome": "[Terminal de débogage de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nVous pouvez utiliser le terminal de débogage de JavaScript pour déboguer les processus Node.js exécutés en ligne de commande.",
			"debug.terminal.welcomeWithLink": "[Terminal de débogage de JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nVous pouvez utiliser le terminal de débogage de JavaScript pour déboguer les processus Node.js exécutés en ligne de commande.\r\n\r\n[URL de débogage](command:extension.js-debug.debugLink)",
			"debug.unverifiedBreakpoints": "Certains de vos points d’arrêt n’ont pas pu être définis. Si vous rencontrez un problème, vous pouvez [résoudre votre configuration de lancement](command:extension.js-debug.createDiagnostics).",
			"debugLink.label": "Ouvrir le lien",
			"edge.address.description": "Au moment du débogage des vues web, adresse IP ou nom d'hôte écouté par la vue web. La découverte s'effectue automatiquement, si aucune valeur n'est définie.",
			"edge.attach.description": "Attacher à une instance de Microsoft Edge déjà en mode débogage",
			"edge.attach.label": "Edge : attacher",
			"edge.label": "Application web (Edge)",
			"edge.launch.description": "Lancer Microsoft Edge pour déboguer une URL",
			"edge.launch.label": "Edge : lancer",
			"edge.port.description": "Au moment du débogage des vues web, port écouté par le débogueur de vue web. La découverte s'effectue automatiquement, si aucune valeur n'est définie.",
			"edge.useWebView.attach.description": "Objet contenant le 'pipeName' d’un canal de débogage pour un Webview2 hébergé par UWP. Il s’agit de « MyTestSharedMemory » lors de la création du canal « \\\\.\\pipe\\LOCAL\\MyTestSharedMemory »",
			"edge.useWebView.launch.description": "Quand la valeur est 'true', le débogueur traite l'exécutable de runtime comme une application hôte qui contient une vue web vous permettant de déboguer le contenu du script de vue web.",
			"edit.xhr.breakpoint": "Modifier le point d’arrêt XHR/récupération (fetch)",
			"enableContentValidation.description": "Définit si nous devons vérifier que les contenus des fichiers sur le disque correspondent à ceux chargés dans le runtime. Cette opération est utile dans de nombreux scénarios, voire obligatoire dans certains. Des problèmes peuvent toutefois se produire, notamment si vous avez une transformation côté serveur de scripts.",
			"errors.timeout": "{0} : expiration du délai d'attente au bout de {1} ms",
			"extension.description": "Extension pour déboguer les programmes Node.js et Chrome.",
			"extensionHost.label": "Développement d'extension VS Code",
			"extensionHost.launch.config.name": "Lancer l'extension",
			"extensionHost.launch.debugWebWorkerHost": "Indique si nous devons effectuer une tentative d'attachement à l'hôte d'extension worker web.",
			"extensionHost.launch.debugWebviews": "Configure si nous devons essayer de nous attacher aux vues Web dans l'instance de VS Code lancée. Cela ne fonctionnera que dans le bureau VS Code.",
			"extensionHost.launch.env.description": "Variables d'environnement passées à l'hôte d'extension.",
			"extensionHost.launch.rendererDebugOptions": "Options de lancement de Chrome utilisées lors de l'attachement au processus renderer, avec 'debugWebviews' ou 'debugWebWorkerHost'.",
			"extensionHost.launch.runtimeExecutable.description": "Chemin absolu de VS Code.",
			"extensionHost.launch.stopOnEntry.description": "Arrêtez automatiquement l'hôte d'extension après le lancement.",
			"extensionHost.launch.testConfiguration": "Chemin d’accès à un fichier de configuration de test pour [test CLI](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).",
			"extensionHost.launch.testConfigurationLabel": "Configuration unique à exécuter à partir du fichier. Sans spécification, vous pouvez être invité à choisir.",
			"extensionHost.snippet.launch.description": "Lancer une extension VS Code en mode débogage",
			"extensionHost.snippet.launch.label": "Développement d'extension VS Code",
			"getDiagnosticLogs.label": "Enregistrer les journaux de débogage JS de diagnostic",
			"longPredictionWarning.disable": "Ne plus afficher",
			"longPredictionWarning.message": "La configuration de vos points d'arrêt prend un certain temps. Pour accélérer l'opération, mettez à jour 'outFiles' dans launch.json.",
			"longPredictionWarning.noFolder": "Aucun dossier d'espace de travail ouvert.",
			"longPredictionWarning.open": "Ouvrir launch.json",
			"node.address.description": "Adresse TCP/IP du processus à déboguer. La valeur par défaut est 'localhost'.",
			"node.attach.attachExistingChildren.description": "Indique s'il faut essayer d'attacher des processus enfants déjà engendrés.",
			"node.attach.attachSpawnedProcesses.description": "Indique s'il faut définir des variables d'environnement dans le processus attaché pour suivre les enfants engendrés.",
			"node.attach.config.name": "Attacher",
			"node.attach.continueOnAttach": "Si la valeur est true, nous reprenons automatiquement les programmes lancés en attente avec '--inspect-brk'",
			"node.attach.processId.description": "ID du processus à attacher.",
			"node.attach.restart.description": "Tentative de reconnexion au programme, si nous perdons la connexion. Si la valeur est true, nous effectuons une tentative une fois par seconde, indéfiniment. Vous pouvez personnaliser l'intervalle et le nombre maximal de tentatives en spécifiant à la place 'delay' et 'maxAttempts' dans un objet.",
			"node.attachSimplePort.description": "Si l'option correspondante est définie, l'attachement au processus s'effectue par le biais du port indiqué. En règle générale, cela n'est plus nécessaire pour les programmes Node.js. Le débogage des processus enfants n'est alors plus possible, mais ce choix peut être utile dans des scénarios plus rares, tels que les lancements de Deno et Docker. Si l'option est définie avec la valeur 0, un port aléatoire est choisi et --inspect-brk est automatiquement ajouté aux arguments de lancement.",
			"node.console.title": "Console de débogage de nœud",
			"node.disableOptimisticBPs.description": "Ne définissez pas de points d'arrêt dans un fichier tant qu'un mappage de source n'a pas été chargé pour ce fichier.",
			"node.enableTurboSourcemaps.description": "Configure s’il faut utiliser un nouveau mécanisme plus rapide pour la découverte de mappage de source",
			"node.experimentalNetworking.description": "Activez l’inspection expérimentale dans Node.js. Quand la valeur est `auto` est activée pour les versions de Node.js qui la prennent en charge. Elle peut être définie sur « activé » ou « désactivé » pour l’activer ou la désactiver explicitement.",
			"node.killBehavior.description": "Configure la façon dont le processus de débogage est tué à l’arrêt de la session. Valeurs possibles : \r\n\r\n- forceful (par défaut) : détruit de force l’arborescence des processus. Envoie SIGKILL sur POSIX, ou `taskkill.exe /F` sur Windows.\r\n- polite : détruit élégamment l’arborescence des processus. Il est possible que des processus au comportement anormal continuent de s’exécuter après ce type d’arrêt. Envoie SIGTERM sur POSIX ou `taskkill.exe` sans l’indicateur `/F` (force) sur Windows.\r\n- none : aucun arrêt n’est effectué.",
			"node.label": "Node.js",
			"node.launch.args.description": "Arguments de ligne de commande passés au programme.\r\n\r\nPeut être un tableau de chaînes ou une chaîne unique. Lorsque le programme est lancé dans un terminal, la définition de cette propriété sur une seule chaîne empêche l’échappement des arguments pour l’interpréteur de commandes.",
			"node.launch.autoAttachChildProcesses.description": "Attacher le débogueur aux nouveaux processus enfants automatiquement.",
			"node.launch.config.name": "Lancer",
			"node.launch.console.description": "Où lancer la cible de débogage.",
			"node.launch.console.externalTerminal.description": "Terminal externe pouvant être configuré via des paramètres utilisateur",
			"node.launch.console.integratedTerminal.description": "terminal intégré de VS Code",
			"node.launch.console.internalConsole.description": "console de débogage de VS Code (qui ne prend pas en charge la lecture de l'entrée d'un programme)",
			"node.launch.cwd.description": "Chemin absolu du répertoire de travail du programme débogué. Si vous avez défini localRoot, cwd établit une correspondance avec cette valeur. Sinon, il utilise par défaut votre workspaceFolder",
			"node.launch.env.description": "Variables d'environnement passées au programme. La valeur 'null' supprime la variable de l'environnement.",
			"node.launch.envFile.description": "Chemin absolu d'un fichier contenant des définitions de variables d'environnement.",
			"node.launch.logging": "Configuration de la journalisation",
			"node.launch.logging.cdp": "Chemin du fichier journal pour les messages du protocole Chrome DevTools",
			"node.launch.logging.dap": "Chemin du fichier journal pour les messages du protocole de l'adaptateur de débogage",
			"node.launch.outputCapture.description": "Emplacement de capture des messages de sortie : API de débogage si la valeur est 'console' ou flux stdout/stderr si la valeur est 'std'.",
			"node.launch.program.description": "Chemin absolu du programme. La valeur générée est déterminée en fonction du fichier package.json et des fichiers ouverts. Modifiez cet attribut.",
			"node.launch.restart.description": "Essayez de redémarrer le programme s'il quitte avec un code de sortie non nul.",
			"node.launch.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
			"node.launch.runtimeExecutable.description": "Runtime à utiliser. Chemin absolu ou nom d'un runtime disponible dans PATH. En cas d'omission, 'node' est choisi par défaut.",
			"node.launch.runtimeSourcemapPausePatterns": "Liste de modèles au niveau desquels insérer manuellement des points d'arrêt de point d'entrée. Cela permet au débogueur de définir des points d'arrêt durant l'utilisation de mappages de sources qui n'existent pas ou qui ne peuvent pas être détectés avant le lancement, par exemple [avec Serverless Framework](https://github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Version de 'node' que le runtime utilise. Requiert 'nvm'.",
			"node.launch.useWSL.deprecation": "'useWSL' est déprécié et sa prise en charge va être supprimée. Utilisez l'extension 'Remote - WSL' à la place.",
			"node.launch.useWSL.description": "Utilisez le sous-système Windows pour Linux.",
			"node.localRoot.description": "Chemin du répertoire local contenant le programme.",
			"node.pauseForSourceMap.description": "Indique s'il faut attendre le chargement des mappages de sources pour chaque script entrant. Ce paramètre réduit les performances, et peut être désactivé de manière sécurisée en cas d'espace disque insuffisant et si 'rootPath' n'est pas désactivé.",
			"node.port.description": "Port de débogage auquel effectuer l'attachement. La valeur par défaut est 9 229.",
			"node.processattach.config.name": "Attacher au processus",
			"node.profileStartup.description": "Si la valeur est « true », le profilage commence dès le lancement du processus",
			"node.remote.host.header.description": "En-tête de l’hôte explicite à utiliser lors de la connexion au WebSocket de l’inspecteur. Si aucune valeur n’est spécifiée, l’en-tête de l’hôte est défini sur « localhost ». Cela est utile lorsque l’inspecteur s’exécute derrière un proxy qui accepte uniquement un en-tête de l’hôte particulier.",
			"node.remoteRoot.description": "Chemin absolu du répertoire distant contenant le programme.",
			"node.resolveSourceMapLocations.description": "Liste de modèles de minimatch pour les emplacements (dossiers et URL) dans lesquels les mappages de sources peuvent être utilisés pour résoudre les fichiers locaux. Peuvent être utilisés pour éviter un arrêt incorrect dans le code externe mappé à la source. Les modèles peuvent être préfixés avec \"!\" pour les exclure. Peuvent être définis sur un tableau vide ou la valeur null pour éviter toute restriction.",
			"node.showAsyncStacks.description": "Affiche les appels asynchrones ayant conduit à la pile des appels actuelle.",
			"node.snippet.attach.description": "Attacher à un programme node en cours d'exécution",
			"node.snippet.attach.label": "Node.js : attacher",
			"node.snippet.attachProcess.description": "Ouvrir le sélecteur de processus pour sélectionner le processus node auquel s'attacher",
			"node.snippet.attachProcess.label": "Node.js : attacher au processus",
			"node.snippet.electron.description": "Déboguer le processus principal Electron",
			"node.snippet.electron.label": "Node.js : processus principal Electron",
			"node.snippet.gulp.description": "Déboguer une tâche gulp (un gulp local doit être installé dans votre projet)",
			"node.snippet.gulp.label": "Node.js : tâche Gulp",
			"node.snippet.launch.description": "Lancer un programme node en mode débogage",
			"node.snippet.launch.label": "Node.js : lancer un programme",
			"node.snippet.mocha.description": "Déboguer les tests mocha",
			"node.snippet.mocha.label": "Node.js : tests mocha",
			"node.snippet.nodemon.description": "Utiliser nodemon pour relancer une session de débogage quand la source change",
			"node.snippet.nodemon.label": "Node.js : configurer nodemon",
			"node.snippet.npm.description": "Lancer un programme node avec un script npm 'debug'",
			"node.snippet.npm.label": "Node.js : lancer via npm",
			"node.snippet.remoteattach.description": "Attacher au port de débogage d'un programme node distant",
			"node.snippet.remoteattach.label": "Node.js : attacher au programme distant",
			"node.snippet.yo.description": "Déboguer le générateur yeoman (installer en exécutant 'npm link' dans le dossier de projet)",
			"node.snippet.yo.label": "Node.js : générateur Yeoman",
			"node.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir de ce que le mappage de source stipule, vers les emplacements sur le disque.",
			"node.sourceMaps.description": "Utilisez des mappages de sources JavaScript (le cas échéant).",
			"node.stopOnEntry.description": "Arrêtez automatiquement le programme après le lancement.",
			"node.timeout.description": "Réessayez de vous connecter à Node.js pendant le nombre de millisecondes spécifié. La valeur par défaut est 10 000 ms.",
			"node.versionHint.description": "Vous permet de spécifier explicitement la version de Node en cours d’exécution. Ceci peut être utile pour désactiver ou activer certains comportements dans les cas où la détection automatique de version ne fonctionne pas.",
			"node.websocket.address.description": "Adresse WebSocket exacte à laquelle effectuer l'attachement. Si elle n'est pas spécifiée, elle est découverte à partir de l'adresse et du port.",
			"openEdgeDevTools.label": "Ouvrir les outils du développeur du navigateur",
			"outFiles.description": "Si les mappages de sources sont activés, ces modèles Glob spécifient les fichiers JavaScript générés. Si un modèle commence par '!', les fichiers sont exclus. En l'absence de spécification, le code généré est censé se trouver dans le même répertoire que sa source.",
			"pretty.print.script": "Impression automatique pour le débogage",
			"profile.start": "Exécuter le profil du niveau de performance",
			"profile.stop": "Arrêter le profil du niveau de performance",
			"remove.eventListener.breakpoint.all": "Supprimer tous les points d’arrêt de l’écouteur d’événements",
			"remove.xhr.breakpoint": "Supprimer le point d’arrêt XHR/récupération (fetch)",
			"remove.xhr.breakpoint.all": "Supprimer tous les points d’arrêt XHR/récupération (fetch)",
			"requestCDPProxy.label": "Demander un proxy CDP pour une session de débogage",
			"skipFiles.description": "Tableau de modèles glob pour les fichiers à ignorer pendant le débogage. Le modèle '<node_internals>/**' correspond à tous les modules Node.js internes.",
			"smartStep.description": "Exécutez pas à pas de façon automatique le code généré qui ne peut être mappé à la source d'origine.",
			"start.with.stop.on.entry": "Démarrez le débogage et s'arrêter à l’entrée",
			"startWithStopOnEntry.label": "Démarrez le débogage et s'arrêter à l’entrée",
			"timeouts.generalDescription": "Délais d’expiration pour plusieurs opérations de débogueur.",
			"timeouts.generalDescription.markdown": "Délais d’expiration pour plusieurs opérations de débogueur.",
			"timeouts.hoverEvaluation.description": "Délai avant abandon de l’évaluation de la valeur pour les symboles survolés. Si la valeur est 0, l’évaluation par pointage n’expire jamais.",
			"timeouts.sourceMaps.description": "Délais d’expiration liés aux opérations de mappages de sources.",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Délai supplémentaire en millisecondes autorisé par session à attendre le traitement des mappages de sources, une fois le délai minimal (sourceMapMinPause) écoulé",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Délai minimal en millisecondes passé à attendre que chaque mappage de source soit traité quand un script est analysé",
			"toggle.skipping.this.file": "Ignorer/Ne pas ignorer ce fichier",
			"trace.boolean.description": "Vous pouvez définir la trace sur 'true' pour écrire des journaux de diagnostic sur le disque.",
			"trace.description": "Configure la sortie de diagnostic à produire.",
			"trace.logFile.description": "Configure l'emplacement sur le disque où sont écrits les journaux.",
			"trace.stdio.description": "Indique s'il faut retourner les données de trace de l'application ou du navigateur qui a été lancé.",
			"workspaceTrust.description": "L’approbation est requise pour déboguer le code dans cet espace de travail."
		},
		"bundle": {
			"A profiling session is already running, would you like to stop it and start a new session?": "Une session de profilage est déjà en cours d'exécution. Voulez-vous l'arrêter et démarrer une nouvelle session ?",
			"Add XHR Breakpoint": "Ajouter un point d’arrêt XHR",
			"Add new URL...": "Ajouter une nouvelle URL...",
			"Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Ajustez le ou les modèles glob dans l'attribut 'outFiles' pour qu'ils couvrent le fichier JavaScript généré.",
			"Always": "Toujours",
			"Always in this Workspace": "Toujours dans cet espace de travail",
			"An error occurred taking a profile from the target.": "Une erreur s'est produite au moment du profilage de la cible.",
			"Animation Frame Fired": "Frame d’animation déclenché",
			"Any XHR or fetch": "Tout XHR ou récupération (fetch)",
			"Assertion failed": "Échec d’assertion",
			"Attach to process: '{0}' doesn't look like a process id.": "Attacher au processus : '{0}' ne ressemble pas à un ID de processus.",
			"Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Attacher au processus : impossible d'activer le mode de débogage pour le processus '{0}' ({1}).",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "L'attribut 'runtimeVersion' nécessite Node.js version manager 'nvm-windows' ou 'nvs'.",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvs', 'nvm' or 'fnm' to be installed.": "L'attribut 'runtimeVersion' nécessite l'installation du gestionnaire de version Node.js 'nvs', 'nvm' ou 'fnm'.",
			"Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "L’attribut 'runtimeVersion' avec une saveur/architecture nécessite l’installation de 'nvs'.",
			"Bidder Bidding Phase Start": "Début de la phase d’exécution de l’essai",
			"Bidder Reporting Phase Start": "Début de la phase de création de rapports vendeur",
			"Block": "Bloquer",
			"Break when URL Contains": "Arrêter lorsque l’URL contient",
			"Breaks on all throw errors, even if they're caught later.": "S'arrête sur toutes les erreurs levées, même si elles sont interceptées plus tard.",
			"Breaks only on errors or promise rejections that are not handled.": "S'interrompt uniquement en cas d'erreur ou de rejet de la promesse qui n'est pas géré.",
			"Browser connection failed, will retry: {0}": "Échec de la connexion au navigateur. Nouvelle tentative : {0}",
			"CPU Profile": "Profil du processeur",
			"CPU profile saved as \"{0}\" in your workspace folder": "Profil d’UC enregistré en tant que « {0} » dans le dossier de votre espace de travail",
			"CSP violation \"{0}\"": "Violation de la stratégie CSP « {0} »",
			"Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "Le fichier binaire Node.js \"{0}\" : {1} est introuvable. Vérifiez que Node.js est installé et qu'il se trouve dans PATH, ou définissez \"runtimeExecutable\" dans votre fichier launch.json",
			"Can't load environment variables from file ({0}).": "Impossible de charger les variables d'environnement à partir du fichier ({0}).",
			"Cancel Animation Frame": "Annuler le frame d’animation",
			"Cannot connect to the target at {0}: {1}": "Connexion impossible à la cible sur {0} : {1}",
			"Cannot find `{0}` installed in {1}": "Impossible de trouver « {0} » installé dans {1}",
			"Cannot find a program to debug": "Programme à déboguer introuvable",
			"Cannot find test configuration with label `{0}`, got: {1}": "Configuration de test introuvable avec l’étiquette « {0} », obtenu : {1}",
			"Cannot launch debug target in terminal ({0}).": "Impossible de lancer la cible de débogage dans le terminal ({0}).",
			"Cannot restart asynchronous frame": "Impossible de redémarrer le frame asynchrone",
			"Cannot set an empty value": "Impossible de définir une valeur vide",
			"Catch Block": "Bloc Catch",
			"Caught Exceptions": "Exceptions interceptées",
			"Close AudioContext": "Fermer AudioContext",
			"Closure": "Fermeture",
			"Closure ({0})": "Fermeture ({0})",
			"Console profile started": "Profil de console démarré",
			"Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "Impossible de se connecter à un canal Webview UWP. Vérifiez que votre webview est hébergé en mode débogage et que le « pipeName » indiqué dans votre fichier « launch.json » est correct.",
			"Could not find a location for the variable": "Désolé... Nous n’avons pas pu trouver un emplacement pour la variable",
			"Could not query the provided object": "Impossible d'interroger l'objet fourni",
			"Could not read source map for {0}: {1}": "Impossible de lire le mappage de source pour {0} : {1}",
			"Could not read {0}: {1}": "Impossible de lire {0} : {1}",
			"Create AudioContext": "Créer AudioContext",
			"Create canvas context": "Créer un contexte de canevas",
			"Debug Anyway": "Déboguer quand même",
			"Debug URL": "Déboguer l’URL",
			"Details": "Détails",
			"Don't show again": "Ne plus afficher",
			"Duration": "Durée",
			"Duration of Profile": "Durée du profilage",
			"Edit XHR Breakpoint": "Modifier le point d’arrêt XHR",
			"Edit package.json": "Modifier package.json",
			"Enables Node.js [auto attach]({0}) debugging in \"{1}\" mode/{Locked='[auto attach]({0})'}the 2nd placeholder is the setting value": "Active le débogage Node.js [auto attach]({0}) en mode \"{1}\"",
			"Enter a URL or a pattern to match": "Entrer une URL ou un modèle à mettre en correspondance",
			"Eval": "Eval",
			"Frame could not be restarted": "Le cadre n’a pas pu être redémarré",
			"Generates a .cpuprofile file you can open in VS Code or the Edge/Chrome devtools": "Génère un fichier .cpuprofile que vous pouvez ouvrir dans VS Code ou les outils de développement Edge/Chrome",
			"Generates a .heapprofile file you can open in VS Code or the Edge/Chrome devtools": "Génère un fichier .heapprofile que vous pouvez ouvrir dans VS Code ou les outils de développement Edge/Chrome.",
			"Generates a .heapsnapshot file you can open in VS Code or the Edge/Chrome devtools": "Génère un fichier .heapsnapshot que vous pouvez ouvrir dans VS Code ou les outils de développement Edge/Chrome",
			"Global": "Mondial",
			"Globals": "Globals",
			"Got it!": "OK !",
			"Heap Profile": "Profil de segment de mémoire",
			"Heap Snapshot": "Instantané du tas",
			"How long to run the profile": "Durée d'exécution du profilage",
			"Ignore": "Ignorer",
			"Installation complete! The extension will be used after you restart your debug session.": "Installation terminée ! L’extension sera utilisée après le redémarrage de votre session de débogage.",
			"Installing the DWARF debugger...": "Installation du débogueur DWARF...",
			"Invalid expression": "Expression non valide",
			"Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "Condition d'accès non valide \"{0}\". Expression attendue telle que \"> 42\" ou \"== 2\".",
			"It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Il semble qu'un navigateur s'exécute déjà à partir de {0}. Fermez-le avant toute tentative de débogage. Sinon, VS Code risque de ne pas pouvoir s'y connecter.",
			"It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Il semble que votre session de débogage s’est déjà terminée. Recommencez le débogage, puis exécutez la commande « Debug: Diagnose Breakpoint Problems ».",
			"It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "La configuration de vos points d'arrêt prend un certain temps. Pour accélérer l'opération, mettez à jour 'outFiles' dans launch.json.",
			"JavaScript Debug Terminal": "Terminal de débogage de JavaScript",
			"JavaScript debug adapter": "Adaptateur de débogage JavaScript",
			"Launch Chrome against localhost": "Lancer Chrome en utilisant localhost",
			"Launch Edge against localhost": "Démarrer Microsoft Edge à l’utilisation de localhost",
			"Launch Program": "Lancer le programme",
			"Launch configuration created based on 'package.json'.": "Configuration de lancement créée en fonction de 'package.json'.",
			"Launch configuration for '{0}' project created.": "Configuration de lancement du projet '{0}' créée.",
			"Local": "Local",
			"Locals": "Variables locales",
			"Lost connection to debugee, reconnecting in {0}ms\r\n": "Perte de la connexion à l'élément débogué. Reconnexion dans {0} ms\r\n",
			"Manual": "Manuelle",
			"Module": "Module",
			"Networking not available.": "La mise en réseau n’est pas disponible.",
			"Never": "Jamais",
			"No": "Non",
			"No npm scripts found in the workspace folder.": "Aucun script npm trouvé dans le dossier de l'espace de travail.",
			"No npm scripts found in your package.json": "Aucun script npm dans votre package.json",
			"No package.json files found in your workspace.": "Aucun fichier package.json n’a été trouvé dans votre espace de travail.",
			"No workspace folder open.": "Aucun dossier d'espace de travail ouvert.",
			"Node Attributes": "Attributs de nœud",
			"Node.js version '{0}' not installed using version manager {1}.": "Node.js version '{0}' n'est pas installé à l'aide du gestionnaire de versions {1}.",
			"Not Now": "Pas maintenant",
			"Only objects can be queried": "Seuls les objets peuvent être interrogés",
			"Open launch.json": "Ouvrir launch.json",
			"Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "La sortie a été tronquée pour les {0} premiers caractères. Exécutez '{1}' pour copier la sortie complète.",
			"Parameters": "Paramètres",
			"Paused": "En pause",
			"Paused before Out Of Memory exception": "Interruption d'exécution avant une exception pour mémoire insuffisante",
			"Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "Interruption d'exécution liée à un point d'arrêt d'instrumentation en raison d'une violation de la stratégie de sécurité de contenu. Directive \"{0}\"",
			"Paused on DOM breakpoint": "Interruption d'exécution liée à un point d'arrêt DOM",
			"Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "Interruption d'exécution liée à un point d'arrêt d'instrumentation en raison d'une erreur WebGL. Erreur \"{0}\"",
			"Paused on XMLHttpRequest or fetch": "Interruption d'exécution liée à XMLHttpRequest ou fetch",
			"Paused on assert": "Interruption d’exécution liée à une assertion",
			"Paused on breakpoint": "Interruption d’exécution liée à un point d’arrêt",
			"Paused on debug() call": "Interruption d'exécution liée à un appel de debug()",
			"Paused on debugger statement": "En pause sur une instruction du débogueur",
			"Paused on event listener": "Interruption d'exécution liée à un détecteur d'événements",
			"Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "Interruption d'exécution liée au point d'arrêt de détecteur d'événements \"{0}\". Déclenchement activé sur \"{1}\"",
			"Paused on exception": "Interruption d’exécution liée à une exception",
			"Paused on frame entry": "En pause sur une entrée de frame",
			"Paused on instrumentation breakpoint": "Interruption d'exécution liée à un point d'arrêt d'instrumentation",
			"Paused on instrumentation breakpoint \"{0}\"": "Interruption d'exécution liée au point d'arrêt d'instrumentation \"{0}\"",
			"Paused on {0}": "En pause sur {0}",
			"Pick Breakpoint": "Choisir un point d’arrêt",
			"Pick the node.js process to attach to": "Sélectionner le processus node.js auquel s'attacher",
			"Please enter a number": "Entrez un nombre",
			"Please enter a number greater than 1": "Entrez un nombre supérieur à 1",
			"Please stop the running profile before starting a new one.": "Arrêtez le profilage en cours d'exécution avant d'en démarrer un nouveau.",
			"Process picker failed ({0})": "Le sélecteur de processus a échoué ({0})",
			"Profile duration in seconds, e.g \"5\"": "Durée du profilage en secondes, par exemple \"5\"",
			"Profiling": "Profilage",
			"Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "Effectuer un profilage avec des points d'arrêt activés peut changer le niveau de performance de votre code. Il peut être utile de valider vos constats avec les conditions d'arrêt \"durée\" ou \"manuel\".",
			"Read More": "En savoir plus",
			"Request Animation Frame": "Demander le frame d’animation",
			"Resume AudioContext": "Reprendre AudioContext",
			"Return value": "Valeur retournée",
			"Run Current File": "Exécuter le fichier actif",
			"Run Node.js tool": "Exécutez l'outil Node.js",
			"Run Script: {0}": "Exécuter le script : {0}",
			"Run for a specific amount of time": "Exécuter pendant un délai spécifique",
			"Run until a specific breakpoint is hit": "Exécuter jusqu'à ce qu'un point d'arrêt spécifique soit atteint",
			"Run until manually stopped": "Exécuter jusqu'à l'arrêt manuel",
			"Runs a Node.js command-line installed in the workspace node_modules.": "Exécute une ligne de commande Node.js installée dans l'espace de travail node_modules.",
			"Saving": "Enregistrement",
			"Script": "Script",
			"Script Blocked by Content Security Policy": "Script bloqué par la stratégie de sécurité de contenu",
			"Script First Statement": "Première instruction du script",
			"Select a tab": "Sélectionner un onglet",
			"Select a tool to run": "Sélectionnez un outil à exécuter",
			"Select current working directory for new terminal": "Sélectionner le répertoire de travail actuel pour le nouveau terminal",
			"Select test configuration to run": "Sélectionner la configuration de test à exécuter",
			"Select the page where you want to open the devtools": "Sélectionnez la page dans laquelle vous voulez ouvrir les outils du développeur",
			"Select the session you want to inspect:": "Sélectionnez la session que vous souhaitez inspecter :",
			"Seller Reporting Phase Start": "Début de la phase de création de rapports vendeur",
			"Seller Scoring Phase Start": "Début de la phase de notation du vendeur",
			"Set innerHTML": "Définir innerHTML",
			"Skipped by skipFiles": "Ignoré par skipFiles",
			"Skipped by smartStep": "Ignoré par smartStep",
			"Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Certains points d’arrêt ne fonctionneront sans doute pas dans votre version de Node.js. Nous vous recommandons d’effectuer la mise à niveau pour le bogue, les performances et les correctifs de sécurité les plus récents. Si vous souhaitez en savoir plus, veuillez consulter le site https://aka.ms/AAcsvqm",
			"Source not a source map": "La source n’est pas un mappage de source",
			"Source not found": "Source introuvable",
			"Stack frame not found": "Frame de pile introuvable",
			"Starting profile...": "Démarrage du profil...",
			"Stopping profile...": "Arrêt du profil...",
			"Suspend AudioContext": "Interrompre AudioContext",
			"Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Erreur de syntaxe au moment de la définition du point d'arrêt avec la condition {0} sur la ligne {1} : {2}",
			"Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "Page cible introuvable. Vous devrez peut-être mettre à jour votre \"urlFilter\" pour qu'il corresponde à la page à déboguer.",
			"The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "La version de Node dans \"{0}\" est obsolète (version {1}). Nous avons besoin au moins de Node 8.x.",
			"The URL provided is invalid": "L'URL fournie n'est pas valide",
			"The browser process exited with code {0} before connecting to the debug server. Make sure the `runtimeExecutable` is configured correctly and that it can run without errors.": "Le processus du navigateur s’est arrêté avec du code {0} avant de se connecter au serveur de débogage. Assurez-vous que le `runtimeExecutable` est configuré correctement et qu’il peut s’exécuter sans erreur.",
			"The configured `cwd` {0} does not exist.": "Le `cwd` {0} configuré n'existe pas.",
			"The configured `cwd` {0} is not a folder.": "Le {0} « cwd » configuré n’est pas un dossier.",
			"This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Il s'agit d'un chemin de fichier manquant référencé par un mappage de source. Voulez-vous déboguer la version compilée à la place ?",
			"Thread is not paused": "Le thread n'est pas interrompu",
			"Thread is not paused on exception": "Le thread n'est pas interrompu en cas d'exception",
			"Thread not found": "Thread introuvable",
			"Type of profile": "Type de profil",
			"URL contains \"{0}\"": "L’URL contient « {0} »",
			"UWP webview debugging is not available on your platform.": "Le débogage de l’affichage web UWP n’est pas disponible sur votre plateforme.",
			"Unable to attach to browser": "Impossible d'attacher le navigateur",
			"Unable to evaluate": "Nous n’avons pas pu évaluer",
			"Unable to evaluate on async stack frame": "Impossible d'évaluer le frame de pile asynchrone",
			"Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "Impossible de localiser une installation du navigateur sur votre système. Essayez de l'installer ou de fournir le chemin absolu du navigateur dans le « runtimeExecutable » de votre launch.json.",
			"Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "Impossible de localiser {0} version {1}. Versions découvertes automatiquement disponibles : {2}. Vous pouvez définir \"runtimeExecutable\" en fonction de l'une de ces versions dans votre fichier launch.json, ou fournir le chemin absolu de l'exécutable du navigateur.",
			"Unable to launch browser: \"{0}\"": "Impossible de lancer le navigateur : \"{0}\"",
			"Unable to pause": "Impossible d’interrompre",
			"Unable to pretty print": "Impossible d'effectuer une impression en mode Pretty",
			"Unable to resume": "Impossible de reprendre",
			"Unable to retrieve source content": "Impossible de récupérer le contenu source",
			"Unable to set variable value": "Impossible de définir la valeur de la variable",
			"Unable to step in": "Impossible d'effectuer un pas à pas détaillé",
			"Unable to step next": "Impossible d'effectuer le pas à pas suivant",
			"Unable to step out": "Impossible d'effectuer un pas à pas sortant",
			"Unbound breakpoint": "Point d’arrêt indépendant",
			"Uncaught Exceptions": "Exceptions non interceptées",
			"Unknown error": "Erreur inconnue",
			"VS Code can provide better debugging experience for WebAssembly via \"DWARF Debugging\" extension. Would you like to install it?/\"DWARF Debugging\" is the extension name and should not be localized.": "VS Code pouvez améliorer l’expérience de débogage pour WebAssembly par le biais de l’extension « Débogage de DWARF ». Voulez-vous l’installer ?",
			"Variable not found": "Variable introuvable",
			"Variables not available in async stacks": "Variables non disponibles dans les piles asynchrones",
			"WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "AVERTISSEMENT : Le traitement des mappages de sources de {0} a pris plus de {1} ms. Nous avons donc poursuivi l'exécution sans attendre que tous les points d'arrêt du script soient définis.",
			"We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "Nous ne pouvons pas lancer un navigateur en mode débogage à partir d'ici. Si vous souhaitez déboguer cette page web, ouvrez cet espace de travail à partir de VS Code sur votre poste de travail.",
			"We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "Nous ne pouvons pas lancer un navigateur en mode débogage à partir d'ici. Ouvrez cet espace de travail dans VS Code sur votre poste de travail pour activer le débogage.",
			"WebGL Error Fired": "Erreur WebGL déclenchée",
			"WebGL Warning Fired": "Avertissement WebGL déclenché",
			"With Block": "Bloc With",
			"Would you like to save a configuration in your launch.json for easy access later?": "Voulez-vous enregistrer une configuration dans votre fichier launch.json pour y accéder facilement plus tard ?",
			"XHR/Fetch URLs": "URL XHR/récupération (fetch)",
			"Yes": "Oui",
			"You may install the `{}` module via npm for enhanced WebAssembly debugging": "Vous pouvez installer le module `{}` par le biais de npm pour le débogage WebAssembly amélioré",
			"You need to open a workspace folder to debug npm scripts.": "Vous devez ouvrir un dossier d'espace de travail pour déboguer les scripts npm.",
			"You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Vous exécutez une version obsolète de Node.js. Nous vous recommandons d’effectuer la mise à jour afin de bénéficier des correctifs de bogues, de performance et de sécurité les plus récents.",
			"an old debug session": "ancienne session de débogage",
			"breakpoint.provisionalBreakpoint": "breakpoint.provisionalBreakpoint",
			"path does not exist": "le chemin n'existe pas",
			"process id: {0} ({1})": "ID de processus : {0} ({1})",
			"process id: {0}, debug port: {1} ({2})": "ID de processus : {0}, port de débogage : {1} ({2})",
			"setInterval fired": "setInterval déclenché",
			"setTimeout fired": "setTimeout déclenché",
			"the configured userDataDir": "userDataDir configuré",
			"{0} (couldn't describe: {1})": "{0} (description impossible : {1})",
			"{0} Click to Stop Profiling": "{0} Cliquez pour arrêter le profilage",
			"{0} Click to Stop Profiling ({1} sessions)": "{0} Cliquez pour arrêter le profilage ({1} sessions)",
			"{0} Click to Stop Profiling ({1})": "{0} Cliquez pour arrêter le profilage ({1})"
		}
	}
}