{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.eventListener.breakpoint": "Alternar Pontos de Interrupção do Ouvinte de Eventos",
			"add.xhr.breakpoint": "Adicionar Ponto de Interrupção XHR/fetch",
			"attach.node.process": "Anexar ao Processo do Node",
			"base.cascadeTerminateToConfigurations.label": "Uma lista de sessões de depuração que, quando esta sessão de depuração for terminada, também será interrompida.",
			"base.enableDWARF.label": "Alterna se o depurador tentará ler símbolos de depuração DWARF do WebAssembly, o que pode consumir muitos recursos. Requer a extensão 'ms-vscode.wasm-dwarf-debugging' para funcionar.",
			"breakpoint.xhr.any": "Qualquer XHR/fetch",
			"breakpoint.xhr.contains": "Interromper quando o URL contiver:",
			"browser.address.description": "Endereço IP ou nome do host no qual o navegador depurado está escutando.",
			"browser.attach.port.description": "Porta a ser usada para depuração remota do navegador, dada como `--remote-debugging-port` ao iniciar o navegador.",
			"browser.baseUrl.description": "URL base para resolver os caminhos baseUrl. baseURL é aparado ao mapear URLs para os arquivos no disco. O padrão é o domínio da URL de inicialização.",
			"browser.browserAttachLocation.description": "Força o navegador a se anexar a uma localização. Em um workspace remoto (por meio de ssh ou WSL, por exemplo), isso pode ser usado para anexar a um navegador no computador remoto, em vez de localmente.",
			"browser.browserLaunchLocation.description": "Força o navegador a ser iniciado em uma localização. Em um workspace remoto (por meio de ssh ou WSL, por exemplo), isso pode ser usado para abrir o navegador no computador remoto, em vez de localmente.",
			"browser.cleanUp.description": "Qual limpeza será feita após a conclusão da sessão de depuração. Feche apenas a guia que está sendo depurada e não todo o navegador.",
			"browser.cwd.description": "Diretório de trabalho opcional para o executável do runtime.",
			"browser.disableNetworkCache.description": "Controla se deve ignorar o cache de rede para cada solicitação",
			"browser.env.description": "Dicionário opcional de pares de chaves/valor de ambiente para o navegador.",
			"browser.file.description": "Um arquivo html local a ser aberto no navegador",
			"browser.includeDefaultArgs.description": "Whether default browser launch arguments (to disable features that may make debugging harder) will be included in the launch.",
			"browser.includeLaunchArgs.description": "Avançado: se algum argumento de inicialização/depuração padrão está definido no navegador. O depurador assumirá que o navegador usará a depuração de pipe, como a fornecida com `--remote-debugging-pipe`.",
			"browser.inspectUri.description": "Formato a ser usado para reescrever o inspectUri: é uma cadeia de caracteres de modelo que interpola chaves em `{curlyBraces}`. As chaves disponíveis são:\r\n – `url.*` é o endereço analisado do aplicativo em execução. Por exemplo, `{url.port}`, `{url.hostname}`\r\n – `port` é a porta de depuração na qual o Chrome está escutando. \r\n– `browserInspectUri` é o URI do inspetor no navegador iniciado\r\n – `browserInspectUriPath` é a parte de caminho do URI do inspetor no navegador iniciado (por exemplo: \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\").\r\n – `wsProtocol` é o protocolo do WebSocket com dica. Ele será configurado como `wss` se a URL original for `https`, caso contrário, ele será configurado como `ws`.\r\n",
			"browser.launch.port.description": "Porta para o navegador escutar. O padrão é \"0\", o que fará com que o navegador seja depurado por pipes, o que é geralmente mais seguro e deve ser escolhido a menos que você precise anexar ao navegador usando outra ferramenta.",
			"browser.pathMapping.description": "Um mapeamento de URLs/caminhos para pastas locais, para resolver scripts no Navegador para scripts em disco",
			"browser.perScriptSourcemaps.description": "Se os scripts são carregados individualmente como sourcemaps exclusivos contendo o nome base do arquivo de origem. Essa opção pode ser definida para otimizar o tratamento do sourcemap ao lidar com muitos scripts pequenos. Se ela for definida como \"auto\", detectaremos casos conhecidos em que essa opção é apropriada.",
			"browser.profileStartup.description": "Se true, iniciará a criação de perfil assim que o processo for iniciado",
			"browser.restart": "Se será necessário reconectar se a conexão do navegador estiver fechada",
			"browser.revealPage": "Guia de Foco",
			"browser.runtimeArgs.description": "Argumentos opcionais passados para o executável do runtime.",
			"browser.runtimeExecutable.description": "Either 'canary', 'stable', 'custom' or path to the browser executable. Custom means a custom wrapper, custom build or CHROME_PATH environment variable.",
			"browser.runtimeExecutable.edge.description": "'canary', 'stable', 'dev', 'custom' ou caminho para o executável do navegador. Personalizado significa um wrapper personalizado, um build personalizado ou a variável de ambiente EDGE_PATH.",
			"browser.server.description": "Configures a web server to start up. Takes the same configuration as the 'node' launch task.",
			"browser.skipFiles.description": "Uma matriz de nomes de arquivos ou pastas, ou globs de caminho, a serem ignorados durante a depuração. Padrões de estrela e negações são permitidos, por exemplo, `[\"**/node_modules/**\", \"!**/node_modules/my-module/**\"]`",
			"browser.smartStep.description": "Percorre automaticamente linhas não mapeadas em arquivos com sourcemap. Por exemplo, o código que o TypeScript produz automaticamente ao fazer \"downcompile\" de async/await ou de outros recursos.",
			"browser.sourceMapPathOverrides.description": "Um conjunto de mapeamentos para regravar os locais dos arquivos de origem indicados pelo sourcemap, para seus respectivos locais no disco. Confira o LEIAME para obter detalhes.",
			"browser.sourceMapRenames.description": "Se usar o mapeamento de \"nomes\" nos sourcemaps. Isso requer a solicitação de conteúdo de origem, o que pode ser lento com determinados depuradores.",
			"browser.sourceMaps.description": "Usar os source maps JavaScript (caso haja algum).",
			"browser.targetSelection": "Se deve ser anexado a todos os destinos que correspondam ao filtro de URL (\"automatic\") ou solicitar a seleção de um (\"pick\").",
			"browser.timeout.description": "Retry for this number of milliseconds to connect to the browser. Default is 10000 ms.",
			"browser.url.description": "Procurará uma guia com esta url exata e anexará a ela, se encontrado",
			"browser.urlFilter.description": "Pesquisará uma página com essa URL e a anexará a ela, se encontrada. Pode ter * curingas.",
			"browser.userDataDir.description": "Por padrão, o navegador é iniciado com um perfil de usuário separado em uma pasta temporária. Use essa opção para substituí-la. Defina como false para iniciar com seu perfil de usuário padrão. Um novo navegador não poderá ser iniciado se uma instância já estiver sendo executada a partir do `UserDataDir`.",
			"browser.vueComponentPaths": "Uma lista de padrões glob de arquivo para localizar os componentes `*.vue`. Por padrão, pesquisa todo o workspace. Isso precisa ser especificado devido a pesquisas extras que os sourcemaps do Vue exigem na CLI 4 do Vue. Você pode desabilitar esse processamento especial definindo-o como uma matriz vazia.",
			"browser.webRoot.description": "Especifica o caminho absoluto do workspace para a raiz do servidor Web. Usado para resolver caminhos, como '/app.js', para arquivos no disco. A abreviação de um pathMapping como \"/\"",
			"chrome.attach.description": "Anexar a uma instância do Chrome já no modo depuração",
			"chrome.attach.label": "Chrome: Anexar",
			"chrome.label": "Aplicativo Web (Chrome)",
			"chrome.launch.description": "Inicie o Chrome para depurar uma URL",
			"chrome.launch.label": "Chrome: Iniciar",
			"commands.callersAdd.label": "Excluir chamador",
			"commands.callersAdd.paletteLabel": "Excluir o chamador da pausa no local atual",
			"commands.callersGoToCaller.label": "Vá para o local do chamador",
			"commands.callersGoToTarget.label": "Vá para o local de destino",
			"commands.callersRemove.label": "Remover o chamador excluído",
			"commands.callersRemoveAll.label": "Remover todos os chamadores excluídos",
			"commands.disableSourceMapStepping.label": "Desabilitar Etapa Mapeada de Origem",
			"commands.enableSourceMapStepping.label": "Habilitar Etapa Mapeada de Origem",
			"commands.networkClear.label": "Limpar Log de Rede",
			"commands.networkCopyURI.label": "Copiar a URL da Solicitação",
			"commands.networkOpenBody.label": "Abrir Corpo da Resposta",
			"commands.networkOpenBodyInHexEditor.label": "Abrir o Corpo da Resposta no Editor Hexadecimal",
			"commands.networkReplayXHR.label": "Solicitação de Reprodução",
			"commands.networkViewRequest.label": "Exibir a Solicitação como cURL",
			"configuration.autoAttachMode": "Configura quais processos serão anexados e depurados automaticamente quando `#debug.node.autoAttach#` estiver ativado. Um processo do Node iniciado com o sinalizador `--inspect` sempre receberá um anexo, independentemente desta configuração.",
			"configuration.autoAttachMode.always": "Anexar automaticamente a cada processo do Node.js iniciado no terminal.",
			"configuration.autoAttachMode.disabled": "A anexação automática está desativada e não é mostrada na barra de status. ",
			"configuration.autoAttachMode.explicit": "Somente anexar automaticamente quando o `--inspect` for fornecido.",
			"configuration.autoAttachMode.smart": "Anexar automaticamente ao executar scripts que não estão em uma pasta node_modules.",
			"configuration.autoAttachSmartPatterns": "Configura padrões glob para determinar quando fazer a anexação no modo \"inteligente\" `#debug.javascript.autoAttachFilter#`. `$KNOWN_TOOLS$` é substituído por uma lista de nomes de executores comuns de código e de teste. [Leia mais nos documentos do VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.automaticallyTunnelRemoteServer": "When debugging a remote web app, configures whether to automatically tunnel the remote server to your local machine.",
			"configuration.breakOnConditionalError": "Se deve parar quando os pontos de interrupção condicionais lançam um erro.",
			"configuration.debugByLinkOptions": "Options used when debugging open links clicked from inside the debug terminal. Can be set to \"false\" to disable this behavior.",
			"configuration.defaultRuntimeExecutables": "Se não for especificada, esta opção será o `runtimeExecutable` padrão usado para configurações de inicialização. Ela pode ser usada para configurar caminhos personalizados para o Node.js ou para as instalações do navegador.",
			"configuration.enableNetworkView": "Habilita a exibição de rede experimental para destinos compatíveis.",
			"configuration.npmScriptLensLocation": "Onde uma lente de código \"Executar\" e \"Depurar\" deve ser mostrada nos seus scripts npm. Pode estar em \"todos\" os scripts, na \"parte superior\" da seção de scripts ou \"nunca\".",
			"configuration.pickAndAttachOptions": "Opções padrão usadas durante a depuração de um processo usando o comando `Debug: Attach to Node.js Process`",
			"configuration.resourceRequestOptions": "Opções de solicitação a serem usadas ao carregar recursos, como source maps, no depurador. Talvez seja necessário configurá-las se os sourcemaps exigem autenticação ou usam um certificado autoassinado, por exemplo. As opções são usadas para criar uma solicitação com a biblioteca [`got`](https://github.com/sindresorhus/got) library.\r\n\r\nUm caso comum para desabilitar a verificação de certificado pode ser feito passando `{ \"https\": { \"rejectUnauthorized\": false } }`.",
			"configuration.terminalOptions": "Opções de inicialização padrão para o terminal de depuração JavaScript e scripts npm.",
			"configuration.unmapMissingSources": "Configura se o arquivo sourcemapped em que o arquivo original não pode ser lido será desmapeado automaticamente. Se essa configuração for false (padrão), um prompt será exibido.",
			"createDiagnostics.label": "Diagnosticar Problemas de Ponto de Interrupção",
			"customDescriptionGenerator.description": "Personalizar a descrição textual que o depurador mostra para objetos (variáveis locais etc.). Amostras:\r\n      1. this.toString() // chamará toString para imprimir todos os objetos\r\n      2. this.customDescription ? this.customDescription() : defaultValue // Use o método customDescription se disponível, se não retornar defaultValue\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Use o método customDescription, se disponível, se não retornar defaultValue\r\n",
			"customPropertiesGenerator.description": "Personalize as propriedades mostradas para um objeto no depurador (variáveis locais, etc...). Exemplos:\r\n    1. { ...this, extraProperty: '12345' } // Adicionar uma extraProperty 12345 a todos os objetos\r\n    2. this.customProperties ? this.customProperties() : this // Usar o método customProperties, se disponível, caso contrário, usar as propriedades em this (as propriedades padrão)\r\n    3. function () { return this.customProperties ? this.customProperties() : this } // Usar o método customDescription, se disponível, caso contrário, retornar as propriedades padrão\r\n\r\n    Preterido: esta é uma implementação temporária deste recurso até que haja tempo para implementá-lo da maneira descrita aqui: https://github.com/microsoft/vscode/issues/102181",
			"debug.npm.edit": "Editar package.json",
			"debug.npm.noScripts": "Nenhum script npm encontrado no seu package.json",
			"debug.npm.noWorkspaceFolder": "Você precisa abrir uma pasta da área de trabalho para depurar scripts npm.",
			"debug.npm.parseError": "Não foi possível ler {0}: {1}",
			"debug.npm.script": "Depurar o Script do npm",
			"debug.terminal.attach": "Anexar ao Processo de Terminal do Node.js",
			"debug.terminal.label": "Terminal de Depuração de JavaScript",
			"debug.terminal.program.description": "Comando para executar no terminal Inicializado. Se não for fornecido, o terminal será aberto sem a inicialização de um programa.",
			"debug.terminal.snippet.label": "Executar \"npm start\" em um terminal de depuração",
			"debug.terminal.toggleAuto": "Ativar/Desativar Anexo de Terminal Automático do Node.js",
			"debug.terminal.welcome": "[Terminal de Depuração do JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nVocê pode usar o Terminal de Depuração do JavaScript para depurar os processos do Node.js executados na linha de comando.",
			"debug.terminal.welcomeWithLink": "[Terminal de Depuração do JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nVocê pode usar o Terminal de Depuração do JavaScript para depurar os processos do Node.js executados na linha de comando.\r\n\r\n[URL de Depuração](command:extension.js-debug.debugLink)",
			"debug.unverifiedBreakpoints": "Alguns de seus pontos de interrupção não puderam ser definidos. Se estiver com problemas, você pode [solucionar problemas de configuração de inicialização](command:extension.js-debug.createDiagnostics).",
			"debugLink.label": "Abrir Link",
			"edge.address.description": "Ao depurar modos de exibição da Web, o endereço IP ou o nome do host no qual o modo de exibição da Web está escutando. Será descoberto automaticamente se não estiver definido.",
			"edge.attach.description": "Attach to an instance of Edge already in debug mode",
			"edge.attach.label": "Edge: Anexar",
			"edge.label": "Aplicativo Web (Edge)",
			"edge.launch.description": "Launch Edge to debug a URL",
			"edge.launch.label": "Edge: Iniciar",
			"edge.port.description": "Ao depurar modos de exibição da Web, a porta na qual o depurador do modo de exibição da Web está escutando. Será descoberto automaticamente se não estiver definido.",
			"edge.useWebView.attach.description": "Um objeto contendo o `pipeName` de um pipe de depuração para um Webview2 hospedado em UWP. Este é o \"MyTestSharedMemory\" ao criar o pipe \"\\\\.\\pipe\\LOCAL\\MyTestSharedMemory\"",
			"edge.useWebView.launch.description": "Quando 'verdadeiro', o depurador tratará o executável de tempo de execução como um aplicativo host que contém um WebView, permitindo que você depure o conteúdo do script WebView.",
			"edit.xhr.breakpoint": "Editar Ponto de Interrupção XHR/fetch",
			"enableContentValidation.description": "Ativa/desativa se deve ser feita uma verificação se os conteúdos dos arquivos no disco correspondem aos carregados no runtime. Isso é útil em uma variedade de cenários e exigido em alguns, mas poderá causar problemas se você tiver transformação de scripts do lado do servidor, por exemplo.",
			"errors.timeout": "{0}: tempo limite após {1} ms",
			"extension.description": "Uma extensão para depurar programas Node.js e Chrome.",
			"extensionHost.label": "Desenvolvimento de Extensão do VS Code",
			"extensionHost.launch.config.name": "Iniciar a Extensão",
			"extensionHost.launch.debugWebWorkerHost": "Configura se devemos tentar anexar ao host de extensão do web worker.",
			"extensionHost.launch.debugWebviews": "Configura se devemos tentar anexar a exibições da Web na instância de VS Code inicializada. Isso só funcionará na área de trabalho VS Code.",
			"extensionHost.launch.env.description": "Variáveis de ambiente passadas para o host de extensão.",
			"extensionHost.launch.rendererDebugOptions": "Opções de inicialização do Chrome usadas ao anexar ao processo do renderizador, com `debugWebviews` ou `debugWebWorkerHost`.",
			"extensionHost.launch.runtimeExecutable.description": "Caminho absoluto para o VS Code.",
			"extensionHost.launch.stopOnEntry.description": "Parar o host de extensão automaticamente após a inicialização.",
			"extensionHost.launch.testConfiguration": "Caminho para um arquivo de configuração de teste para a [CLI de teste](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).",
			"extensionHost.launch.testConfigurationLabel": "Uma única configuração a ser executada a partir do arquivo. Se não especificar, você poderá ser solicitado a escolher.",
			"extensionHost.snippet.launch.description": "Iniciar uma extensão do VS Code no modo de depuração",
			"extensionHost.snippet.launch.label": "Desenvolvimento de Extensão do VS Code",
			"getDiagnosticLogs.label": "Salvar Logs de Depuração JS de Diagnóstico",
			"longPredictionWarning.disable": "Não mostrar novamente",
			"longPredictionWarning.message": "Está demorando um pouco para configurar seus pontos de interrupção. Você pode acelerar isso atualizando os 'outFiles' em seu launch.json.",
			"longPredictionWarning.noFolder": "Nenhuma pasta de espaço de trabalho aberta.",
			"longPredictionWarning.open": "Abrir launch.json",
			"node.address.description": "Endereço TCP/IP do processo a ser depurado. O padrão é 'localhost'.",
			"node.attach.attachExistingChildren.description": "Se deve tentar conectar-se a processos filhos já gerados.",
			"node.attach.attachSpawnedProcesses.description": "Se as variáveis de ambiente devem ser definidas no processo anexado para rastrear filhos gerados.",
			"node.attach.config.name": "Anexar",
			"node.attach.continueOnAttach": "If true, we'll automatically resume programs launched and waiting on `--inspect-brk`",
			"node.attach.processId.description": "ID do processo usada para anexar.",
			"node.attach.restart.description": "Tentar se reconectar com o programa se a conexão for perdida. Se definido como `true`, tentaremos uma vez por segundo, para sempre. Você pode personalizar o intervalo e o número máximo de tentativas especificando `delay` e `maxAttempts` em um objeto.",
			"node.attachSimplePort.description": "Se definido, será anexado ao processo por meio da porta especificada. Isso geralmente não é mais necessário para programas do Node.js e perde a capacidade de depurar processos filho, mas pode ser útil em cenários diferentes, como com inicializações Deno e Docker. Se definido como 0, uma porta aleatória será escolhida e --inspect-brk será adicionado aos argumentos de inicialização automaticamente.",
			"node.console.title": "Console de Depuração do Node",
			"node.disableOptimisticBPs.description": "Não defina pontos de interrupção em nenhum arquivo até que um sourcemap seja carregado nesse arquivo.",
			"node.enableTurboSourcemaps.description": "Configura se um mecanismo novo e mais rápido deve ser usado para a descoberta de sourcemap",
			"node.experimentalNetworking.description": "Habilite a inspeção experimental do Node.js. Quando definido como `auto`, ela é habilitada em versões do Node.js compatíveis. Ela pode ser definida como `on` ou `off` para ser habilitada ou desabilitada explicitamente.",
			"node.killBehavior.description": "Configura como os processos de depuração são encerrado quando a sessão é interrompida. Pode ser:\r\n\r\n– forceful (padrão): divide a árvore de processos de maneira forçada. Envia SIGKILL no posix ou `taskkill.exe /F` no Windows.\r\n– polite: divide normalmente a árvore de processos. É possível que a execução de processos de comportamento inadequado continue após esse tipo de desligamento. Envia SIGTERM no posix ou `taskkill.exe` sem nenhum sinalizador `/F` (forçar) no Windows.\r\n– none: não ocorrerá nenhum encerramento.",
			"node.label": "Node.js",
			"node.launch.args.description": "Argumentos da linha de comando passados para o programa.\r\n\r\nNão é possível ser uma matriz de cadeias de caracteres ou uma única cadeia de caracteres. Quando o programa é iniciado em um terminal, definir essa propriedade como uma única cadeia de caracteres fará com que os argumentos não sejam escapados para o shell.",
			"node.launch.autoAttachChildProcesses.description": "Anexar automaticamente o depurador a novos processos filho.",
			"node.launch.config.name": "Iniciar",
			"node.launch.console.description": "A localização na qual o destino de depuração será iniciado.",
			"node.launch.console.externalTerminal.description": "Terminal externo que pode ser configurado por meio das configurações de usuário",
			"node.launch.console.integratedTerminal.description": "Terminal integrado do VS Code",
			"node.launch.console.internalConsole.description": "Console de Depuração do VS Code (que não dá suporte à leitura da entrada de um programa)",
			"node.launch.cwd.description": "Caminho absoluto para o diretório de trabalho do programa que está sendo depurado. Se você definir localRoot, cwd corresponderá ao valor, caso contrário, retornará para workspaceFolder",
			"node.launch.env.description": "Variáveis de ambiente passadas para o programa. O valor `null` remove a variável do ambiente.",
			"node.launch.envFile.description": "Caminho absoluto para um arquivo que contém as definições de variável de ambiente.",
			"node.launch.logging": "Configuração de registro em log",
			"node.launch.logging.cdp": "Caminho para o arquivo de log das mensagens do Protocolo Chrome DevTools",
			"node.launch.logging.dap": "Caminho para o arquivo de log para mensagens do Debug Adapter Protocol",
			"node.launch.outputCapture.description": "De onde capturar as mensagens de saída: a API de depuração padrão, se definida como `console`, ou os fluxos stdout/stderr, se definida como `std`.",
			"node.launch.program.description": "Caminho absoluto para o programa. O valor gerado é deduzido olhando para package.json e os arquivos abertos. Edite esse atributo.",
			"node.launch.restart.description": "Tente reiniciar o programa se ele sair com um código de saída diferente de zero.",
			"node.launch.runtimeArgs.description": "Argumentos opcionais passados para o executável do runtime.",
			"node.launch.runtimeExecutable.description": "O runtime a ser usado. Um caminho absoluto ou o nome de um runtime disponível em PATH. Se omitido, será presumido `node`.",
			"node.launch.runtimeSourcemapPausePatterns": "Uma lista de padrões nos quais inserir manualmente os pontos de interrupção do ponto de entrada. Isso pode ser útil para dar ao depurador a oportunidade de definir pontos de interrupção ao usar mapas de origem que não existem ou não podem ser detectados antes do lançamento, como [com o Serverless framework](https://github.com/microsoft/vscode -js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Versão do runtime `node` a ser usada. Exige `nvm`.",
			"node.launch.useWSL.deprecation": "'useWSL' foi preterido e o suporte para ele será removido. Use a extensão 'Remote – WSL'.",
			"node.launch.useWSL.description": "Use o Subsistema do Windows para Linux.",
			"node.localRoot.description": "Caminho para o diretório local que contém o programa.",
			"node.pauseForSourceMap.description": "Se é necessário aguardar o carregamento dos mapas de origem para cada script recebido. Isso tem uma sobrecarga de desempenho e pode ser desativado com segurança ao ficar sem disco, desde que o `rootPath` não esteja desativado.",
			"node.port.description": "A porta de depuração usada para anexar. O padrão é 9229.",
			"node.processattach.config.name": "Anexar ao Processo",
			"node.profileStartup.description": "Se true, iniciará a criação de perfil assim que o processo for iniciado",
			"node.remote.host.header.description": "Cabeçalho de Host explícito a ser usado ao se conectar ao websocket do inspetor. Se não for especificado, o cabeçalho do host será definido como \"localhost\". Isso é útil quando o inspetor está executando atrás de um proxy que aceita apenas um cabeçalho de Host específico.",
			"node.remoteRoot.description": "Caminho absoluto para o diretório remoto que contém o programa.",
			"node.resolveSourceMapLocations.description": "Uma lista de padrões de minimatch para locais (pastas e URLs) em que mapas de origem podem ser usados para resolver arquivos locais. Isso pode ser usado para evitar quebrar incorretamente o código mapeado de origem externa. Padrões podem ser prefixados com \"!\" para excluí-los. Pode ser definido como uma matriz vazia ou nula para evitar a restrição.",
			"node.showAsyncStacks.description": "Mostrar as chamadas assíncronas que levaram à pilha de chamadas atual.",
			"node.snippet.attach.description": "Anexar a um programa de nó em execução",
			"node.snippet.attach.label": "Node.js: Anexar",
			"node.snippet.attachProcess.description": "Abrir o seletor de processos para selecionar o processo de nó ao qual anexar",
			"node.snippet.attachProcess.label": "Node.js: Anexar ao Processo",
			"node.snippet.electron.description": "Depurar o processo principal do Electron",
			"node.snippet.electron.label": "Node.js: Página Principal do Electron",
			"node.snippet.gulp.description": "Depurar a tarefa gulp (verifique se há um gulp local instalado no seu projeto)",
			"node.snippet.gulp.label": "Node.js: Tarefa gulp",
			"node.snippet.launch.description": "Iniciar um programa de nó no modo de depuração",
			"node.snippet.launch.label": "Node.js: Iniciar o Programa",
			"node.snippet.mocha.description": "Depurar testes moca",
			"node.snippet.mocha.label": "Node.js: Testes Moca",
			"node.snippet.nodemon.description": "Usar nodemon para reiniciar uma sessão de depuração nas alterações de origem",
			"node.snippet.nodemon.label": "Node.js: Instalação do Nodemon",
			"node.snippet.npm.description": "Iniciar um programa de nó por meio de um script `debug` do npm",
			"node.snippet.npm.label": "Node.js: iniciar pelo npm",
			"node.snippet.remoteattach.description": "Anexar à porta de depuração de um programa de nó remoto",
			"node.snippet.remoteattach.label": "Node.js: Anexar ao Programa Remoto",
			"node.snippet.yo.description": "Depurar o gerador de yeoman (instalar executando `npm link` na pasta do projeto)",
			"node.snippet.yo.label": "Node.js: Gerador de yeoman",
			"node.sourceMapPathOverrides.description": "Um conjunto de mapeamentos para regravar os locais dos arquivos de origem indicados pelo sourcemap nos respectivos locais no disco.",
			"node.sourceMaps.description": "Usar os source maps JavaScript (caso haja algum).",
			"node.stopOnEntry.description": "Parar o programa automaticamente após a inicialização.",
			"node.timeout.description": "Repetir a conexão com o Node.js após esse número de milissegundos. O padrão é 10000 ms.",
			"node.versionHint.description": "Permite que você especifique explicitamente a versão do Nó que está em execução, que pode ser usada para desabilitar ou habilitar determinados comportamentos em casos que a detecção de versão automática não funciona.",
			"node.websocket.address.description": "Endereço exato do websocket ao qual anexar. Se não for especificado, ele será descoberto pelo endereço e porta.",
			"openEdgeDevTools.label": "Abrir Devtools do Navegador",
			"outFiles.description": "Quando os source maps estão habilitados, esses padrões glob especificam os arquivos JavaScript gerados. Quando um padrão começa com '!', os arquivos são excluídos. Quando não especificado, o código gerado é esperado no mesmo diretório que sua origem.",
			"pretty.print.script": "Impressão bonita para depuração",
			"profile.start": "Iniciar Perfil de Desempenho",
			"profile.stop": "Parar Perfil de Desempenho",
			"remove.eventListener.breakpoint.all": "Remover Todos os Pontos de Interrupção do Ouvinte de Eventos",
			"remove.xhr.breakpoint": "Remover Ponto de Interrupção XHR/fetch",
			"remove.xhr.breakpoint.all": "Remover Todos os Pontos de Interrupção XHR/fetch",
			"requestCDPProxy.label": "Solicitar Proxy de CDP para Sessão de Depuração",
			"skipFiles.description": "Uma matriz de padrões glob para arquivos a serem ignorados durante a depuração. O padrão `<node_internals>/**` corresponde a todos os módulos de Node.js internos.",
			"smartStep.description": "Percorrer automaticamente o código gerado que não pode ser mapeado novamente para a origem original.",
			"start.with.stop.on.entry": "Iniciar a Depuração e Interromper na Entrada",
			"startWithStopOnEntry.label": "Iniciar a Depuração e Interromper na Entrada",
			"timeouts.generalDescription": "Tempos limite para várias operações de depurador.",
			"timeouts.generalDescription.markdown": "Tempos limite para várias operações de depurador.",
			"timeouts.hoverEvaluation.description": "Tempo até que a avaliação de valor para símbolos focalizados seja anulada. Se definido como 0, a avaliação de foco nunca expira.",
			"timeouts.sourceMaps.description": "Tempos limite relacionados a operações de sourcemaps.",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Tempo extra em milissegundos permitido por sessão a ser gasto esperando que os sourcemaps sejam processados, após o tempo mínimo (sourceMapMinPause) ter sido esgotado",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Tempo mínimo em milissegundos gasto aguardando o processamento de cada sourcemap quando um script está sendo analisado",
			"toggle.skipping.this.file": "Ativar/desativar a opção de Ignorar este Arquivo",
			"trace.boolean.description": "Trace may be set to 'true' to write diagnostic logs to the disk.",
			"trace.description": "Configura qual saída de diagnóstico é produzida.",
			"trace.logFile.description": "Configura onde os logs são gravados no disco.",
			"trace.stdio.description": "Whether to return trace data from the launched application or browser.",
			"workspaceTrust.description": "A confiança é necessária para depurar o código nesse espaço de trabalho."
		},
		"bundle": {
			"A profiling session is already running, would you like to stop it and start a new session?": "Uma sessão de criação de perfil já está em execução. Deseja pará-la e iniciar uma nova sessão?",
			"Add XHR Breakpoint": "Adicionar Ponto de Interrupção XHR",
			"Add new URL...": "Adicionar novo URL...",
			"Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Ajuste os padrões glob no atributo 'outFiles' para que eles abranjam o JavaScript gerado.",
			"Always": "Sempre",
			"Always in this Workspace": "Sempre neste Workspace",
			"An error occurred taking a profile from the target.": "Ocorreu um erro ao fazer um perfil do destino.",
			"Animation Frame Fired": "Quadro de Animação Acionado",
			"Any XHR or fetch": "Qualquer XHR ou fetch",
			"Assertion failed": "Falha na declaração",
			"Attach to process: '{0}' doesn't look like a process id.": "Anexar ao processo: '{0}' não parece uma ID de processo.",
			"Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Anexar ao processo: não é possível habilitar o modo de depuração para o processo '{0}' ({1}).",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "O atributo 'runtimeVersion' exige o gerenciador de versão 'nvm-windows' ou 'nvs' do Node.js.",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvs', 'nvm' or 'fnm' to be installed.": "O atributo 'runtimeVersion' requer que o gerenciador de versão Node.js 'nvs', 'nvm' ou 'fnm' esteja instalado.",
			"Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "O atributo 'runtimeVersion' com um tipo/arquitetura requer que 'nvs' seja instalado.",
			"Bidder Bidding Phase Start": "Início da Fase de Oferta do Ofertante",
			"Bidder Reporting Phase Start": "Início da Fase de Relatórios do Ofertante",
			"Block": "Bloquear",
			"Break when URL Contains": "Interromper quando o URL contiver",
			"Breaks on all throw errors, even if they're caught later.": "Ocorre uma interrupção em todos os erros gerados, mesmo que eles sejam capturados mais tarde.",
			"Breaks only on errors or promise rejections that are not handled.": "Interrompe somente erros ou rejeições de promessa que não são tratadas.",
			"Browser connection failed, will retry: {0}": "Falha na conexão do navegador, será repetido: {0}",
			"CPU Profile": "Perfil de CPU",
			"CPU profile saved as \"{0}\" in your workspace folder": "Perfil da CPU salvo como \"{0}\" na pasta do workspace",
			"CSP violation \"{0}\"": "Violação de CSP \"{0}\"",
			"Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "Não é possível localizar o binário \"{0}\" do Node.js: {1}. Certifique-se de que o Node.js está instalado e no CAMINHO ou defina \"runtimeExecutable\" em seu launch.json",
			"Can't load environment variables from file ({0}).": "Não é possível carregar as variáveis de ambiente do arquivo ({0}).",
			"Cancel Animation Frame": "Cancelar Quadro de Animação",
			"Cannot connect to the target at {0}: {1}": "Não é possível se conectar ao destino em {0}: {1}",
			"Cannot find `{0}` installed in {1}": "Não foi possível localizar `{0}` instalado em {1}",
			"Cannot find a program to debug": "Não é possível encontrar um programa a ser depurado",
			"Cannot find test configuration with label `{0}`, got: {1}": "Não foi possível localizar a configuração de teste com o rótulo `{0}`, obtive: {1}",
			"Cannot launch debug target in terminal ({0}).": "Não é possível iniciar o destino de depuração no terminal ({0}).",
			"Cannot restart asynchronous frame": "Não é possível reiniciar quadro assíncrono",
			"Cannot set an empty value": "Não é possível definir um valor vazio",
			"Catch Block": "Capturar Bloco",
			"Caught Exceptions": "Exceções Capturadas",
			"Close AudioContext": "Fechar AudioContext",
			"Closure": "Fechamento",
			"Closure ({0})": "Fechamento ({0})",
			"Console profile started": "Perfil do console iniciado",
			"Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "Não foi possível conectar a nenhum pipe UWP Webview. Certifique-se de que sua visualização da web esteja hospedada no modo de depuração e que o `pipeName` em seu `launch.json` esteja correto.",
			"Could not find a location for the variable": "Não foi possível encontrar um local para a variável",
			"Could not query the provided object": "Não foi possível consultar o objeto fornecido",
			"Could not read source map for {0}: {1}": "Não foi possível ler o source map para {0}: {1}",
			"Could not read {0}: {1}": "Não foi possível ler {0}: {1}",
			"Create AudioContext": "Criar AudioContext",
			"Create canvas context": "Criar contexto de tela",
			"Debug Anyway": "Depurar Assim Mesmo",
			"Debug URL": "Depurar URL",
			"Details": "Detalhes",
			"Don't show again": "Não mostrar novamente",
			"Duration": "Duração",
			"Duration of Profile": "Duração do Perfil",
			"Edit XHR Breakpoint": "Editar Ponto de Interrupção XHR",
			"Edit package.json": "Editar package.json",
			"Enables Node.js [auto attach]({0}) debugging in \"{1}\" mode/{Locked='[auto attach]({0})'}the 2nd placeholder is the setting value": "Habilita a depuração Node.js [auto attach]({0}) no modo \"{1}\"",
			"Enter a URL or a pattern to match": "Insira um URL ou um padrão para corresponder",
			"Eval": "Avaliar",
			"Frame could not be restarted": "Não foi possível reiniciar o quadro",
			"Generates a .cpuprofile file you can open in VS Code or the Edge/Chrome devtools": "Gera um arquivo .cpuprofile que você pode abrir no VS Code ou nos devtools do Edge/Chrome",
			"Generates a .heapprofile file you can open in VS Code or the Edge/Chrome devtools": "Gera um arquivo .heapprofile que você pode abrir no VS Code ou nos devtools do Edge/Chrome",
			"Generates a .heapsnapshot file you can open in VS Code or the Edge/Chrome devtools": "Gera um arquivo .heapsnapshot que você pode abrir no VS Code ou nas ferramentas de desenvolvimento do Edge/Chrome",
			"Global": "Global",
			"Globals": "Globais",
			"Got it!": "Entendido!",
			"Heap Profile": "Perfil de Heap",
			"Heap Snapshot": "Instantâneo de Heap",
			"How long to run the profile": "Por quanto tempo executar o perfil",
			"Ignore": "Ignorar",
			"Installation complete! The extension will be used after you restart your debug session.": "Instalação concluída! A extensão será usada depois que você reiniciar a sessão de depuração.",
			"Installing the DWARF debugger...": "Instalando o depurador DWARF...",
			"Invalid expression": "Expressão inválida",
			"Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "Condição de hit \"{0}\" inválida. Esperada uma expressão como \"> 42\" ou \"= = 2\".",
			"It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Parece que um navegador já está sendo executado de {0}. Feche-o antes de tentar depurar, caso contrário o VS Code talvez não conseguirá se conectar a ele.",
			"It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Parece que sua sessão de depuração já terminou. Tente depurar novamente e, em seguida, execute o comando \"Depurar: Diagnosticar Problemas de Ponto de Interrupção\".",
			"It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "Está demorando um pouco para configurar seus pontos de interrupção. Você pode acelerar isso atualizando os 'outFiles' em seu launch.json.",
			"JavaScript Debug Terminal": "Terminal de Depuração de JavaScript",
			"JavaScript debug adapter": "Adaptador de depuração do JavaScript",
			"Launch Chrome against localhost": "Iniciar o Chrome em relação a localhost",
			"Launch Edge against localhost": "Iniciar o Edge em relação a localhost",
			"Launch Program": "Iniciar o Programa",
			"Launch configuration created based on 'package.json'.": "Configuração de inicialização criada com base em 'package.json'.",
			"Launch configuration for '{0}' project created.": "A configuração de inicialização para o projeto do '{0}' foi criada.",
			"Local": "Local",
			"Locals": "Locais",
			"Lost connection to debugee, reconnecting in {0}ms\r\n": "Conexão com o depurador perdida, reconectando-se em {0}ms\r\n",
			"Manual": "Manual",
			"Module": "Módulo",
			"Networking not available.": "Rede não disponível.",
			"Never": "Nunca",
			"No": "Não",
			"No npm scripts found in the workspace folder.": "Nenhum script do npm encontrado na pasta do workspace.",
			"No npm scripts found in your package.json": "Nenhum script npm encontrado no seu package.json",
			"No package.json files found in your workspace.": "Nenhum arquivo package.json encontrado em seu espaço de trabalho.",
			"No workspace folder open.": "Nenhuma pasta de espaço de trabalho aberta.",
			"Node Attributes": "Atributos do Nó",
			"Node.js version '{0}' not installed using version manager {1}.": "Versão '{0}' do Node.js não instalada usando o gerenciador de versões {1}.",
			"Not Now": "Agora Não",
			"Only objects can be queried": "Somente objetos podem ser consultados",
			"Open launch.json": "Abrir launch.json",
			"Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "A saída foi truncada para os primeiros {0} caracteres. Execute '{1}' para copiar a saída completa.",
			"Parameters": "Parâmetros",
			"Paused": "Em pausa",
			"Paused before Out Of Memory exception": "Em pausa antes da exceção de Memória Insuficiente",
			"Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "Em pausa no ponto de interrupção de instrumentação de violação da Política de Segurança de Conteúdo, diretiva \"{0}\"",
			"Paused on DOM breakpoint": "Em pausa no ponto de interrupção DOM",
			"Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "Em pausa no ponto de interrupção de instrumentação do Erro de WebGL, erro \"{0}\"",
			"Paused on XMLHttpRequest or fetch": "Em pausa em XMLHttpRequest ou fetch",
			"Paused on assert": "Em pausa em assert",
			"Paused on breakpoint": "Em pausa no ponto de interrupção",
			"Paused on debug() call": "Em pausa na chamada de debug()",
			"Paused on debugger statement": "Em pausa na instrução do depurador",
			"Paused on event listener": "Em pausa no ouvinte de eventos",
			"Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "Em pausa no ponto de interrupção \"{0}\" do ouvinte de eventos, disparado em \"{1}\"",
			"Paused on exception": "Em pausa na exceção",
			"Paused on frame entry": "Em pausa na entrada do quadro",
			"Paused on instrumentation breakpoint": "Em pausa no ponto de interrupção de instrumentação",
			"Paused on instrumentation breakpoint \"{0}\"": "Em pausa no ponto de interrupção de instrumentação \"{0}\"",
			"Paused on {0}": "Pausado em {0}",
			"Pick Breakpoint": "Selecionar Ponto de Interrupção",
			"Pick the node.js process to attach to": "Selecionar o processo do node.js ao qual anexar",
			"Please enter a number": "Insira um número",
			"Please enter a number greater than 1": "Insira um valor maior que 1",
			"Please stop the running profile before starting a new one.": "Pare o perfil em execução antes de iniciar um novo.",
			"Process picker failed ({0})": "Falha no seletor de processos ({0})",
			"Profile duration in seconds, e.g \"5\"": "Duração do perfil em segundos, por exemplo, \"5\"",
			"Profiling": "Criação de perfil",
			"Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "A criação de perfil com pontos de interrupção habilitados pode alterar o desempenho do código. Pode ser útil validar suas descobertas com as condições de término \"duration\" ou \"manual\".",
			"Read More": "Saiba Mais",
			"Request Animation Frame": "Solicitar Quadro de Animação",
			"Resume AudioContext": "Retomar AudioContext",
			"Return value": "Valor retornado",
			"Run Current File": "Executar Arquivo Atual",
			"Run Node.js tool": "Executar a ferramenta Node.js",
			"Run Script: {0}": "Executar Script: {0}",
			"Run for a specific amount of time": "Executar por um período de tempo específico",
			"Run until a specific breakpoint is hit": "Executar até que um ponto de interrupção específico seja atingido",
			"Run until manually stopped": "Executar até ser parado manualmente",
			"Runs a Node.js command-line installed in the workspace node_modules.": "Executa uma linha de comando Node.js instalada nos node_modules do workspace.",
			"Saving": "Salvando",
			"Script": "Script",
			"Script Blocked by Content Security Policy": "Script Bloqueado pela Política de Segurança de Conteúdo",
			"Script First Statement": "Primeira Instrução do Script",
			"Select a tab": "Selecionar uma guia",
			"Select a tool to run": "Selecionar uma ferramenta a ser executada",
			"Select current working directory for new terminal": "Selecionar diretório de trabalho atual para o novo terminal",
			"Select test configuration to run": "Selecione a configuração de teste a ser executada",
			"Select the page where you want to open the devtools": "Selecione a página onde você deseja abrir as ferramentas devtools",
			"Select the session you want to inspect:": "Selecione a sessão que você deseja inspecionar:",
			"Seller Reporting Phase Start": "Início da Fase de Relatório do Vendedor",
			"Seller Scoring Phase Start": "Início da Fase de Pontuação do Vendedor",
			"Set innerHTML": "Definir innerHTML",
			"Skipped by skipFiles": "Ignorado por skipFiles",
			"Skipped by smartStep": "Ignorado por smartStep",
			"Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Alguns pontos de interrupção podem não funcionar na sua versão do Node.js. Recomendamos a atualização para as últimas correções de bug, desempenho e segurança. Detalhes: https://aka.ms/AAcsvqm",
			"Source not a source map": "A origem não é uma source map",
			"Source not found": "Origem não encontrada",
			"Stack frame not found": "Registro de ativação não encontrado",
			"Starting profile...": "Iniciando o perfil...",
			"Stopping profile...": "Interrompendo o perfil...",
			"Suspend AudioContext": "Suspender AudioContext",
			"Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Erro de sintaxe ao definir o ponto de interrupção com a condição {0} na linha {1}: {2}",
			"Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "Página de destino não encontrada. Talvez seja necessário atualizar seu \"urlFilter\" para corresponder à página que você deseja depurar.",
			"The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "A versão do Node em \"{0}\" está desatualizada (versão {1}), exigimos pelo menos o Node 8.x.",
			"The URL provided is invalid": "A URL fornecida é inválida",
			"The browser process exited with code {0} before connecting to the debug server. Make sure the `runtimeExecutable` is configured correctly and that it can run without errors.": "O processo do navegador foi encerrado com código {0} antes de se conectar ao servidor de depuração. Certifique-se de que o `runtimeExecutable` esteja configurado corretamente e que possa ser executado sem erros.",
			"The configured `cwd` {0} does not exist.": "O 'cwd' configurado {0} não existe.",
			"The configured `cwd` {0} is not a folder.": "O `cwd` configurado {0} não é uma pasta.",
			"This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Este é um caminho de arquivo ausente referenciado por um sourcemap. Nesse caso, deseja depurar a versão compilada?",
			"Thread is not paused": "O thread não está em pausa",
			"Thread is not paused on exception": "O thread não está em pausa na exceção",
			"Thread not found": "Thread não encontrado",
			"Type of profile": "Tipo de perfil",
			"URL contains \"{0}\"": "O URL contém \"{0}\"",
			"UWP webview debugging is not available on your platform.": "A depuração de visualização da web UWP não está disponível em sua plataforma.",
			"Unable to attach to browser": "Não é possível anexar ao navegador",
			"Unable to evaluate": "Não é possível avaliar",
			"Unable to evaluate on async stack frame": "Não é possível avaliar o registro de ativação assíncrono",
			"Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "Não é possível localizar uma instalação do navegador no sistema. Tente instalá-lo ou forneça um caminho absoluto para o navegador em \"runtimeExecutable\" em seu launch.json.",
			"Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "Não é possível localizar o {0} versão {1}. As versões descobertas automaticamente disponíveis são: {2}. É possível definir o \"runtimeExecutable\" em seu launch.json para uma dessas versões ou fornecer um caminho absoluto para o executável do navegador.",
			"Unable to launch browser: \"{0}\"": "Não é possível iniciar o navegador: \"{0}\"",
			"Unable to pause": "Não é possível pausar",
			"Unable to pretty print": "Não é possível imprimir reformatação",
			"Unable to resume": "Não é possível retomar",
			"Unable to retrieve source content": "Não é possível recuperar conteúdo de origem",
			"Unable to set variable value": "Não é possível definir o valor da variável",
			"Unable to step in": "Não é possível executar depuração total",
			"Unable to step next": "Não é possível entrar em seguida",
			"Unable to step out": "Não é possível executar depuração circular",
			"Unbound breakpoint": "Ponto de interrupção não associado",
			"Uncaught Exceptions": "Exceções Não Capturadas",
			"Unknown error": "Erro desconhecido",
			"VS Code can provide better debugging experience for WebAssembly via \"DWARF Debugging\" extension. Would you like to install it?/\"DWARF Debugging\" is the extension name and should not be localized.": "O VS Code pode fornecer uma melhor experiência de depuração para WebAssembly através da extensão \"DWARF Debugging\". Gostaria de instalá-lo?",
			"Variable not found": "Variável não encontrada",
			"Variables not available in async stacks": "Variáveis não disponíveis em pilhas assíncronas",
			"WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "AVISO: o processamento dos sourcemaps de {0} levou mais de {1} ms, portanto, continuamos a execução sem aguardar que todos os pontos de interrupção do script sejam definidos.",
			"We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "Não é possível iniciar um navegador no modo de depuração aqui. Se você quiser depurar esta página da Web, abra este workspace no VS Code em sua área de trabalho.",
			"We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "Não é possível iniciar um navegador no modo de depuração aqui. Abra este workspace no VS Code em sua área de trabalho para habilitar a depuração.",
			"WebGL Error Fired": "Erro de WebGL Acionado",
			"WebGL Warning Fired": "Aviso de WebGL Acionado",
			"With Block": "Bloco Com",
			"Would you like to save a configuration in your launch.json for easy access later?": "Deseja salvar uma configuração no launch.json para obter acesso fácil posteriormente?",
			"XHR/Fetch URLs": "URLs XHR/Fetch",
			"Yes": "Sim",
			"You may install the `{}` module via npm for enhanced WebAssembly debugging": "Você pode instalar o módulo '{}' via npm para depuração aprimorada do WebAssembly",
			"You need to open a workspace folder to debug npm scripts.": "Você precisa abrir uma pasta da área de trabalho para depurar scripts npm.",
			"You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Você está executando uma versão desatualizada do Node.js. Recomendamos a atualização para obter as correções de últimos bugs, desempenho e segurança mais recentes.",
			"an old debug session": "uma sessão de depuração antiga",
			"breakpoint.provisionalBreakpoint": "breakpoint.provisionalBreakpoint",
			"path does not exist": "o caminho não existe",
			"process id: {0} ({1})": "id do processo: {0} ({1})",
			"process id: {0}, debug port: {1} ({2})": "id do processo: {0}, porta de depuração: {1} ({2})",
			"setInterval fired": "setInterval acionado",
			"setTimeout fired": "setTimeout acionado",
			"the configured userDataDir": "o userDataDir configurado",
			"{0} (couldn't describe: {1})": "{0} (não foi possível descrever: {1})",
			"{0} Click to Stop Profiling": "{0} Clique para Criação de Perfil",
			"{0} Click to Stop Profiling ({1} sessions)": "{0} Clique para Interromper a Criação de Perfil ({1} sessões)",
			"{0} Click to Stop Profiling ({1})": "{0} Clique para Interromper a Criação de Perfil ({1})"
		}
	}
}