{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref '{0}' en '{1}' no se puede resolver.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Valor predeterminado. Usado por sugerencias.",
			"A descriptive title of the schema.": "Título descriptivo del esquema.",
			"A long description of the schema. Used in hover menus and suggestions.": "Descripción larga del esquema. Se usa en menús y sugerencias al mantener el puntero.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Asignación de nombres de propiedad a una matriz de nombres de propiedad o a un esquema. Una matriz de nombres de propiedad significa que la propiedad denominada en la clave depende de las propiedades de la matriz presentes en el objeto para que sean válidas. Si el valor es un esquema, el esquema solo se aplica al objeto si la propiedad de la clave existe en el objeto.",
			"A map of property names to schemas for each property.": "Asignación de nombres de propiedad a esquemas para cada propiedad.",
			"A map of regular expressions on property names to schemas for matching properties.": "Asignación de expresiones regulares en nombres de propiedad a esquemas para propiedades coincidentes.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Número que debería dividir limpiamente el valor actual (es decir, que no quede resto).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Expresión regular con la que hacer coincidir la cadena. No está delimitado implícitamente.",
			"A schema which must not match.": "El esquema que no debe coincidir.",
			"A unique identifier for the schema.": "Identificador único del esquema.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Una instancia de matriz es válida para \"contains\" si al menos uno de sus elementos es válido con el esquema especificado.",
			"An array of schemas, all of which must match.": "Matriz de esquemas, todos los cuales deberán coincidir.",
			"An array of schemas, exactly one of which must match.": "Una matriz de esquemas, exactamente una de las cuales debe coincidir.",
			"An array of schemas, where at least one must match.": "Una matriz de esquemas, donde al menos uno deberá coincidir.",
			"An array of strings that lists the names of all properties required on this object.": "Matriz de cadenas que enumera los nombres de todas las propiedades necesarias en este objeto.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Una instancia se valida correctamente con esta palabra clave si su valor es igual al valor de la palabra clave.",
			"Array does not contain required item.": "La matriz no contiene el elemento necesario.",
			"Array has duplicate items.": "La matriz tiene elementos duplicados.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "La matriz tiene muy pocos elementos que coinciden con el limitador de contenido. Se esperaba {0} o más.",
			"Array has too few items. Expected {0} or more.": "La matriz tiene muy pocos elementos. Se esperaban {0} o más.",
			"Array has too many items according to schema. Expected {0} or fewer.": "La matriz tiene demasiados elementos según el esquema. Se esperaba {0} o menos.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "La matriz tiene demasiados elementos que coinciden con el limitador de contenido. Se esperaba {0} o menos.",
			"Array has too many items. Expected {0} or fewer.": "La matriz tiene demasiados elementos. Se esperaban {0} o menos.",
			"Colon expected": "Se esperaban dos puntos",
			"Comments are not permitted in JSON.": "No se permiten comentarios en JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Comentarios de los autores del esquema a los lectores o mantenedores del esquema.",
			"Configure": "Configurar",
			"Configured by extension: {0}": "Configurado por extensión: {0}",
			"Configured in user settings": "Configurado en la configuración de usuario",
			"Configured in workspace settings": "Configurado en la configuración del área de trabajo",
			"Default value": "Valor predeterminado",
			"Describes the content encoding of a string property.": "Describe la codificación de contenido de una propiedad de cadena.",
			"Describes the format expected for the value. By default, not used for validation": "Describe el formato esperado para el valor. De forma predeterminada, no se usa para la validación",
			"Describes the media type of a string property.": "Describe el tipo de medio de una propiedad de cadena.",
			"Downloading schemas is disabled through setting '{0}'": "La descarga de esquemas está deshabilitada mediante el valor \"{0}\"",
			"Downloading schemas is disabled. Click to configure.": "La descarga de esquemas está deshabilitada. Haga clic para configurar.",
			"Draft-03 schemas are not supported.": "No se admiten esquemas borrador-03.",
			"Duplicate anchor declaration: '{0}'": "Declaración de delimitador duplicada: '{0}'",
			"Duplicate object key": "Clave de objeto duplicada",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Esquema o booleano. Si es un esquema, se usa para validar todas las propiedades que no coincidan con \"properties\", \"propertyNames\" o \"patternProperties\". Si es false, cualquier propiedad no definida por las palabras clave adyacentes provocará un error en este esquema.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Cadena de uno de los tipos de esquema básicos (número, entero, null, matriz, objeto, booleano, cadena) o una matriz de cadenas que especifica un subconjunto de esos tipos.",
			"End of file expected.": "Se esperaba el final del archivo.",
			"Expected a JSON object, array or literal.": "Se esperaba un objeto JSON, una matriz o un literal.",
			"Expected comma": "Se esperaba una coma",
			"Expected comma or closing brace": "Se esperaba una coma o un corchete de cierre",
			"Expected comma or closing bracket": "Se esperaba una coma o un corchete de cierre",
			"Failed to sort the JSONC document, please consider opening an issue.": "No se pudo ordenar el documento JSONC. Considere la posibilidad de abrir una incidencia.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Para matrices, solo cuando los elementos se establezcan como una matriz. Si los elementos son un esquema, este esquema valida los elementos después de los especificados por el esquema de elementos. Si es false, los elementos adicionales provocarán un error en la validación.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Para matrices. Puede ser un esquema con el que validar cada elemento o una matriz de esquemas para validar cada elemento en orden (el primer esquema validará el primer elemento, el segundo esquema validará el segundo elemento, y así sucesivamente.",
			"If all of the items in the array must be unique. Defaults to false.": "Si todos los elementos de la matriz deben ser únicos. El valor predeterminado es false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Si la instancia es un objeto, esta palabra clave valida si todos los nombres de propiedad de la instancia se validan con el esquema proporcionado.",
			"Incorrect type. Expected \"{0}\".": "Tipo incorrecto. Se esperaba \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Tipo incorrecto. Se esperaba uno de {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Indica que el valor de la instancia está administrado exclusivamente por la autoridad propietaria.",
			"Invalid characters in string. Control characters must be escaped.": "Caracteres no válidos en la cadena. Los caracteres de control deberán tener caracteres de escape.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Formato de color no válido. Use #RGB, #RGBA, #RRGGBB o #RRGGBBAA.",
			"Invalid escape character in string.": "Carácter de escape no válido en la cadena.",
			"Invalid number format.": "Formato numérico no válido.",
			"Invalid unicode sequence in string.": "Secuencia Unicode no válida en la cadena.",
			"Item does not match any validation rule from the array.": "El elemento no coincide con ninguna regla de validación de la matriz.",
			"JSON Language Server": "Servidor de lenguaje JSON",
			"JSON Outline Status": "Estado del esquema JSON",
			"JSON Validation Status": "Estado de validación JSON",
			"JSON schema cache cleared.": "Borrada la caché de esquema JSON.",
			"JSON schema configured": "Esquema JSON configurado",
			"JSON: Schema Resolution Error": "JSON: Error de resolución de esquemas",
			"Learn more about JSON schema configuration...": "Más información sobre la configuración del esquema JSON...",
			"Loading JSON info": "Cargando información JSON",
			"Makes the maximum property exclusive.": "Hace exclusiva la propiedad máxima.",
			"Makes the minimum property exclusive.": "Hace que la propiedad mínima sea exclusiva.",
			"Matches a schema that is not allowed.": "Coincide con un esquema no permitido.",
			"Matches multiple schemas when only one must validate.": "Coincide con varios esquemas cuando solo se debe validar uno.",
			"Missing property \"{0}\".": "Falta la propiedad \"{0}\".",
			"New array": "Nueva matriz",
			"New object": "Nuevo objeto",
			"No schema configured for this file": "No hay ningún esquema configurado para este archivo",
			"No schema validation": "Sin validación de esquema",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "No se usa para la validación. Coloque aquí los subesquemas a los que desee hacer referencia alineada con $ref.",
			"Object has fewer properties than the required number of {0}": "El objeto tiene menos propiedades que el número requerido de {0}",
			"Object has more properties than limit of {0}.": "El objeto tiene más propiedades que el límite de {0}.",
			"Object is missing property {0} required by property {1}.": "Al objeto le falta la propiedad {0} requerida por la propiedad {1}.",
			"Open Extension": "Abrir la extensión",
			"Open Settings": "Abrir configuración",
			"Outline": "Esquema",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problema al leer el contenido de '{0}': UTF-8 con BOM detectado, solo se permite UTF 8.",
			"Problems loading reference '{0}': {1}": "Problemas al cargar la referencia '{0}': {1}",
			"Property expected": "Propiedad esperada",
			"Property keys must be doublequoted": "Las claves de propiedad deberán tener comillas dobles",
			"Property {0} is not allowed.": "No se permite la propiedad {0}.",
			"Reference a definition hosted on any location.": "Referenciar a una definición hospedada en cualquier ubicación.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Valores JSON de ejemplo asociados a un esquema concreto con el fin de ilustrar el uso.",
			"Schema not found: {0}": "Esquema no encontrado: {0}",
			"Schema validated": "Esquema validado",
			"Select the schema to use for {0}": "Seleccione el esquema que se vaya a usar para {0}",
			"Show Schemas": "Mostrar esquemas",
			"Sort JSON": "Ordenar JSON",
			"String does not match the pattern of \"{0}\".": "La cadena no coincide con el patrón de \"{0}\".",
			"String is longer than the maximum length of {0}.": "La cadena es mayor que la longitud máxima de {0}.",
			"String is not a RFC3339 date-time.": "La cadena no es una fecha y hora RFC3339.",
			"String is not a RFC3339 date.": "La cadena no es una fecha RFC3339.",
			"String is not a RFC3339 time.": "La cadena no es una hora RFC3339.",
			"String is not a URI: {0}": "La cadena no es una URI: {0}",
			"String is not a hostname.": "La cadena no es un nombre de host.",
			"String is not an IPv4 address.": "La cadena no es una dirección IPv4.",
			"String is not an IPv6 address.": "La cadena no es una dirección IPv6.",
			"String is not an e-mail address.": "La cadena no es una dirección de correo electrónico.",
			"String is shorter than the minimum length of {0}.": "La cadena es más corta que la longitud mínima de {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "El subesquema \"else\" se usa para la validación cuando el subesquema \"if\" no tiene éxito.",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "El subesquema \"then\" se usa para la validación cuando el subesquema \"if\" tiene éxito.",
			"The maximum length of a string.": "La longitud máxima de una cadena.",
			"The maximum number of items that can be inside an array. Inclusive.": "Número máximo de elementos que pueden estar dentro de una matriz. Inclusivo.",
			"The maximum number of properties an object can have. Inclusive.": "Número máximo de propiedades que puede tener un objeto. Inclusivo.",
			"The maximum numerical value, inclusive by default.": "Valor numérico máximo, inclusivo de forma predeterminada.",
			"The minimum length of a string.": "Longitud mínima de una cadena.",
			"The minimum number of items that can be inside an array. Inclusive.": "Número mínimo de elementos que pueden estar dentro de una matriz. Inclusivo.",
			"The minimum number of properties an object can have. Inclusive.": "Número mínimo de propiedades que puede tener un objeto. Inclusivo.",
			"The minimum numerical value, inclusive by default.": "Valor numérico mínimo, inclusivo de forma predeterminada.",
			"The schema to verify this document against.": "Esquema con el que se va a comprobar este documento.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "El esquema usa características de metaesquema ({0}) que aún no son compatibles con el validador.",
			"The set of literal values that are valid.": "Conjunto de valores literales que son válidos.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "El resultado de la validación del subesquema \"if\" controlará qué palabras clave \"then\" o \"else\" se evalúan.",
			"Trailing comma": "Coma final",
			"URI expected.": "Se esperaba el URI.",
			"URI is expected.": "Se espera el URI.",
			"URI with a scheme is expected.": "Se espera el URI con un esquema.",
			"Unable to compute used schemas: No document": "No se pueden calcular los esquemas usados: no hay documentos",
			"Unable to compute used schemas: {0}": "No se pueden calcular los esquemas usados: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "No se puede cargar el esquema desde \"{0}\" No hay ningún servicio de solicitud de esquema disponible",
			"Unable to load schema from '{0}': No content.": "No se puede cargar el esquema desde '{0}': sin contenido.",
			"Unable to load schema from '{0}': {1}.": "No se puede cargar el esquema desde '{0}': {1}.",
			"Unable to load {0}": "No se puede cargar {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "No se puede analizar el contenido de '{0}': error de análisis en el desplazamiento {1}.",
			"Unable to resolve schema. Click to retry.": "No se puede resolver el esquema. Haga clic para volver a intentarlo.",
			"Unexpected end of comment.": "Final de comentario inesperado.",
			"Unexpected end of number.": "Fin de número inesperado.",
			"Unexpected end of string.": "Final de cadena inesperado.",
			"Value expected": "Se esperaba un valor",
			"Value is above the exclusive maximum of {0}.": "El valor está por encima del máximo exclusivo de {0}.",
			"Value is above the maximum of {0}.": "El valor está por encima del máximo de {0}.",
			"Value is below the exclusive minimum of {0}.": "El valor está por debajo del mínimo exclusivo de {0}.",
			"Value is below the minimum of {0}.": "El valor es inferior al mínimo de {0}.",
			"Value is deprecated": "El valor está en desuso",
			"Value is not accepted. Valid values: {0}.": "No se acepta el valor. Valores válidos: {0}.",
			"Value is not divisible by {0}.": "El valor no es divisible por {0}.",
			"Value must be {0}.": "El valor deberá ser {0}.",
			"multiple JSON schemas configured": "se configuraron varios esquemas JSON",
			"no JSON schema configured": "no hay ningún esquema JSON configurado",
			"only {0} document symbols shown for performance reasons": "solo se muestran {0} símbolos del documento por motivos de rendimiento",
			"{0} is a directory, not a file": "{0} es un directorio, no un archivo"
		},
		"package": {
			"description": "Proporciona un potente soporte de lenguaje para archivos JSON.",
			"displayName": "Características del lenguaje JSON",
			"json.clickToRetry": "Haga clic para volver a intentarlo.",
			"json.colorDecorators.enable.deprecationMessage": "El valor \"json.colorDecorators.enable\" está en desuso en favor de \"editor.colorDecorators\".",
			"json.colorDecorators.enable.desc": "Habilita o deshabilita decoradores de color",
			"json.command.clearCache": "Borrar caché de esquema",
			"json.command.sort": "Ordenar documento",
			"json.enableSchemaDownload.desc": "Cuando está habilitado, los esquemas JSON se pueden capturar desde ubicaciones http y https.",
			"json.format.enable.desc": "Habilitar o deshabilitar el formateador JSON predeterminado",
			"json.format.keepLines.desc": "Conservar todas las líneas nuevas existentes al formatear.",
			"json.maxItemsComputed.desc": "El número máximo de símbolos del esquema y regiones de plegado calculados (limitado por motivos de rendimiento).",
			"json.maxItemsExceededInformation.desc": "Muestra una notificación cuando se supera el número máximo de símbolos de esquema y de regiones plegables.",
			"json.schemaResolutionErrorMessage": "No se puede resolver el esquema.",
			"json.schemas.desc": "Asocia esquemas a archivos JSON en el proyecto actual.",
			"json.schemas.fileMatch.desc": "Una matriz de patrones de archivo con los que buscar correspondencia al resolver archivos JSON en esquemas, \"*\" y \"**\" puede usarse como comodín. Los patrones de exclusión también se pueden definir y comenzar con \"!\". Un archivo coincide cuando hay al menos un patrón coincidente y el último patrón coincidente no es un patrón de exclusión.",
			"json.schemas.fileMatch.item.desc": "Un patrón de archivo que puede contener \"*\" y \"**\" con el cual coincidir cuando los archivos JSON se resuelvan en esquemas. Cuando comienza con \"!\", define un patrón de exclusión.",
			"json.schemas.schema.desc": "La definición de esquema de la dirección URL determinada. Solo se necesita proporcionar el esquema para evitar los accesos a la dirección URL del esquema.",
			"json.schemas.url.desc": "Dirección URL o ruta de acceso de archivo absoluta a un esquema. Puede ser una ruta de acceso relativa (a partir de './') en la configuración del área de trabajo y de la carpeta del área de trabajo.",
			"json.tracing.desc": "Realiza el seguimiento de la comunicación entre VS Code y el servidor de lenguaje JSON.",
			"json.validate.enable.desc": "Habilita o deshabilita la validación json."
		}
	}
}