{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Beispiel",
			"Files by Extension": "Dateien nach Erweiterung",
			"Files with Extension": "Dateien mit Erweiterung",
			"Files with Multiple Extensions": "Dateien mit mehreren Erweiterungen",
			"Files with Path": "Dateien mit Pfad",
			"Files with Siblings by Name": "Dateien mit gleichgeordneten Elementen nach Name",
			"Folder by Name (Any Location)": "Ordner nach Name (beliebiger Speicherort)",
			"Folder by Name (Top Level)": "Ordner nach Name (oberste Ebene)",
			"Folders with Multiple Names (Top Level)": "Ordner mit mehreren Namen (oberste Ebene)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Ordnet alle Dateien, die mit dem absoluten Pfad des Globmusters in ihrem Pfad übereinstimmen, der Sprache mit dem angegebenen Bezeichner zu.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Ordnet alle Dateien, deren Dateinamen mit dem Globmuster übereinstimmen, der Sprache mit dem angegebenen Bezeichner zu.",
			"Match a folder with a specific name in any location.": "Zuordnen eines Ordners mit einem bestimmten Namen an einem beliebigen Speicherort.",
			"Match a top level folder with a specific name.": "Ordnet einen Ordner auf oberster Ebene einem bestimmten Namen zu.",
			"Match all files of a specific file extension.": "Ordnet alle Dateien mit einer bestimmten Erweiterung zu.",
			"Match all files with any of the file extensions.": "Ordnet alle Dateien mit einer der Dateierweiterungen zu.",
			"Match files that have siblings with the same name but a different extension.": "Ordnet Dateien zu, die gleichgeordnete Elemente mit dem gleichen Namen und einer anderen Erweiterung besitzen.",
			"Match multiple top level folders.": "Ordnet mehrere Ordner auf oberster Ebene zu.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Das Zeichen, das vom Betriebssystem zum Trennen von Komponenten in Dateipfaden verwendet wird. Wird auch mit einem Alias auf \"/\" bezeichnet.",
			"The current opened file": "Die aktuell geöffnete Datei",
			"The current opened file relative to ${workspaceFolder}": "Die aktuelle geöffnete Datei bezogen auf ${WorkspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Der aktuell geöffnete Ordnername des Dateiarbeitsbereichs ohne Schrägstriche (/)",
			"The current opened file's basename": "Der Basisname der aktuellen geöffneten Datei",
			"The current opened file's basename with no file extension": "Der Basisname der aktuellen geöffneten Datei ohne Erweiterung",
			"The current opened file's dirname": "Der Verzeichnisname der aktuellen geöffneten Datei",
			"The current opened file's dirname relative to ${workspaceFolder}": "Der DirName-Wert der aktuell geöffneten Datei relativ zu \"${workspaceFolder}\"",
			"The current opened file's extension": "Die Erweiterung der aktuellen geöffneten Datei",
			"The current selected line number in the active file": "Die aktuelle ausgewählte Zeilennummer in der aktiven Datei",
			"The current selected text in the active file": "Der aktuelle ausgewählte Text in der aktiven Datei",
			"The file extension of the editor (e.g. txt)": "Die Dateierweiterung des Editors (z. B. txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Der Dateiname des Editors ohne Verzeichnis oder Erweiterung (z. B. myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Der Name des Standardbuildtasks. Wenn es keinen Standardbuildtask gibt, wird eine Schnellauswahl angezeigt, um den Buildtask auszuwählen.",
			"The name of the folder opened in VS Code without any slashes (/)": "Name des in VS Code geöffneten Ordners ohne Schrägstriche (/)",
			"The nth parent folder name of the editor": "Der Name des übergeordneten Ordners des Editors",
			"The parent folder name of the editor (e.g. myFileFolder)": "Der Name des übergeordneten Ordners des Editors (z. B. myFileFolder)",
			"The path of the folder opened in VS Code": "Pfad des in VS Code geöffneten Ordners",
			"The path where an extension is installed.": "Der Pfad, in dem eine Erweiterung installiert ist.",
			"The task runner's current working directory on startup": "Das aktuelle Arbeitsverzeichnis der Aufgabenausführung beim Start",
			"Use the language of the currently active text editor if any": "Falls möglich, verwenden Sie die Sprache des aktuell aktiven Text-Editors.",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "Ein bedingtes Trennzeichen (' - '), das nur in der Umgebung von Variablen mit Werten angezeigt wird",
			"an indicator for when the active editor has unsaved changes": "ein Indikator für den Fall, dass der aktive Editor nicht gespeicherte Änderungen aufweist",
			"e.g. SSH": "z.B. SSH",
			"e.g. VS Code": "z. B. VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "Dateipfad des Arbeitsbereichs (z.B. /Benutzer/Entwicklung/meinArbeitsbereich)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "Dateipfad des Arbeitsbereichsordners, der die Datei enthält (z.B. /Benutzer/Entwicklung/MeinOrdner)",
			"gist": "Gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "Name des Arbeitsbereichsordners, der die Datei enthält (z.B. MeinOrdner)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "Name des Arbeitsbereichs mit optionalem Remote-Namen und Arbeitsbereichs-Indikator, falls vorhanden, (z. B. „myFolder“, „myRemoteFolder“ [SSH] oder „myWorkspace“ [Workspace]).",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "Gekürzter Name des Arbeitsbereichs ohne Suffixe (z. B. „myFolder“ oder „myWorkspace“)",
			"the file name (e.g. myFile.txt)": "Der Dateiname (z.B. meineDatei.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "der vollständige Pfad der Datei (z.B. /Benutzer/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "der vollständige Pfad des Ordners, der die Datei enthält (z.B. /Benutzer/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "der Name des aktiven Branches im aktiven Repository (z. B. „main“)",
			"the name of the active repository (e.g. vscode)": "der Name des aktiven Repositorys (z. B. „vscode“)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "der Name des Ordners, der die Datei enthält (z.B. MyFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "der Pfad der Datei relativ zum Arbeitsbereichsordner (z.B. myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "der Pfad des Ordners, der die Datei enthält, relativ zum Arbeitsbereichsordner (z.B. myfolder/MyFileFolder)"
		},
		"package": {
			"description": "Stellt Funktionen (erweitertes IntelliSense, automatische Korrektur) in Konfigurationsdateien wie Einstellungs-, Start- und Erweiterungsempfehlungsdateien bereit.",
			"displayName": "Konfigurationsänderung"
		}
	}
}