{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "„store“ i.e. Speichern eines booleschen Tests für die spätere Auswertung in einem Wächter oder if().",
			"'from' expected": "„from2 erwartet",
			"'in' expected": "„in“ erwartet",
			"'through' or 'to' expected": "„through“ oder „to“ erwartet",
			"'{0}'": "„{0}“",
			"( expected": "( erwartet",
			") expected": ") erwartet",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "Die „@font-face“-Regel muss die Eigenschaften „src“ und „font-family“ definieren.",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Eine Liste der Eigenschaften, die nicht auf Übereinstimmung mit der Regel \"unknownProperties\" überprüft werden.",
			"Adds quotes to a string.": "Fügt einer Zeichenfolge Anführungszeichen hinzu.",
			"Also define the standard property '{0}' for compatibility": "Definieren Sie außerdem die Standardeigenschaft „{0}“ aus Kompatibilitätsgründen",
			"Always define standard rule '@keyframes' when defining keyframes.": "Definieren Sie beim Definieren von Keyframes immer die Standardregel „@keyframes“.",
			"Always include all vendor specific properties: Missing: {0}": "Schließen Sie immer alle herstellerspezifischen Eigenschaften ein: Fehlt: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Schließen Sie immer alle herstellerspezifischen Regeln ein: Fehlt: {0}",
			"Appends a single value onto the end of a list.": "Fügt einen einzelnen Wert an das Ende einer Liste an.",
			"Appends selectors to one another without spaces in between.": "Fügt Selektoren ohne Leerzeichen dazwischen an.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Verwendung von „!important“ vermeiden. Damit wird angegeben, dass es mit der Spezifität des gesamten CSS-Codes Probleme gibt und eine Umgestaltung erforderlich ist.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Die Verwendung von „float“ vermeiden. „float“-Eigenschaften führen leicht dazu, dass CSS nicht mehr funktioniert, wenn sich ein Aspekt des Layouts ändert.",
			"Causes one or more rules to be emitted at the root of the document.": "Bewirkt, dass eine oder mehrere Regeln im Stammverzeichnis des Dokuments ausgegeben werden.",
			"Changes one or more properties of a color.": "Ändert eine oder mehrere Eigenschaften einer Farbe.",
			"Changes the alpha component for a color.": "Ändert die Alphakomponente für eine Farbe.",
			"Changes the hue of a color.": "Ändert den Farbton einer Farbe.",
			"Character entity representing '{0}'": "Zeichenentität, die „{0}“ darstellt",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Zeichenentität, die „{0}“ darstellt, Unicode-Entsprechung „{1}“",
			"Closing bracket expected.": "Eine schließende Klammer wurde erwartet.",
			"Closing bracket missing.": "Schließende Klammer fehlt.",
			"Combines several lists into a single multidimensional list.": "Kombiniert mehrere Listen zu einer einzelnen mehrdimensionalen Liste.",
			"Configure": "Konfigurieren",
			"Converts a color into the format understood by IE filters.": "Konvertiert eine Farbe in das Format, das von IE-Filtern verstanden wird.",
			"Converts a color to grayscale.": "Konvertiert eine Farbe in Graustufen.",
			"Converts a string to lower case.": "Konvertiert eine Zeichenfolge in Kleinbuchstaben.",
			"Converts a string to upper case.": "Konvertiert eine Zeichenfolge in Großbuchstaben.",
			"Converts a unitless number to a percentage.": "Konvertiert eine einheitslose Zahl in einen Prozentsatz.",
			"Creates a Color from hue, saturation, and lightness values.": "Erstellt eine Farbe aus Farbton-, Sättigungs- und Helligkeitswerten.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Erstellt eine Farbe aus Farbton-, Sättigungs-, Helligkeits- und Alphawerten.",
			"Creates a Color from hue, white, and black values.": "Erstellt eine Farbe aus den Farbton-, Weiß- und Schwarzwerten.",
			"Creates a Color from lightness, a, and b values.": "Erstellt eine Farbe aus Helligkeits-, a- und b-Werten.",
			"Creates a Color from lightness, chroma, and hue values.": "Erstellt eine Farbe aus den Helligkeits-, Füll- und Farbtonwerten.",
			"Creates a Color from red, green, and blue values.": "Erstellt eine Farbe aus roten, grünen und blauen Werten.",
			"Creates a Color from red, green, blue, and alpha values.": "Erstellt eine Farbe aus Rot-, Grün-, Blau- und Alphawerten.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Erstellt eine Farbe aus den Farbton-, Sättigungs- und Helligkeitswerten einer anderen Farbe.",
			"Creates a Color from the hue, white, and black values of another Color.": "Erstellt eine Farbe aus den Farbton-, Weiß- und Schwarzwerten einer anderen Farbe.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Erstellt eine Farbe aus den Helligkeits-, a- und b-Werten einer anderen Farbe.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Erstellt eine Farbe aus den Helligkeits-, Füll- und Farbtonwerten einer anderen Farbe.",
			"Creates a Color from the red, green, and blue values of another Color.": "Erstellt eine Farbe aus den Rot-, Grün- und Blauwerten einer anderen Farbe.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Erstellt eine Farbe in einem bestimmten Farbraum aus den Rot-, Grün- und Blauwerten.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Erstellt eine Farbe in einem bestimmten Farbraum aus den Rot-, Grün- und Blauwerten einer anderen Farbe.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Definiert komplexe Vorgänge, die in Stylesheets wiederverwendet werden können.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Definiert Formatvorlagen, die im gesamten Stylesheet mit „@include“ wiederverwendet werden können.",
			"Do not use duplicate style definitions": "Keine doppelten Formatdefinitionen verwenden",
			"Do not use empty rulesets": "Keine leeren Regelsätze verwenden",
			"Do not use width or height when using padding or border": "Verwenden Sie keine Breite oder Höhe, wenn Sie Innenabstand oder Rahmen verwenden",
			"Dynamically calls a Sass function.": "Ruft dynamisch eine Sass-Funktion auf.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Jede Schleife, die „$var“ auf jedes Element in der Liste oder Zuordnung festlegt, gibt dann die darin enthaltenen Formatvorlagen mit dem Wert „$var“ aus.",
			"End tag name expected.": "Endtagname erwartet.",
			"Exposes the details of Sass’s inner workings.": "Macht die Details der inneren Funktionsweise von Sass verfügbar.",
			"Extends $extendee with $extender within $selector.": "Erweitert $extendee mit $extender innerhalb $selector.",
			"Extracts a substring from $string.": "Extrahiert eine Teilzeichenfolge aus $string.",
			"Finds the maximum of several numbers.": "Sucht das Maximum mehrerer Zahlen.",
			"Finds the minimum of several numbers.": "Sucht das Minimum mehrerer Zahlen.",
			"Fluidly scales one or more properties of a color.": "Skaliert eine oder mehrere Eigenschaften einer Farbe dynamisch.",
			"Folding Region End": "Ende des Faltbereichs",
			"Folding Region Start": "Regionsanfang wird gefaltet",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "„For“-Schleife, die wiederholt einen Satz von Stilen für jedes „$var“ in der „from/through“- oder „from/to“-Klausel ausgibt.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Generiert neue Farben basierend auf vorhandenen, sodass Sie ganz einfach Farbdesigns erstellen können.",
			"Gets the blue component of a color.": "Ruft die blaue Komponente einer Farbe ab.",
			"Gets the green component of a color.": "Ruft die grüne Komponente einer Farbe ab.",
			"Gets the hue component of a color.": "Ruft die Farbtonkomponente einer Farbe ab.",
			"Gets the lightness component of a color.": "Ruft die Helligkeitskomponente einer Farbe ab.",
			"Gets the opacity component of a color.": "Ruft die Deckkraftkomponente einer Farbe ab.",
			"Gets the red component of a color.": "Ruft die rote Komponente einer Farbe ab.",
			"Gets the saturation component of a color.": "Ruft die Sättigungskomponente einer Farbe ab.",
			"HTML Language Server": "HTML-Sprachserver",
			"Hex colors must consist of three, four, six or eight hex numbers": "Hexadezimalfarben müssen aus drei, vier, sechs oder acht Hexadezimalzahlen bestehen.",
			"IE hacks are only necessary when supporting IE7 and older": "IE-Hacks sind nur für die Unterstützung von IE7 und niedriger erforderlich",
			"Import statements do not load in parallel": "Import-Anweisungen werden nicht parallel geladen",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Schließt den Text ein, wenn der Ausdruck nicht als „FALSE“ oder „NULL“ ausgewertet wird.",
			"Includes the styles defined by another mixin into the current rule.": "Schließt die von einer anderen Mixin definierten Stile in die aktuelle Regel ein.",
			"Increases or decreases one or more components of a color.": "Vergrößert oder verringert eine oder mehrere Komponenten einer Farbe.",
			"Inherits the styles of another selector.": "Erbt die Stile eines anderen Selektors.",
			"Inserts $insert into $string at $index.": "Fügt $insert bei $index in $string ein.",
			"Invalid number of parameters": "Ungültige Anzahl von Parametern",
			"Joins together two lists into one.": "Verknüpft zwei Listen zu einer.",
			"Lets you access and modify values in lists.": "Ermöglicht ihnen den Zugriff auf und das Ändern von Werten in Listen.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Lädt ein Sass-Stylesheet und macht dessen Mixins, Funktionen und Variablen verfügbar, wenn dieses Stylesheet mit der @use-Regel geladen wird.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Lädt Mixins, Funktionen und Variablen aus anderen Sass-Stylesheets als „Module“ und kombiniert CSS aus mehreren Stylesheets.",
			"Makes a color darker.": "Macht eine Farbe dunkler.",
			"Makes a color less saturated.": "Macht eine Farbe weniger gesättigt.",
			"Makes a color lighter.": "Macht eine Farbe heller.",
			"Makes a color more opaque.": "Macht eine Farbe opaker.",
			"Makes a color more saturated.": "Erhöht die Sättigung einer Farbe.",
			"Makes a color more transparent.": "Macht eine Farbe transparenter.",
			"Makes it easy to combine, search, or split apart strings.": "Erleichtert das Kombinieren, Suchen oder Aufteilen von Zeichenfolgen.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Ermöglicht das Nachschlagen des Werts, der einem Schlüssel in einer Karte zugeordnet ist, und vieles mehr.",
			"Merges two maps together into a new map.": "Führt zwei Zuordnungen zu einer neuen Karte zusammen.",
			"Mix two colors together in a polar color space.": "Mischen Sie zwei Farben in einem Polarfarbraum.",
			"Mix two colors together in a rectangular color space.": "Mischen Sie zwei Farben in einem rechteckigen Farbraum.",
			"Mixes two colors together.": "Kombiniert zwei Farben.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Verschachtelt Selektoren untereinander, wie sie im Stylesheet geschachtelt werden.",
			"No unit for zero needed": "Keine Einheit für Null erforderlich",
			"Parses a selector into the format returned by &.": "Analysiert einen Selektor in das von & zurückgegebene Format.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Gibt den Wert eines Ausdrucks in den Standardausgabestream für Fehler aus. Nützlich für das Debuggen komplizierter Sass-Dateien.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Gibt den Wert eines Ausdrucks in den Standardfehlerausgabestrom aus. Nützlich für Bibliotheken, die Benutzer vor Verwerfungen warnen müssen, oder um kleinere Fehler bei der Verwendung von Mixins zu beheben. Warnungen können mit der Kommandozeilenoption „--quiet“ oder der Sass-Option „:quiet“ ausgeschaltet werden.",
			"Property is ignored due to the display.": "Die Eigenschaft wird aufgrund der Anzeige ignoriert.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Die Eigenschaft wird aufgrund der Anzeige ignoriert. Bei „display: block“ sollte die vertikale Ausrichtung nicht verwendet werden.",
			"Provides access to Sass’s powerful selector engine.": "Bietet Zugriff auf die leistungsstarke Selektor-Engine von Sass.",
			"Provides functions that operate on numbers.": "Stellt Funktionen bereit, die mit Zahlen arbeiten.",
			"Removes quotes from a string.": "Entfernt Anführungszeichen aus einer Zeichenfolge.",
			"Rename to '{0}'": "In „{0}“ umbenennen",
			"Replaces $original with $replacement within $selector.": "Ersetzt $original in $selector durch $replacement.",
			"Replaces the nth item in a list.": "Ersetzt das nth-Element in einer Liste.",
			"Returns a list of all keys in a map.": "Gibt eine Liste aller Schlüssel in einer Zuordnung zurück.",
			"Returns a list of all values in a map.": "Gibt eine Liste aller Werte in einer Zuordnung zurück.",
			"Returns a new map with keys removed.": "Gibt eine neue Zuordnung mit entfernten Schlüsseln zurück.",
			"Returns a random number.": "Gibt eine Zufallszahl zurück.",
			"Returns a specific item in a list.": "Gibt ein bestimmtes Element in einer Liste zurück.",
			"Returns the absolute value of a number.": "Gibt den absoluten Wert einer Zahl zurück.",
			"Returns the complement of a color.": "Gibt das Komplement einer Farbe zurück.",
			"Returns the index of the first occurance of $substring in $string.": "Gibt den Index des ersten Vorkommens von $substring in $string zurück.",
			"Returns the inverse of a color.": "Gibt die inverse Form einer Farbe zurück.",
			"Returns the keywords passed to a function that takes variable arguments.": "Gibt die Schlüsselwörter zurück, die an eine Funktion übergeben werden, die variablen Argumente akzeptiert.",
			"Returns the length of a list.": "Gibt die Länge einer Liste zurück.",
			"Returns the number of characters in a string.": "Gibt die Anzahl von Zeichen in einer Zeichenfolge zurück.",
			"Returns the position of a value within a list.": "Gibt die Position eines Werts innerhalb einer Liste zurück.",
			"Returns the separator of a list.": "Gibt das Trennzeichen einer Liste zurück.",
			"Returns the simple selectors that comprise a compound selector.": "Gibt die einfachen Selektoren zurück, aus denen ein zusammengesetzter Selektor besteht.",
			"Returns the string representation of a value as it would be represented in Sass.": "Gibt die Zeichenfolgendarstellung eines Werts zurück, wie er in Sass dargestellt wird.",
			"Returns the type of a value.": "Gibt den Typ eines Werts zurück.",
			"Returns the unit(s) associated with a number.": "Gibt die Einheiten zurück, die einer Zahl zugeordnet sind.",
			"Returns the value in a map associated with a given key.": "Gibt den Wert in einer Zuordnung zu einem bestimmten Schlüssel zurück.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Gibt zurück, ob $super allen Elementen entspricht, die $sub erfüllt, und möglicherweise mehr.",
			"Returns whether a feature exists in the current Sass runtime.": "Gibt zurück, ob ein Feature in der aktuellen Sass-Laufzeit vorhanden ist.",
			"Returns whether a function with the given name exists.": "Gibt zurück, ob eine Funktion mit dem angegebenen Namen vorhanden ist.",
			"Returns whether a map has a value associated with a given key.": "Gibt zurück, ob einer Zuordnung ein Wert zugeordnet ist, der einem bestimmten Schlüssel zugeordnet ist.",
			"Returns whether a mixin with the given name exists.": "Gibt zurück, ob ein Mixin mit dem angegebenen Namen vorhanden ist.",
			"Returns whether a number has units.": "Gibt zurück, ob eine Zahl Einheiten aufweist.",
			"Returns whether a variable with the given name exists in the current scope.": "Gibt zurück, ob eine Variable mit dem angegebenen Namen im aktuellen Bereich vorhanden ist.",
			"Returns whether a variable with the given name exists in the global scope.": "Gibt zurück, ob eine Variable mit dem angegebenen Namen im globalen Bereich vorhanden ist.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Gibt zurück, ob zwei Zahlen hinzugefügt, subtrahiert oder verglichen werden können.",
			"Rounds a number down to the previous whole number.": "Rundet eine Zahl auf die vorherige ganze Zahl ab.",
			"Rounds a number to the nearest whole number.": "Rundet eine Zahl auf die nächste ganze Zahl.",
			"Rounds a number up to the next whole number.": "Rundet eine Zahl auf die nächste ganze Zahl auf.",
			"Sass documentation": "Sass-Dokumentation",
			"Selector Specificity": "Selektorspezifität",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Selektoren sollten keine IDs enthalten, da diese Regeln zu eng mit HTML verknüpft sind.",
			"Simple HTML5 starting point": "Einfacher HTML5-Ausgangspunkt",
			"Start tag name expected.": "Starttagname erwartet.",
			"Tag name must directly follow the open bracket.": "Der Tagname muss direkt auf die geöffnete Klammer folgen.",
			"The universal selector (*) is known to be slow": "Der Universalselektor (*) ist bekanntermaßen langsam",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Wirft den Wert eines Ausdrucks als fatalen Fehler mit Stack-Trace. Nützlich für die Validierung von Argumenten für Mixins und Funktionen.",
			"URI expected": "URI erwartet",
			"URL encodes a string": "URL codiert eine Zeichenfolge",
			"Unexpected character in tag.": "Unerwartetes Zeichen im Tag.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Vereinigt zwei Selektoren, um einen Selektor zu erzeugen, der mit Elementen übereinstimmt, die von beiden übereinstimmen.",
			"Unknown at-rule.": "Unbekannte at-Regel.",
			"Unknown property.": "Unbekannte Eigenschaft.",
			"Unknown property: '{0}'": "Unbekannte Eigenschaft: „{0}“",
			"Unknown vendor specific property.": "Unbekannte anbieterspezifische Eigenschaft.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "VS Code bietet jetzt integrierte Unterstützung für das automatische Umbenennen von Tags. Möchten Sie dieses Feature aktivieren?",
			"When using a vendor-specific prefix also include the standard property": "Beim Verwenden eines anbieterspezifischen Präfixes auch die Standardeigenschaft einbeziehen",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Beim Verwenden eines anbieterspezifischen Präfixes sicherstellen, dass alle anderen anbieterspezifischen Eigenschaften einbezogen werden",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "„While“-Schleife, die einen Ausdruck akzeptiert und wiederholt die geschachtelten Stile ausgibt, bis die Anweisung als „FALSE“ ausgewertet wird.",
			"[ expected": "[ erwartet",
			"] expected": "] erwartet",
			"absolute value of a number": "Absoluter Wert einer Zahl",
			"arccosine - inverse of cosine function": "Arkuskosinus – Umkehrung der Kosinusfunktion",
			"arcsine - inverse of sine function": "Arkuskosinus – Umkehrung der Sinusfunktion",
			"arctangent - inverse of tangent function": "Arkustangens – Umkehrung der Tangensfunktion",
			"argument from '{0}'": "Argument von „{0}“",
			"at-rule or selector expected": "„at“-Regel oder Selektor erwartet",
			"at-rule unknown": "„at“-Regel unbekannt",
			"bind the evaluation of a ruleset to each member of a list.": "die Auswertung eines Regelsatzes an jedes Mitglied einer Liste binden.",
			"calculates square root of a number": "Berechnet die Quadratwurzel einer Zahl",
			"colon expected": "Ein Doppelpunkt wurde erwartet",
			"comma expected": "Komma erwartet",
			"condition expected": "Bedingung erwartet",
			"converts numbers from one type into another": "konvertiert Zahlen von einem Typ in einen anderen.",
			"converts to a %, e.g. 0.5 > 50%": "konvertiert in %, z. B. 0,5 > 50 %",
			"cosine function": "Kosinusfunktion",
			"creates a #AARRGGBB": "erstellt eine #AARRGGBB",
			"creates a color": "erstellt eine Farbe",
			"dot expected": "Punkt erwartet",
			"escape string content": "Escapezeichenfolgeninhalt",
			"expression expected": "Ausdruck erwartet",
			"first argument modulus second argument": "Erstes Argument Modulus zweites Argument",
			"first argument raised to the power of the second argument": "Erstes Argument, das mit der Potenz des zweiten Arguments ausgelöst wird",
			"generate a list spanning a range of values": "Generieren einer Liste, die einen Wertebereich umfasst",
			"identifier expected": "Bezeichner erwartet",
			"identifier or variable expected": "Bezeichner oder Variable erwartet",
			"identifier or wildcard expected": "Bezeichner oder Platzhalter erwartet",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "Der Inlineblock wird aufgrund des Gleitkommawerts ignoriert. Wenn „float“ einen anderen Wert als „none“ aufweist, wird das Feld als „floated“ und „display“ als „Block“ behandelt.",
			"inlines a resource and falls back to `url()`": "inline eine Ressource und greift auf „url()“ zurück.",
			"media query expected": "Medienabfrage erwartet",
			"number expected": "Zahl erwartet",
			"operator expected": "Operator erwartet",
			"page directive or declaraton expected": "Seitendirektive oder -deklaration erwartet",
			"parses a string to a color": "analysiert eine Zeichenfolge in eine Farbe.",
			"percentage expected": "Prozentsatz erwartet",
			"property value expected": "Eigenschaftswert erwartet",
			"remove or change the unit of a dimension": "Entfernen oder Ändern der Einheit einer Dimension",
			"return `@color` 10% points darker": "\"@color\" um 10 % Punkte dunkler zurückgeben",
			"return `@color` 10% points less saturated": "gibt „@color“ 10 %-Punkte weniger gesättigt zurück",
			"return `@color` 10% points less transparent": "gibt „@color“ um 10 % Punkte weniger transparent zurück",
			"return `@color` 10% points lighter": "gibt „@color“ um 10 % Punkte heller zurück",
			"return `@color` 10% points more saturated": "„@color“ 10 %-Punkte gesättigter zurückgeben",
			"return `@color` 10% points more transparent": "„@color“ 10 %-Punkte transparenter zurückgeben",
			"return `@color` with 50% transparency": "„@color“ mit 50 % Transparenz zurückgeben",
			"return `@color` with a 10 degree larger in hue": "gibt „@color“ mit einem 10 Grad größeren Farbton zurück.",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "„@darkcolor“ zurückgeben, wenn „@color1 > 43 % luma ist“ andernfalls „@lightcolor“ zurückgeben, siehe Hinweise",
			"return a mix of `@color1` and `@color2`": "gibt eine Mischung aus „@color1“ und „@color2“ zurück.",
			"returns a grey, 100% desaturated color": "liefert eine graue, 100 % entsättigte Farbe",
			"returns a value at the specified position in the list": "gibt einen Wert an der angegebenen Position in der Liste zurück.",
			"returns one of two values depending on a condition.": "gibt je nach Bedingung einen von zwei Werten zurück.",
			"returns pi": "gibt Pi zurück.",
			"returns the `alpha` channel of `@color`": "gibt den Alphakanal von „@color“ zurück",
			"returns the `blue` channel of `@color`": "gibt den blauen Kanal von „@color“ zurück.",
			"returns the `green` channel of `@color`": "gibt den grünen Kanal von „@color“ zurück.",
			"returns the `hue` channel of `@color` in the HSL space": "gibt den „Farbton“-Kanal von „@color“ im HSL-Raum zurück",
			"returns the `hue` channel of `@color` in the HSV space": "gibt den Farbton-Kanal von „@color“ im HSV-Bereich zurück.",
			"returns the `lightness` channel of `@color` in the HSL space": "gibt den Helligkeitskanal von „@color“ im HSL-Raum zurück.",
			"returns the `luma` value (perceptual brightness) of `@color`": "gibt den „luma“-Wert (wahrnehmbare Helligkeit) von „@color“ zurück.",
			"returns the `red` channel of `@color`": "gibt den roten Kanal von „@color“ zurück",
			"returns the `saturation` channel of `@color` in the HSL space": "gibt den Sättigungskanal von „@color“\" im HSL-Raum zurück.",
			"returns the `saturation` channel of `@color` in the HSV space": "gibt den Sättigungskanal von „@color“ im HSV-Raum zurück.",
			"returns the `value` channel of `@color` in the HSV space": "gibt den Value-Kanal von „@color“ im HSV-Bereich zurück.",
			"returns the lowest of one or more values": "gibt den niedrigsten von mindestens einem Wert zurück.",
			"returns the number of elements in a value list": "gibt die Anzahl der Elemente in einer Wertliste zurück.",
			"rounds a number to a number of places": "Rundet eine Zahl auf eine Anzahl von Stellen",
			"rounds down to an integer": "Rundet auf eine ganze Zahl ab",
			"rounds up to an integer": "Rundet auf eine ganze Zahl auf",
			"selector expected": "Selektor erwartet",
			"semi-colon expected": "Semikolon erwartet",
			"sine function": "Sinusfunktion",
			"string literal expected": "Ein Zeichenfolgenliteral wurde erwartet",
			"string replace": "Ersetzen von Zeichenfolgen",
			"tangent function": "Gleichungen",
			"term expected": "Begriff erwartet",
			"unknown keyword": "Unbekanntes Schlüsselwort",
			"uri or string expected": "URI oder Zeichenfolge erwartet",
			"variable name expected": "Es wurde ein Variablenname erwartet",
			"variable value expected": "Variablenwert erwartet",
			"whitespace expected": "Leerzeichen erwartet",
			"wildcard expected": "Platzhalter erwartet",
			"{ expected": "{ erwartet.",
			"{0}, '{1}'": "{0}, „{1}“",
			"} expected": "} erwartet."
		},
		"package": {
			"description": "Umfangreiche Sprachunterstützung für HTML- und HANDLEBAR-Dateien",
			"displayName": "HTML-Sprachfeatures",
			"html.autoClosingTags": "Automatisches Schließen von HTML-Tags aktivieren/deaktivieren.",
			"html.autoCreateQuotes": "Aktivieren/Deaktivieren der automatischen Erstellung von Anführungszeichen für die HTML-Attributzuweisung. Der Typ von Anführungszeichen kann durch `#html.completion.attributeDefaultValue#` konfiguriert werden.",
			"html.completion.attributeDefaultValue": "Steuert den Standardwert für Attribute, wenn der Abschluss akzeptiert wird.",
			"html.completion.attributeDefaultValue.doublequotes": "Der Attributwert ist auf „“ festgelegt.",
			"html.completion.attributeDefaultValue.empty": "Der Attributwert ist nicht festgelegt.",
			"html.completion.attributeDefaultValue.singlequotes": "Der Attributwert ist auf „ festgelegt.",
			"html.customData.desc": "Eine Liste relativer Dateipfade, die auf JSON-Dateien im [benutzerdefinierten Datenformat](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md) verweisen.\r\n\r\nVS Code lädt benutzerdefinierte Daten beim Start, um die HTML-Unterstützung für die benutzerdefinierten HTML-Tags, -Attribute und -Attributwerte, die Sie in den JSON-Dateien angeben, zu verbessern.\r\n\r\nDie Dateipfade werden relativ zum Arbeitsbereich angegeben, und es werden nur Einstellungen für den Arbeitsbereichsordner berücksichtigt.",
			"html.format.contentUnformatted.desc": "Liste der Tags (durch Trennzeichen getrennt), in der der Inhalt nicht neu formatiert werden muss. `null` entspricht standardmäßig dem Tag `pre`.",
			"html.format.enable.desc": "HTML-Standardformatierer aktivieren/deaktivieren.",
			"html.format.extraLiners.desc": "Die Liste der Tags (durch Kommas getrennt), vor denen eine zusätzliche neue Zeile eingefügt werden soll. `null` verwendet standardmäßig `\"head, body, /HTML\"`.",
			"html.format.indentHandlebars.desc": "Formatiert `{{#foo}}` und `{{/foo}}` und nimmt einen Einzug vor.",
			"html.format.indentInnerHtml.desc": "Hiermit werden `<head>`- und `<body>`-Abschnitte eingerückt.",
			"html.format.maxPreserveNewLines.desc": "Die maximale Anzahl von Zeilenumbrüchen, die in einem Block beibehalten werden soll. Verwenden Sie `null` für eine unbegrenzte Anzahl.",
			"html.format.preserveNewLines.desc": "Legt fest, ob vorhandene Zeilenumbrüche vor Elementen beibehalten werden sollen. Funktioniert nur vor Elementen, nicht in Tags oder bei Text.",
			"html.format.templating.desc": "Hiermit werden Sprachtags für die Django-, ERB-, Handlebars- und PHP-Vorlagenerstellung berücksichtigt.",
			"html.format.unformatted.desc": "Die Liste der Tags (durch Kommas getrennt), die nicht erneut formatiert werden sollen. `null` bezieht sich standardmäßig auf alle Tags, die unter https://www.w3.org/TR/html5/dom.html#phrasing-content aufgeführt werden.",
			"html.format.unformattedContentDelimiter.desc": "Hiermit werden Textinhalte innerhalb dieser Zeichenfolge zusammengehalten.",
			"html.format.wrapAttributes.alignedmultiple": "Umbrechen, wenn Zeilenlänge überschritten wird, und Attribute vertikal ausrichten.",
			"html.format.wrapAttributes.auto": "Attribute nur umbrechen, wenn Zeilenlänge überschritten wird.",
			"html.format.wrapAttributes.desc": "Attribute umbrechen.",
			"html.format.wrapAttributes.force": "Alle Attribute mit Ausnahme des ersten umbrechen.",
			"html.format.wrapAttributes.forcealign": "Alle Attribute mit Ausnahme des ersten umbrechen und Ausrichtung beibehalten.",
			"html.format.wrapAttributes.forcemultiline": "Alle Attribute umbrechen.",
			"html.format.wrapAttributes.preserve": "Umbrechen von Attributen beibehalten.",
			"html.format.wrapAttributes.preservealigned": "Umbrechen von Attributen beibehalten, aber ausrichten.",
			"html.format.wrapAttributesIndentSize.desc": "Umbrochene Attribute nach N Zeichen einrücken. Verwenden Sie \"null\", um die Standardeinzugsgröße zu verwenden. Wird ignoriert, wenn \"#html.format.wrapAttributes#\" auf \"aligned\" festgelegt ist.",
			"html.format.wrapLineLength.desc": "Die maximale Anzahl von Zeichen pro Zeile (0 = deaktiviert).",
			"html.hover.documentation": "Hiermit wird beim Zeigen auf ein Element eine Tag- und Attributdokumentation eingeblendet.",
			"html.hover.references": "Hiermit werden beim Zeigen auf ein Element Verweise auf MDN eingeblendet.",
			"html.mirrorCursorOnMatchingTag": "Spielcursor bei übereinstimmendem HTML-Tag aktivieren/deaktivieren",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Veraltet und durch \"editor.linkedEditing\" ersetzt",
			"html.suggest.html5.desc": "Legt fest, ob die integrierte HTML-Sprachuntersützung HTML5-Tags, -Eigenschaften und -Werte vorschlägt.",
			"html.trace.server.desc": "Verfolgt die Kommunikation zwischen VS Code und dem HTML-Sprachserver.",
			"html.validate.scripts": "Legt fest, ob die integrierte HTML-Sprachunterstützung eingebettete Skripts überprüft.",
			"html.validate.styles": "Legt fest, ob die integrierte HTML-Sprachunterstützung eingebettete Stile überprüft."
		}
	}
}