{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"memorizzare\" un test booleano per una valutazione successiva in un guard o if().",
			"'from' expected": "Previsto 'from'",
			"'in' expected": "'È previsto 'in'",
			"'through' or 'to' expected": "previsto 'through' o 'to'",
			"'{0}'": "'{0}'",
			"( expected": "È previsto il carattere (",
			") expected": "È previsto il segno )",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "La regola `@font-face` deve definire le proprietà `src` e `font-family`",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Elenco di proprietà che non vengono convalidate in base alla regola `unknownProperties`.",
			"Adds quotes to a string.": "Aggiunge virgolette a una stringa.",
			"Also define the standard property '{0}' for compatibility": "Definire anche la proprietà standard '{0}' per la compatibilità",
			"Always define standard rule '@keyframes' when defining keyframes.": "Definire sempre la regola standard '@keyframes' quando si definiscono i fotogrammi chiave.",
			"Always include all vendor specific properties: Missing: {0}": "Includere sempre tutte le proprietà specifiche del fornitore: mancanti: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Includere sempre tutte le regole specifiche del fornitore: mancanti: {0}",
			"Appends a single value onto the end of a list.": "Aggiunge un singolo valore alla fine di un elenco.",
			"Appends selectors to one another without spaces in between.": "Aggiunge i selettori l\\'uno all\\'altro senza spazi intermedi.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Evitare di usare !important perché indica che la specificità dell'intero codice CSS non è più controllabile ed è necessario effettuarne il refactoring.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Evitare di usare `float`. Con gli elementi float si ottiene codice CSS che causa facilmente interruzioni in caso di modifica di un aspetto del layout.",
			"Causes one or more rules to be emitted at the root of the document.": "Determina l'emissione di una o più regole nella radice del documento.",
			"Changes one or more properties of a color.": "Modifica una o più proprietà di un colore.",
			"Changes the alpha component for a color.": "Modifica il componente alfa per un colore.",
			"Changes the hue of a color.": "Cambia la tonalità di un colore.",
			"Character entity representing '{0}'": "Entità del carattere che rappresenta '{0}'",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Entità carattere che rappresenta '{0}', equivalente unicode '{1}'",
			"Closing bracket expected.": "Prevista parentesi quadra di chiusura.",
			"Closing bracket missing.": "Parentesi chiusa mancante.",
			"Combines several lists into a single multidimensional list.": "Combina diversi elenchi in un unico elenco multidimensionale.",
			"Configure": "Configurare",
			"Converts a color into the format understood by IE filters.": "Converte un colore nel formato riconosciuto dai filtri di Internet Explorer.",
			"Converts a color to grayscale.": "Converte un colore in gradazioni di grigio.",
			"Converts a string to lower case.": "Converte una stringa in lettere minuscole.",
			"Converts a string to upper case.": "Converte una stringa in maiuscolo.",
			"Converts a unitless number to a percentage.": "Converte un numero senza unità in una percentuale.",
			"Creates a Color from hue, saturation, and lightness values.": "Crea un colore da valori di tonalità, saturazione e luminosità.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Crea un colore da tonalità, saturazione, luminosità e valori alfa.",
			"Creates a Color from hue, white, and black values.": "Crea un colore dai valori di tonalità, bianco e nero.",
			"Creates a Color from lightness, a, and b values.": "Crea un colore dai valori di luminosità, a e b.",
			"Creates a Color from lightness, chroma, and hue values.": "Crea un colore dai valori di luminosità, crominanza e tonalità.",
			"Creates a Color from red, green, and blue values.": "Crea un colore dai valori rosso, verde e blu.",
			"Creates a Color from red, green, blue, and alpha values.": "Crea un colore dai valori rosso, verde, blu e alfa.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Crea un colore dai valori di tonalità, saturazione e luminosità di un altro colore.",
			"Creates a Color from the hue, white, and black values of another Color.": "Crea un colore dai valori di tonalità, bianco e nero di un altro colore.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Crea un colore dai valori di luminosità, a e b di un altro colore.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Crea un colore dai valori di luminosità, crominanza e tonalità di un altro colore.",
			"Creates a Color from the red, green, and blue values of another Color.": "Crea un colore dai valori di rosso, verde e blu di un altro colore.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Crea un colore in uno spazio colore specifico a partire dai valori di rosso, verde e blu.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Crea un colore in uno spazio colore specifico dai valori di rosso, verde e blu di un altro colore.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Definisce operazioni complesse che possono essere riutilizzate in tutti i fogli di stile.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Definisce gli stili che possono essere riutilizzati nel foglio di stile con '@include'.",
			"Do not use duplicate style definitions": "Non usare definizioni di stile duplicate",
			"Do not use empty rulesets": "Non usare set di regole vuoti",
			"Do not use width or height when using padding or border": "Non usare width o height con padding o border",
			"Dynamically calls a Sass function.": "Chiama dinamicamente una funzione Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Ogni ciclo che imposta `$var` su ogni elemento dell\\'elenco o della mappa, quindi restituisce gli stili che contiene usando il valore `$var`.",
			"End tag name expected.": "È previsto il nome del tag di fine.",
			"Exposes the details of Sass’s inner workings.": "Espone i dettagli delle operazioni interne di Sass.",
			"Extends $extendee with $extender within $selector.": "Estende $extendee con $extender all'interno di $selector.",
			"Extracts a substring from $string.": "Estrae una sottostringa da $string.",
			"Finds the maximum of several numbers.": "Trova il numero massimo di diversi numeri.",
			"Finds the minimum of several numbers.": "Trova il numero minimo di diversi numeri.",
			"Fluidly scales one or more properties of a color.": "Ridimensiona in modo fluido una o più proprietà di un colore.",
			"Folding Region End": "Fine area di riduzione del codice",
			"Folding Region Start": "Inizio area di riduzione del codice",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Ciclo For che restituisce ripetutamente un set di stili per ogni '$var' nella clausola 'from/through' o 'from/to'.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Genera nuovi colori in base a quelli esistenti, semplificando la creazione di temi colore.",
			"Gets the blue component of a color.": "Ottiene il componente blu di un colore.",
			"Gets the green component of a color.": "Ottiene il componente verde di un colore.",
			"Gets the hue component of a color.": "Ottiene il componente tonalità di un colore.",
			"Gets the lightness component of a color.": "Ottiene il componente di luminosità di un colore.",
			"Gets the opacity component of a color.": "Ottiene il componente di opacità di un colore.",
			"Gets the red component of a color.": "Ottiene il componente rosso di un colore.",
			"Gets the saturation component of a color.": "Ottiene il componente di saturazione di un colore.",
			"HTML Language Server": "Server di linguaggio HTML",
			"Hex colors must consist of three, four, six or eight hex numbers": "I colori esadecimali devono essere costituiti da tre, quattro, sei o otto numeri esadecimali",
			"IE hacks are only necessary when supporting IE7 and older": "Gli hack IE sono necessari solo per il supporto di IE7 e versioni precedenti",
			"Import statements do not load in parallel": "Le istruzioni Import non vengono caricate in parallelo",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Include il corpo se l'espressione non restituisce 'false' o 'null'.",
			"Includes the styles defined by another mixin into the current rule.": "Include gli stili definiti da un altro mixin nella regola corrente.",
			"Increases or decreases one or more components of a color.": "Aumenta o riduce uno o più componenti di un colore.",
			"Inherits the styles of another selector.": "Eredita gli stili di un altro selettore.",
			"Inserts $insert into $string at $index.": "Inserisce $insert in $string a $index.",
			"Invalid number of parameters": "Numero di parametri non valido",
			"Joins together two lists into one.": "Unisce due elenchi in uno.",
			"Lets you access and modify values in lists.": "Consente di accedere e modificare i valori negli elenchi.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Carica un foglio di stile Sass e rende disponibili mixin, funzioni e variabili quando questo foglio di stile viene caricato con la regola di @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Carica mixins, funzioni e variabili da altri fogli di stile Sass come \"moduli\" e combina CSS da più fogli di stile.",
			"Makes a color darker.": "Rende un colore più scuro.",
			"Makes a color less saturated.": "Rende un colore meno saturo.",
			"Makes a color lighter.": "Rende un colore più chiaro.",
			"Makes a color more opaque.": "Rende un colore più opaco.",
			"Makes a color more saturated.": "Rende un colore più saturo.",
			"Makes a color more transparent.": "Rende un colore più trasparente.",
			"Makes it easy to combine, search, or split apart strings.": "Consente facilmente di combinare, cercare o dividere le stringhe.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Consente di cercare il valore associato a una chiave in una mappa e molto altro ancora.",
			"Merges two maps together into a new map.": "Unisce due mappe in una nuova mappa.",
			"Mix two colors together in a polar color space.": "Combina due colori in uno spazio colore polare.",
			"Mix two colors together in a rectangular color space.": "Combina due colori in uno spazio colore rettangolare.",
			"Mixes two colors together.": "Combina due colori.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Annida i selettori uno sotto l\\'altro come se fossero annidati nel foglio di stile.",
			"No unit for zero needed": "Non è necessaria alcuna unità per lo zero",
			"Parses a selector into the format returned by &.": "Analizza un selettore nel formato restituito da &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Stampa il valore di un'espressione nel flusso di output dell'errore standard. Utile per il debug di file Sass complicati.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Stampa il valore di un'espressione nel flusso di output degli errori standard. Utile per le librerie che devono avvisare gli utenti della deprecazione o del ripristino da errori di utilizzo mixin secondari. Gli avvisi possono essere disattivati con l'opzione della riga di comando '--quiet' o l'opzione Sass ':quiet'.",
			"Property is ignored due to the display.": "La proprietà viene ignorata a causa della visualizzazione.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Proprietà ignorata a causa della visualizzazione. Con 'display: block', non usare l'allineamento verticale.",
			"Provides access to Sass’s powerful selector engine.": "Fornisce l'accesso al motore di selezione avanzato di Sass.",
			"Provides functions that operate on numbers.": "Fornisce funzioni che operano sui numeri.",
			"Removes quotes from a string.": "Rimuove le virgolette da una stringa.",
			"Rename to '{0}'": "Rinominare in '{0}'",
			"Replaces $original with $replacement within $selector.": "Sostituisce $original con $replacement all'interno di $selector.",
			"Replaces the nth item in a list.": "Sostituisce l\\'elemento n-esimo di un elenco.",
			"Returns a list of all keys in a map.": "Restituisce un elenco di tutte le chiavi in una mappa.",
			"Returns a list of all values in a map.": "Restituisce un elenco di tutti i valori in una mappa.",
			"Returns a new map with keys removed.": "Restituisce una nuova mappa con le chiavi rimosse.",
			"Returns a random number.": "Restituisce un numero casuale.",
			"Returns a specific item in a list.": "Restituisce un elemento specifico in un elenco.",
			"Returns the absolute value of a number.": "Restituisce il valore assoluto di un numero.",
			"Returns the complement of a color.": "Restituisce il complemento di un colore.",
			"Returns the index of the first occurance of $substring in $string.": "Restituisce l'indice della prima occorrenza di $substring in $string.",
			"Returns the inverse of a color.": "Restituisce l'inverso di un colore.",
			"Returns the keywords passed to a function that takes variable arguments.": "Restituisce le parole chiave passate a una funzione che accetta argomenti variabili.",
			"Returns the length of a list.": "Restituisce la lunghezza di un elenco.",
			"Returns the number of characters in a string.": "Restituisce il numero di caratteri in una stringa.",
			"Returns the position of a value within a list.": "Restituisce la posizione di un valore all\\'interno di un elenco.",
			"Returns the separator of a list.": "Restituisce il separatore di un elenco.",
			"Returns the simple selectors that comprise a compound selector.": "Restituisce i selettori semplici che costituiscono un selettore composto.",
			"Returns the string representation of a value as it would be represented in Sass.": "Restituisce la rappresentazione stringa di un valore rappresentato in Sass.",
			"Returns the type of a value.": "Restituisce il tipo di un valore.",
			"Returns the unit(s) associated with a number.": "Restituisce le unità associate a un numero.",
			"Returns the value in a map associated with a given key.": "Restituisce il valore in una mappa associata a una chiave specificata.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Restituisce un valore che indica se $super corrisponde a tutti gli elementi $sub e ad altri elementi.",
			"Returns whether a feature exists in the current Sass runtime.": "Restituisce un valore che indica se una funzionalità esiste nel runtime Sass corrente.",
			"Returns whether a function with the given name exists.": "Restituisce un valore che indica se esiste una funzione con il nome specificato.",
			"Returns whether a map has a value associated with a given key.": "Restituisce un valore che indica se a una mappa è associato un valore a una determinata chiave.",
			"Returns whether a mixin with the given name exists.": "Restituisce un valore che indica se esiste un mixin con il nome specificato.",
			"Returns whether a number has units.": "Restituisce un valore che indica se un numero contiene unità.",
			"Returns whether a variable with the given name exists in the current scope.": "Restituisce un valore che indica se nell'ambito corrente esiste una variabile con il nome specificato.",
			"Returns whether a variable with the given name exists in the global scope.": "Restituisce un valore che indica se nell'ambito globale esiste una variabile con il nome specificato.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Restituisce un valore che indica se è possibile aggiungere, sottrarre o confrontare due numeri.",
			"Rounds a number down to the previous whole number.": "Arrotonda per difetto questo numero all'intero precedente.",
			"Rounds a number to the nearest whole number.": "Arrotonda un numero all'intero più vicino.",
			"Rounds a number up to the next whole number.": "Arrotonda per eccesso all'intero successivo.",
			"Sass documentation": "Documentazione Sass",
			"Selector Specificity": "Specifica del selettore",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "I selettori non devono contenere ID perché queste regole sono strettamente accoppiate al codice HTML.",
			"Simple HTML5 starting point": "Punto iniziale HTML5 semplice",
			"Start tag name expected.": "È previsto il nome del tag di inizio.",
			"Tag name must directly follow the open bracket.": "Il nome del tag deve seguire direttamente la parentesi aperta.",
			"The universal selector (*) is known to be slow": "Il selettore universale (`*`) è notoriamente lento",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Genera il valore di un\\'espressione come errore irreversibile con l’analisi dello stack. Utile per convalidare gli argomenti per mixin e funzioni.",
			"URI expected": "URI previsto",
			"URL encodes a string": "L'URL codifica una stringa",
			"Unexpected character in tag.": "Carattere non previsto nel tag.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Unifica due selettori per produrre un selettore corrispondente a elementi corrispondenti a entrambi.",
			"Unknown at-rule.": "Regola at-rule sconosciuta.",
			"Unknown property.": "Proprietà sconosciuta.",
			"Unknown property: '{0}'": "Proprietà sconosciuta '{0}'",
			"Unknown vendor specific property.": "Proprietà specifica del fornitore sconosciuta.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "VS Code include ora il supporto predefinito per la ridenominazione automatica dei tag. Abilitarlo?",
			"When using a vendor-specific prefix also include the standard property": "Quando si usa un prefisso specifico del fornitore, includere anche la proprietà standard",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Quando si usa un prefisso specifico del fornitore, assicurarsi di includere anche tutte le altre proprietà specifiche del fornitore",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Ciclo While che accetta un'espressione e restituisce ripetutamente gli stili annidati fino a quando l'istruzione non restituisce 'false'.",
			"[ expected": "[ previsto",
			"] expected": "previsto ]",
			"absolute value of a number": "valore assoluto di un numero",
			"arccosine - inverse of cosine function": "arcocoseno - inverso della funzione coseno",
			"arcsine - inverse of sine function": "arcoseno - inverso della funzione seno",
			"arctangent - inverse of tangent function": "arcotangente - inversa della funzione tangente",
			"argument from '{0}'": "argomento da '{0}'",
			"at-rule or selector expected": "previsto selettore o regola at",
			"at-rule unknown": "a regola sconosciuta",
			"bind the evaluation of a ruleset to each member of a list.": "associare la valutazione di un set di regole a ogni membro di un elenco.",
			"calculates square root of a number": "calcola la radice quadrata di un numero",
			"colon expected": "Sono previsti i due punti",
			"comma expected": "virgola prevista",
			"condition expected": "prevista condizione",
			"converts numbers from one type into another": "converte i numeri da un tipo a un altro",
			"converts to a %, e.g. 0.5 > 50%": "converte in %, ad esempio 0,5 > 50%",
			"cosine function": "funzione coseno",
			"creates a #AARRGGBB": "crea un #AARRGGBB",
			"creates a color": "crea un colore",
			"dot expected": "previsto punto",
			"escape string content": "contenuto della stringa di escape",
			"expression expected": "prevista espressione",
			"first argument modulus second argument": "modulo primo argomento secondo argomento",
			"first argument raised to the power of the second argument": "primo argomento elevato alla potenza del secondo argomento",
			"generate a list spanning a range of values": "genera un elenco che si estende su un intervallo di valori",
			"identifier expected": "previsto identificatore",
			"identifier or variable expected": "previsto identificatore o variabile",
			"identifier or wildcard expected": "previsto identificatore o carattere jolly",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "blocco inline ignorato a causa del valore float. Se 'float' ha un valore diverso da 'none', la casella viene resa mobile e 'display' viene considerato come 'block'",
			"inlines a resource and falls back to `url()`": "rende inline una risorsa ed esegue il fallback a 'url()'",
			"media query expected": "media query previsto",
			"number expected": "previsto numero",
			"operator expected": "previsto operatore",
			"page directive or declaraton expected": "prevista direttiva o dichiarazione di pagina",
			"parses a string to a color": "analizza una stringa con un colore",
			"percentage expected": "percentuale prevista",
			"property value expected": "valore della proprietà previsto",
			"remove or change the unit of a dimension": "rimuovere o modificare l'unità di una dimensione",
			"return `@color` 10% points darker": "restituisce '@color' 10% punti più scuro",
			"return `@color` 10% points less saturated": "restituire '@color' con punti del 10% meno saturi",
			"return `@color` 10% points less transparent": "restituisce '@color' 10% punti meno trasparenti",
			"return `@color` 10% points lighter": "restituire '@color' con punti del 10% più chiari",
			"return `@color` 10% points more saturated": "restituisce '@color' 10% punti in più saturi",
			"return `@color` 10% points more transparent": "restituisce '@color' 10% punti più trasparenti",
			"return `@color` with 50% transparency": "restituisce '@color' con trasparenza del 50%",
			"return `@color` with a 10 degree larger in hue": "restituisce \"@color\" con una tonalità maggiore di 10 gradi",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "restituisce `@darkcolor` se `@color1 è > 43% luma` in caso contrario restituisce `@lightcolor`. Vedere le note",
			"return a mix of `@color1` and `@color2`": "restituisce una combinazione di '@color1' e '@color2'",
			"returns a grey, 100% desaturated color": "restituisce un colore grigio, 100% non saturo",
			"returns a value at the specified position in the list": "restituisce un valore nella posizione specificata nell'elenco",
			"returns one of two values depending on a condition.": "restituisce uno dei due valori a seconda di una condizione.",
			"returns pi": "returns pi",
			"returns the `alpha` channel of `@color`": "restituisce il canale 'alpha' di '@color'",
			"returns the `blue` channel of `@color`": "restituisce il canale 'blue' di '@color'",
			"returns the `green` channel of `@color`": "restituisce il canale 'green' di '@color'",
			"returns the `hue` channel of `@color` in the HSL space": "restituisce il canale 'hue' di '@color' nello spazio HSL",
			"returns the `hue` channel of `@color` in the HSV space": "restituisce il canale `hue` di `@color` nello spazio HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "restituisce il canale 'lightness' di '@color' nello spazio HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "restituisce il valore 'luma' (luminosità percettiva) di '@color'",
			"returns the `red` channel of `@color`": "restituisce il canale 'red' di '@color'",
			"returns the `saturation` channel of `@color` in the HSL space": "restituisce il canale `saturation` di `@color` nello spazio HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "restituisce il canale 'saturation' di '@color' nello spazio HSV",
			"returns the `value` channel of `@color` in the HSV space": "restituisce il canale 'value' di '@color' nello spazio HSV",
			"returns the lowest of one or more values": "restituisce il valore più basso di uno o più valori",
			"returns the number of elements in a value list": "restituisce il numero di elementi in un elenco di valori",
			"rounds a number to a number of places": "arrotonda un numero a un numero di posizioni",
			"rounds down to an integer": "arrotonda per difetto a un numero intero",
			"rounds up to an integer": "arrotonda per eccesso a un numero intero",
			"selector expected": "selettore previsto",
			"semi-colon expected": "previsto punto e virgola",
			"sine function": "funzione seno",
			"string literal expected": "previsto valore letterale stringa",
			"string replace": "sostituzione stringa",
			"tangent function": "funzione tangente",
			"term expected": "previsto termine",
			"unknown keyword": "parola chiave sconosciuta",
			"uri or string expected": "previsto uri o stringa",
			"variable name expected": "previsto nome variabile",
			"variable value expected": "Previsto valore variabile",
			"whitespace expected": "previsto spazio vuoto",
			"wildcard expected": "previsto carattere jolly",
			"{ expected": "previsto segno {",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "previsto }"
		},
		"package": {
			"description": "Fornisce un supporto avanzato del linguaggio per i file HTML e Handlebar",
			"displayName": "Funzionalità del linguaggio HTML",
			"html.autoClosingTags": "Abilita/Disabilita la chiusura automatica dei tag HTML.",
			"html.autoCreateQuotes": "Abilita/disabilita la creazione automatica delle virgolette per l'assegnazione di attributi HTML. Questo tipo di virgolette può essere configurato da '#html.completion.attributeDefaultValue#'.",
			"html.completion.attributeDefaultValue": "Controlla il valore predefinito per gli attributi quando il completamento viene accettato.",
			"html.completion.attributeDefaultValue.doublequotes": "Il valore di attributo è impostato su \"\".",
			"html.completion.attributeDefaultValue.empty": "Il valore di attributo non è impostato.",
			"html.completion.attributeDefaultValue.singlequotes": "Il valore di attributo è impostato su ''.",
			"html.customData.desc": "Elenco di percorsi di file relativi che puntano a file JSON e sono conformi al [formato dati personalizzato](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code carica i dati personalizzati all'avvio per migliorare il supporto HTML per i tag HTML, gli attributi e i valori di attributo personalizzati specificati nei file JSON.\r\n\r\nI percorsi di file sono relativi all'area di lavoro e vengono considerate solo le impostazioni della cartella dell'area di lavoro.",
			"html.format.contentUnformatted.desc": "Elenco di tag, delimitati da virgole, in cui il contenuto non deve essere riformattato. Per impostazione predefinita, con `null` viene usato il tag `pre`.",
			"html.format.enable.desc": "Abilita/Disabilita il formattatore HTML predefinito.",
			"html.format.extraLiners.desc": "Elenco di tag, delimitati da virgole, che devono essere preceduti da un carattere aggiuntivo di nuova riga. Con `null` viene usata l'impostazione predefinita `\"head, body, /html\"`.",
			"html.format.indentHandlebars.desc": "Applica la formattazione e imposta un rientro per `{{#foo}}` e `{{/foo}}`.",
			"html.format.indentInnerHtml.desc": "Imposta un rientro per le sezioni `<head>` e `<body>`.",
			"html.format.maxPreserveNewLines.desc": "Numero massimo di interruzioni di riga da mantenere in un unico blocco. Per non impostare un numero massimo, usare `null`.",
			"html.format.preserveNewLines.desc": "Controlla se è necessario mantenere interruzioni di riga esistenti prima degli elementi. Funziona solo prima degli elementi e non all'interno di tag o per il testo.",
			"html.format.templating.desc": "Tag dei linguaggi per la creazione di modelli Honor Django, ERB, Handlebars e PHP.",
			"html.format.unformatted.desc": "Elenco di tag, delimitati da virgole, che non devono essere riformattati. Con `null` viene usata l'impostazione predefinita che prevede l'uso di tutti i tag elencati in https://www.w3.org/TR/html5/dom.html#phrasing-content.",
			"html.format.unformattedContentDelimiter.desc": "Mantiene unito il contenuto di testo tra questa stringa.",
			"html.format.wrapAttributes.alignedmultiple": "Esegue il wrapping quando viene superata la lunghezza di riga. Allinea gli attributi verticalmente.",
			"html.format.wrapAttributes.auto": "Esegue il wrapping degli attributi solo quando viene superata la lunghezza di riga.",
			"html.format.wrapAttributes.desc": "Esegue il wrapping degli attributi.",
			"html.format.wrapAttributes.force": "Esegue il wrapping di ogni attributo ad eccezione del primo.",
			"html.format.wrapAttributes.forcealign": "Esegue il wrapping di ogni attributo ad eccezione del primo e mantiene l'allineamento.",
			"html.format.wrapAttributes.forcemultiline": "Esegue il wrapping di ogni attributo.",
			"html.format.wrapAttributes.preserve": "Mantiene il ritorno a capo degli attributi.",
			"html.format.wrapAttributes.preservealigned": "Mantiene il ritorno a capo degli attributi e allinea.",
			"html.format.wrapAttributesIndentSize.desc": "Imposta un rientro per gli attributi con ritorno a capo dopo N caratteri. Usare 'null' per usare le dimensioni predefinite del rientro. Ignorato se '#html.format.wrapAttributes#' è impostato su 'aligned'.",
			"html.format.wrapLineLength.desc": "Numero massimo di caratteri per riga (0 = disabilita).",
			"html.hover.documentation": "Mostra la documentazione su tag e attributi al passaggio del puntatore.",
			"html.hover.references": "Mostra i riferimenti a MDN al passaggio del puntatore.",
			"html.mirrorCursorOnMatchingTag": "Abilita/disabilita il mirroring del cursore in caso di tag HTML corrispondente.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Deprecata e sostituita da `editor.linkedEditing`",
			"html.suggest.html5.desc": "Controlla se il supporto del linguaggio HTML predefinito suggerisce tag, proprietà e valori di HTML5.",
			"html.trace.server.desc": "Traccia la comunicazione tra VS Code e il server del linguaggio HTML.",
			"html.validate.scripts": "Controlla se il supporto del linguaggio HTML predefinito convalida gli script incorporati.",
			"html.validate.styles": "Controlla se il supporto del linguaggio HTML predefinito convalida gli stili incorporati."
		}
	}
}