{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "„uloží“ logický test pro pozdější vyhodnocení v ochraně nebo if().",
			"'from' expected": "očekával se výraz from",
			"'in' expected": "očekávalo se klíčové slovo in",
			"'through' or 'to' expected": "očekávala se hodnota through nebo to",
			"'{0}'": "'{0}'",
			"( expected": "očekával se znak (",
			") expected": "očekával se znak )",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "pravidlo @font-face musí definovat vlastnosti src a font-family",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Seznam vlastností, které nejsou ověřovány podle pravidla unknownProperties",
			"Adds quotes to a string.": "Přidá uvozovky do řetězce.",
			"Also define the standard property '{0}' for compatibility": "Pro zajištění kompatibility také definujte standardní vlastnost {0}.",
			"Always define standard rule '@keyframes' when defining keyframes.": "Při definování klíčových snímků vždy definujte standardní pravidlo @keyframes.",
			"Always include all vendor specific properties: Missing: {0}": "Vždy zahrňte všechny vlastnosti specifické pro dodavatele: Chybí: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Vždy zahrnujte všechna pravidla specifická pro dodavatele: Chybí: {0}",
			"Appends a single value onto the end of a list.": "Připojí jednu hodnotu na konec seznamu.",
			"Appends selectors to one another without spaces in between.": "Připojí selektory k sobě navzájem bez mezer.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Nepoužívejte vlastnost !important. Indikuje, že specificita celého kódu CSS není pod kontrolou a vyžaduje refaktorování.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Nepoužívejte datový typ float. Při používání datového typu float se může kód CSS snadno poškodit, pokud se změní jeden aspekt rozložení.",
			"CSS Language Server": "Server jazyka CSS",
			"CSS fix is outdated and can't be applied to the document.": "Oprava funkce CSS je zastaralá a nedá se použít pro dokument.",
			"Causes one or more rules to be emitted at the root of the document.": "Způsobí, že se v kořenovém adresáři dokumentu vygeneruje jedno nebo více pravidel.",
			"Changes one or more properties of a color.": "Změní jednu nebo více vlastností barvy.",
			"Changes the alpha component for a color.": "Změní alfa komponentu pro barvu.",
			"Changes the hue of a color.": "Změní odstín barvy.",
			"Combines several lists into a single multidimensional list.": "Zkombinuje několik seznamů do jednoho multidimenzionálního seznamu.",
			"Converts a color into the format understood by IE filters.": "Převede barvu na formát, kterému rozumí filtry IE.",
			"Converts a color to grayscale.": "Převede barvu na stupně šedé.",
			"Converts a string to lower case.": "Převede řetězec na malá písmena.",
			"Converts a string to upper case.": "Převede řetězec na velká písmena.",
			"Converts a unitless number to a percentage.": "Převede číslo bez jednotek na procentuální hodnotu.",
			"Creates a Color from hue, saturation, and lightness values.": "Vytvoří barvu z hodnot odstínu, sytosti a světlosti.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Vytvoří barvu z hodnot odstín, sytost, světlost a alfa.",
			"Creates a Color from hue, white, and black values.": "Vytvoří barvu z odstínu, bílé a černé hodnoty.",
			"Creates a Color from lightness, a, and b values.": "Vytvoří barvu z hodnot světlost, a b.",
			"Creates a Color from lightness, chroma, and hue values.": "Vytvoří barvu z hodnot světlosti, chromy a odstínu.",
			"Creates a Color from red, green, and blue values.": "Vytvoří barvu z hodnot červená, zelená a modrá.",
			"Creates a Color from red, green, blue, and alpha values.": "Vytvoří barvu z hodnot červená, zelená, modrá a alfa.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Vytvoří barvu z hodnot odstínu, sytosti a světlosti jiné barvy.",
			"Creates a Color from the hue, white, and black values of another Color.": "Vytvoří barvu z odstínu, bílé a černé hodnoty jiné barvy.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Vytvoří barvu z hodnot světlosti a hodnot A a B jiné barvy.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Vytvoří barvu z hodnot světlosti, chromy a odstínu jiné barvy.",
			"Creates a Color from the red, green, and blue values of another Color.": "Vytvoří barvu z červené, zelené a modré hodnoty jiné barvy.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Vytvoří barvu v konkrétním barevném prostoru z červených, zelených a modrých hodnot.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Vytvoří barvu v konkrétním barevném prostoru z červené, zelené a modré hodnoty jiné barvy.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Definuje komplexní operace, které lze znovu použít v šablonách stylů.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Definuje styly, které lze znovu použít v celé šabloně stylů pomocí @include.",
			"Do not use duplicate style definitions": "Nepoužívejte duplicitní definice stylů.",
			"Do not use empty rulesets": "Nepoužívejte prázdné sady pravidel.",
			"Do not use width or height when using padding or border": "Při použití odsazení nebo ohraničení nepoužívejte šířku ani výšku.",
			"Dynamically calls a Sass function.": "Dynamicky volá funkci Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Každá smyčka, která nastaví $var na každou položku v seznamu nebo mapě, pak vypíše styly, které obsahuje, pomocí této hodnoty $var.",
			"Exposes the details of Sass’s inner workings.": "Zpřístupňuje podrobnosti o vnitřních operacích Sass.",
			"Extends $extendee with $extender within $selector.": "Rozšíří $extendee o $extender v rámci $selector.",
			"Extracts a substring from $string.": "Extrahuje podřetězec z řetězce $string.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "Nepovedlo se použít opravu CSS pro dokument. Zvažte prosím otevření problému s postupem pro reprodukci.",
			"Finds the maximum of several numbers.": "Vyhledá maximum několika čísel.",
			"Finds the minimum of several numbers.": "Vyhledá minimum několika čísel.",
			"Fluidly scales one or more properties of a color.": "Plynule škáluje jednu nebo více vlastností barvy.",
			"Folding Region End": "Konec oblasti sbalení",
			"Folding Region Start": "Začátek oblasti sbalení",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Smyčka For, která opakovaně vypisuje sadu stylů pro každý $var v klauzuli from/through nebo from/to.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Vygeneruje nové barvy na základě existujících a usnadní tak vytváření barevných motivů.",
			"Gets the blue component of a color.": "Získá modrou komponentu barvy.",
			"Gets the green component of a color.": "Získá zelenou komponentu barvy.",
			"Gets the hue component of a color.": "Získá komponentu odstínu barvy.",
			"Gets the lightness component of a color.": "Získá komponentu světlosti barvy.",
			"Gets the opacity component of a color.": "Získá komponentu neprůhlednosti barvy.",
			"Gets the red component of a color.": "Získá červenou komponentu barvy.",
			"Gets the saturation component of a color.": "Získá komponentu sytosti barvy.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Šestnáctkové barvy se musí skládat ze tří, čtyř, šesti nebo osmi šestnáctkových čísel.",
			"IE hacks are only necessary when supporting IE7 and older": "IE hacky jsou nezbytné pouze pro podporu Internet Exploreru 7 a starších verzí.",
			"Import statements do not load in parallel": "Příkazy importu se nenačítají paralelně.",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Zahrne obsah, pokud se výraz nevyhodnotí jako false nebo null.",
			"Includes the styles defined by another mixin into the current rule.": "Zahrne do aktuálního pravidla styly definované jiným mixinem.",
			"Increases or decreases one or more components of a color.": "Zvětšuje nebo zmenšuje jednu nebo více komponent barvy.",
			"Inherits the styles of another selector.": "Dědí styly jiného selektoru.",
			"Insert url() Function": "Vložit funkci url()",
			"Insert url() Functions": "Vložit funkce url()",
			"Inserts $insert into $string at $index.": "Vloží $insert do $string v $index.",
			"Invalid number of parameters": "Neplatný počet parametrů.",
			"Joins together two lists into one.": "Spojí dva seznamy do jednoho.",
			"Lets you access and modify values in lists.": "Umožňuje přistupovat k hodnotám v seznamech a upravovat je.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Načte šablonu stylů Sass a zpřístupní její mixiny, funkce a proměnné při načtení této šablony stylů s pravidlem @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Načte mixiny, funkce a proměnné z jiných šablon stylů Sass jako hodnoty modules a zkombinuje šablony stylů CSS z několika šablon stylů.",
			"Makes a color darker.": "Ztmaví barvu.",
			"Makes a color less saturated.": "Sníží sytost barvy.",
			"Makes a color lighter.": "Zesvětlí barvu.",
			"Makes a color more opaque.": "Změní barvu na průhlednější.",
			"Makes a color more saturated.": "Zvýší sytost barvy.",
			"Makes a color more transparent.": "Zprůhlední barvu.",
			"Makes it easy to combine, search, or split apart strings.": "Usnadňuje kombinování, hledání nebo rozdělení řetězců.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Umožňuje vyhledat hodnotu přidruženou ke klíči na mapě a mnoho dalšího.",
			"Merges two maps together into a new map.": "Sloučí dvě mapy dohromady do nové mapy.",
			"Mix two colors together in a polar color space.": "Kombinace dvou barev v polárním barevném prostoru.",
			"Mix two colors together in a rectangular color space.": "Kombinace dvou barev v obdélníkovém barevném prostoru.",
			"Mixes two colors together.": "Smíchá dvě barvy dohromady.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Vnoří selektory pod sebe, jako by byly vnořené v šabloně stylů.",
			"No unit for zero needed": "Pro nulu nejsou potřeba žádné jednotky.",
			"Parses a selector into the format returned by &.": "Parsuje selektor do formátu vráceného příkazem &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Vytiskne hodnotu výrazu do standardního chybového výstupního datového proudu. Užitečné pro ladění složitých souborů Sass.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Vytiskne hodnotu výrazu do standardního chybového výstupního datového proudu. Užitečné pro knihovny, které potřebují varovat uživatele před vyřazením nebo zotavením z menších chyb použití mixinů. Upozornění je možné vypnout pomocí možnosti příkazového řádku --quiet nebo možnosti Sass :quiet.",
			"Property is ignored due to the display.": "Vlastnost se ignoruje z důvodu zobrazení.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Vlastnost se ignoruje z důvodu zobrazení. Při použití hodnoty display: block by se svislé zarovnání nemělo používat.",
			"Provides access to Sass’s powerful selector engine.": "Poskytuje přístup k výkonnému modulu selekce Sass.",
			"Provides functions that operate on numbers.": "Poskytne funkce, které pracují s čísly.",
			"Removes quotes from a string.": "Odebere uvozovky z řetězce.",
			"Rename to '{0}'": "Přejmenovat na {0}",
			"Replaces $original with $replacement within $selector.": "Nahradí $original hodnotou $replacement v rámci selektoru $selector.",
			"Replaces the nth item in a list.": "Nahradí n-tou položku v seznamu.",
			"Returns a list of all keys in a map.": "Vrátí seznam všech klíčů v mapě.",
			"Returns a list of all values in a map.": "Vrátí seznam všech hodnot v mapě.",
			"Returns a new map with keys removed.": "Vrátí novou mapu s odebranými klíči.",
			"Returns a random number.": "Vrátí náhodné číslo.",
			"Returns a specific item in a list.": "Vrátí konkrétní položku v seznamu.",
			"Returns the absolute value of a number.": "Vrátí absolutní hodnotu čísla.",
			"Returns the complement of a color.": "Vrátí doplněk barvy.",
			"Returns the index of the first occurance of $substring in $string.": "Vrátí index prvního výskytu $substring v $string.",
			"Returns the inverse of a color.": "Vrátí inverzní hodnotu barvy.",
			"Returns the keywords passed to a function that takes variable arguments.": "Vrátí klíčová slova předaná funkci, která přijímá argumenty proměnných.",
			"Returns the length of a list.": "Vrátí délku seznamu.",
			"Returns the number of characters in a string.": "Vrátí počet znaků v řetězci.",
			"Returns the position of a value within a list.": "Vrátí pozici hodnoty v seznamu.",
			"Returns the separator of a list.": "Vrátí oddělovač seznamu.",
			"Returns the simple selectors that comprise a compound selector.": "Vrátí jednoduché selektory, které tvoří složený selektor.",
			"Returns the string representation of a value as it would be represented in Sass.": "Vrátí řetězcovou reprezentaci hodnoty tak, jak by se reprezentovala v Sass.",
			"Returns the type of a value.": "Vrátí typ hodnoty.",
			"Returns the unit(s) associated with a number.": "Vrátí jednotky přidružené k číslu.",
			"Returns the value in a map associated with a given key.": "Vrátí hodnotu v mapě přidružené k danému klíči.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Vrátí, jestli hodnota $super odpovídá všem prvkům, kterým odpovídá $sub, a možná i dalším.",
			"Returns whether a feature exists in the current Sass runtime.": "Vrátí, jestli v aktuálním modulu runtime Sass existuje funkce.",
			"Returns whether a function with the given name exists.": "Vrátí, zda existuje funkce s daným názvem.",
			"Returns whether a map has a value associated with a given key.": "Vrátí, zda má mapa hodnotu přidruženou k danému klíči.",
			"Returns whether a mixin with the given name exists.": "Vrátí, zda existuje mixin s daným názvem.",
			"Returns whether a number has units.": "Vrátí, zda číslo obsahuje jednotky.",
			"Returns whether a variable with the given name exists in the current scope.": "Vrátí, zda proměnná se zadaným názvem existuje v aktuálním oboru.",
			"Returns whether a variable with the given name exists in the global scope.": "Vrátí, zda proměnná se zadaným názvem existuje v globálním oboru.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Vrátí, zda lze sečíst, odečíst nebo porovnat dvě čísla.",
			"Rounds a number down to the previous whole number.": "Zaokrouhlí číslo dolů na nejbližší celé číslo.",
			"Rounds a number to the nearest whole number.": "Zaokrouhlí číslo na nejbližší celé číslo.",
			"Rounds a number up to the next whole number.": "Zaokrouhlí číslo nahoru na nejbližší celé číslo.",
			"Sass documentation": "Dokumentace k Sass",
			"Selector Specificity": "Specifika selektoru",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Selektory by neměly obsahovat ID, protože tato pravidla jsou příliš pevně spojena s HTML.",
			"The universal selector (*) is known to be slow": "Univerzální selektor (*) bývá pomalý.",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Vyvolá hodnotu výrazu jako závažnou chybu s trasováním zásobníku. Hodí se pro ověřování argumentů pro mixiny a funkce.",
			"URI expected": "očekával se identifikátor URI",
			"URL encodes a string": "adresa URL kóduje řetězec",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Sjednocuje dva selektory k vytvoření selektoru, který odpovídá prvkům odpovídajícím oběma.",
			"Unknown at-rule.": "Neznámé pravidlo at",
			"Unknown property.": "Neznámá vlastnost",
			"Unknown property: '{0}'": "Neznámá vlastnost: {0}",
			"Unknown vendor specific property.": "Neznámá vlastnost specifická pro dodavatele",
			"When using a vendor-specific prefix also include the standard property": "Při použití předpony specifické pro dodavatele je potřeba uvést také standardní vlastnost.",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Při použití předpony specifické pro dodavatele nezapomeňte uvést i všechny ostatní vlastnosti specifické pro dodavatele.",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Smyčka While, která přebírá výraz a opakovaně vypisuje vnořené styly, dokud se příkaz nevyhodnotí jako false.",
			"[ expected": "očekával se znak [",
			"] expected": "očekával se znak ]",
			"absolute value of a number": "absolutní hodnota čísla",
			"arccosine - inverse of cosine function": "arkus kosinus – inverzní kosinus",
			"arcsine - inverse of sine function": "arkus sinus – inverzní sinus",
			"arctangent - inverse of tangent function": "arkus tangens – inverzní tangens",
			"argument from '{0}'": "argument z {0}",
			"at-rule or selector expected": "očekávalo se pravidlo at-rule nebo selektor",
			"at-rule unknown": "neznámé pravidlo at-rule",
			"bind the evaluation of a ruleset to each member of a list.": "vytvoří vazbu vyhodnocení sady pravidel s každým členem seznamu.",
			"calculates square root of a number": "vypočítá druhou odmocninu čísla",
			"colon expected": "očekávala se dvojtečka",
			"comma expected": "očekávala se čárka",
			"condition expected": "očekávala se podmínka",
			"converts numbers from one type into another": "převede čísla z jednoho typu na jiný",
			"converts to a %, e.g. 0.5 > 50%": "provede převod na %, např. 0,5 > 50 %",
			"cosine function": "kosinus",
			"creates a #AARRGGBB": "vytvoří #AARRGGBB",
			"creates a color": "vytvoří barvu",
			"dot expected": "očekávala se tečka",
			"escape string content": "obsah řídicího řetězce",
			"expression expected": "očekával se výraz",
			"first argument modulus second argument": "první argument je numerickým zbytkem druhého argumentu",
			"first argument raised to the power of the second argument": "první argument vyvolaný mocninou druhého argumentu",
			"generate a list spanning a range of values": "vygeneruje seznamu pokrývajícího rozsah hodnot",
			"identifier expected": "očekával se identifikátor",
			"identifier or variable expected": "očekával se identifikátor nebo proměnná",
			"identifier or wildcard expected": "očekával se identifikátor nebo zástupný znak",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "Vložený blok inline-block se ignoruje z důvodu hodnoty float. Pokud má float jinou hodnotu než none, pole se uvolní a hodnota display se považuje za block.",
			"inlines a resource and falls back to `url()`": "vloží prostředek a přejde zpět na url()",
			"media query expected": "očekával se dotaz na média",
			"number expected": "očekávalo se číslo",
			"operator expected": "očekával se operátor",
			"page directive or declaraton expected": "očekávala se direktiva stránky nebo deklarace",
			"parses a string to a color": "parsuje řetězec na barvu",
			"percentage expected": "očekávalo se procento",
			"property value expected": "očekávala se hodnota vlastnosti",
			"remove or change the unit of a dimension": "odebere nebo změní jednotku dimenze",
			"return `@color` 10% points darker": "vrátí @color o 10 % bodů tmavší",
			"return `@color` 10% points less saturated": "vrátí @color o 10 % bodů méně sytou",
			"return `@color` 10% points less transparent": "vrátí hodnotu @color o 10 % bodů méně průhlednou",
			"return `@color` 10% points lighter": "vrátí @color o 10 % bodů světlejší",
			"return `@color` 10% points more saturated": "vrátí @color o 10 % bodů sytější",
			"return `@color` 10% points more transparent": "vrátí @color o 10 % bodů průhlednější",
			"return `@color` with 50% transparency": "vrátí @color s 50% průhledností",
			"return `@color` with a 10 degree larger in hue": "vrátí @color s odstínem o 10 stupňů silnějším",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "pokud je @color1 is> 43% luma, vrátí @darkcolor, jinak vrátí @lightcolor; podívejte se na poznámky",
			"return a mix of `@color1` and `@color2`": "vrátí kombinaci @color1 a @color2",
			"returns a grey, 100% desaturated color": "vrátí šedou, 100% desaturovanou barvu",
			"returns a value at the specified position in the list": "vrátí hodnotu na zadané pozici v seznamu",
			"returns one of two values depending on a condition.": "vrátí jednu ze dvou hodnot v závislosti na podmínce.",
			"returns pi": "vrátí pí",
			"returns the `alpha` channel of `@color`": "vrátí kanál alpha pro @color",
			"returns the `blue` channel of `@color`": "vrátí kanál blue pro @color",
			"returns the `green` channel of `@color`": "vrátí kanál green pro @color",
			"returns the `hue` channel of `@color` in the HSL space": "vrátí kanál hue pro @color v prostoru HSL",
			"returns the `hue` channel of `@color` in the HSV space": "vrátí kanál hue pro @color v prostoru HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "vrátí kanál lightness pro @color v prostoru HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "vrátí hodnotu luma (perceptuální jas) pro @color",
			"returns the `red` channel of `@color`": "vrátí kanál red pro @color",
			"returns the `saturation` channel of `@color` in the HSL space": "vrátí kanál saturation pro @color v prostoru HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "vrátí kanál saturation pro @color v prostoru HSV",
			"returns the `value` channel of `@color` in the HSV space": "vrátí kanál value pro @color v prostoru HSV",
			"returns the lowest of one or more values": "vrátí nejnižší z jedné nebo více hodnot",
			"returns the number of elements in a value list": "vrátí počet elementů v seznamu hodnot",
			"rounds a number to a number of places": "zaokrouhlí číslo na několik míst",
			"rounds down to an integer": "zaokrouhlí dolů na datový typ integer",
			"rounds up to an integer": "zaokrouhlí nahoru na datový typ integer",
			"selector expected": "očekával se selektor",
			"semi-colon expected": "očekával se středník",
			"sine function": "sinus",
			"string literal expected": "očekává se řetězcový literál",
			"string replace": "nahrazení řetězce",
			"tangent function": "tangens",
			"term expected": "očekával se termín",
			"unknown keyword": "neznámé klíčové slovo",
			"uri or string expected": "očekával se identifikátor URI nebo řetězec",
			"variable name expected": "očekával se název proměnné",
			"variable value expected": "očekávala se proměnná hodnota",
			"whitespace expected": "očekával se prázdný znak",
			"wildcard expected": "očekával se zástupný znak",
			"{ expected": "očekával se znak {",
			"{0}, '{1}'": "{0}, {1}",
			"} expected": "očekával se znak }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "Nastavení css.colorDecorators.enable je zastaralé. Místo něj se používá nastavení editor.colorDecorators.",
			"css.completion.completePropertyWithSemicolon.desc": "Při dokončování vlastností CSS vkládat na konec řádku středník",
			"css.completion.triggerPropertyValueCompletion.desc": "Ve výchozím nastavení VS Code aktivuje dokončování hodnot vlastností po výběru vlastnosti CSS. Toto chování můžete pomocí tohoto nastavení zakázat.",
			"css.customData.desc": "Seznam relativních cest k souborům odkazující na soubory JSON používající [vlastní formát dat](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code při spuštění načítá vlastní data, aby se vylepšila podpora šablon stylů CSS pro vlastní vlastnosti (proměnné) CSS, direktivy at, pseudotřídy a pseudoelementy, které zadáte v souborech JSON.\r\n\r\nCesty k souborům jsou relativní vzhledem k pracovnímu prostoru a berou se v potaz jenom nastavení složek pracovního prostoru.",
			"css.format.braceStyle.desc": "Vložte složené závorky na stejný řádek jako pravidla (collapse) nebo vložte složené závorky na vlastní řádek (expand).",
			"css.format.enable.desc": "Umožňuje povolit nebo zakázat výchozí formátovací modul CSS.",
			"css.format.maxPreserveNewLines.desc": "Maximální počet konců řádků, které se mají zachovat v jednom bloku, pokud je povolená možnost #css.format.preserveNewLines#.",
			"css.format.newlineBetweenRules.desc": "Sady pravidel oddělte prázdným řádkem.",
			"css.format.newlineBetweenSelectors.desc": "Selektory oddělte novým řádkem.",
			"css.format.preserveNewLines.desc": "Určuje, jestli se mají před elementy zachovat stávající konce řádků.",
			"css.format.spaceAroundSelectorSeparator.desc": "Ujistěte se, že kolem oddělovačů selektorů >, +, ~ (např. a > b) je znak mezery.",
			"css.hover.documentation": "Zobrazí dokumentaci k vlastnostem a hodnotě v CSS při najetí myší.",
			"css.hover.references": "Po najetí myší zobrazovat odkazy na MDN pomocí šablon stylů CSS",
			"css.lint.argumentsInColorFunction.desc": "Neplatný počet parametrů",
			"css.lint.boxModel.desc": "Při použití vlastnosti padding nebo border nepoužívejte vlastnost width nebo height.",
			"css.lint.compatibleVendorPrefixes.desc": "Při použití předpony specifické pro dodavatele nezapomeňte uvést i všechny ostatní vlastnosti specifické pro dodavatele.",
			"css.lint.duplicateProperties.desc": "Nepoužívejte duplicitní definice stylů.",
			"css.lint.emptyRules.desc": "Nepoužívejte prázdné sady pravidel.",
			"css.lint.float.desc": "Nepoužívejte datový typ float. Při používání datového typu float se může kód CSS snadno poškodit, pokud se změní jeden aspekt rozložení.",
			"css.lint.fontFaceProperties.desc": "Pravidlo @font-face musí definovat vlastnosti src a font-family.",
			"css.lint.hexColorLength.desc": "Hexadecimální barvy musí být definovány 3, 4, 6 nebo 8 hexadecimálními (šestnáctkovými) číslicemi.",
			"css.lint.idSelector.desc": "Selektory by neměly obsahovat ID, protože tato pravidla jsou příliš pevně spojena s HTML.",
			"css.lint.ieHack.desc": "IE hacky jsou nezbytné pouze pro podporu Internetu Exploreru verze 7 a starších verzí.",
			"css.lint.importStatement.desc": "Příkazy importu se nenačítají paralelně.",
			"css.lint.important.desc": "Nepoužívejte vlastnost !important. Indikuje, že specificita celého kódu CSS není pod kontrolou a vyžaduje refaktorování.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "Vlastnost je ignorována kvůli vlastnosti display. Například s vlastností display: inline nemají vlastnosti width, height, margin-top, margin-bottom žádný vliv.",
			"css.lint.universalSelector.desc": "Univerzální selektor (*) bývá pomalý.",
			"css.lint.unknownAtRules.desc": "Neznámé pravidlo at",
			"css.lint.unknownProperties.desc": "Neznámá vlastnost",
			"css.lint.unknownVendorSpecificProperties.desc": "Neznámá vlastnost specifická pro dodavatele",
			"css.lint.validProperties.desc": "Seznam vlastností, které nejsou ověřovány podle pravidla unknownProperties",
			"css.lint.vendorPrefix.desc": "Při použití předpony specifické pro dodavatele je potřeba uvést také standardní vlastnost.",
			"css.lint.zeroUnits.desc": "Pro nulu nejsou potřeba žádné jednotky.",
			"css.title": "CSS",
			"css.trace.server.desc": "Umožňuje sledovat komunikaci mezi VS Code a serverem jazyka CSS.",
			"css.validate.desc": "Povolí nebo zakáže všechna ověřování.",
			"css.validate.title": "Řídí ověřování a závažnosti problémů jazyka CSS.",
			"description": "Poskytuje pokročilou jazykovou podporu pro soubory CSS, LESS a SCSS.",
			"displayName": "Funkce jazyka CSS",
			"less.colorDecorators.enable.deprecationMessage": "Nastavení less.colorDecorators.enable je zastaralé. Místo něj se používá nastavení editor.colorDecorators.",
			"less.completion.completePropertyWithSemicolon.desc": "Při dokončování vlastností CSS vkládat na konec řádku středník",
			"less.completion.triggerPropertyValueCompletion.desc": "Ve výchozím nastavení VS Code aktivuje dokončování hodnot vlastností po výběru vlastnosti CSS. Toto chování můžete pomocí tohoto nastavení zakázat.",
			"less.format.braceStyle.desc": "Vložte složené závorky na stejný řádek jako pravidla (collapse) nebo vložte složené závorky na vlastní řádek (expand).",
			"less.format.enable.desc": "Umožňuje povolit nebo zakázat výchozí formátovací modul LESS.",
			"less.format.maxPreserveNewLines.desc": "Maximální počet konců řádků, které se mají zachovat v jednom bloku, pokud je povolená možnost #less.format.preserveNewLines#.",
			"less.format.newlineBetweenRules.desc": "Sady pravidel oddělte prázdným řádkem.",
			"less.format.newlineBetweenSelectors.desc": "Selektory oddělte novým řádkem.",
			"less.format.preserveNewLines.desc": "Určuje, jestli se mají před elementy zachovat stávající konce řádků.",
			"less.format.spaceAroundSelectorSeparator.desc": "Ujistěte se, že kolem oddělovačů selektorů >, +, ~ (např. a > b) je znak mezery.",
			"less.hover.documentation": "Zobrazit dokumentaci k vlastnostem a hodnotě v LESS při najetí myší.",
			"less.hover.references": "Po najetí myší zobrazovat odkazy na MDN pomocí LESS",
			"less.lint.argumentsInColorFunction.desc": "Neplatný počet parametrů",
			"less.lint.boxModel.desc": "Při použití vlastnosti padding nebo border nepoužívejte vlastnost width nebo height.",
			"less.lint.compatibleVendorPrefixes.desc": "Při použití předpony specifické pro dodavatele nezapomeňte uvést i všechny ostatní vlastnosti specifické pro dodavatele.",
			"less.lint.duplicateProperties.desc": "Nepoužívejte duplicitní definice stylů.",
			"less.lint.emptyRules.desc": "Nepoužívejte prázdné sady pravidel.",
			"less.lint.float.desc": "Nepoužívejte datový typ float. Při používání datového typu float se může kód CSS snadno poškodit, pokud se změní jeden aspekt rozložení.",
			"less.lint.fontFaceProperties.desc": "Pravidlo @font-face musí definovat vlastnosti src a font-family.",
			"less.lint.hexColorLength.desc": "Hexadecimální barvy musí být definovány 3, 4, 6 nebo 8 hexadecimálními (šestnáctkovými) číslicemi.",
			"less.lint.idSelector.desc": "Selektory by neměly obsahovat ID, protože tato pravidla jsou příliš pevně spojena s HTML.",
			"less.lint.ieHack.desc": "IE hacky jsou nezbytné pouze pro podporu Internetu Exploreru verze 7 a starších verzí.",
			"less.lint.importStatement.desc": "Příkazy importu se nenačítají paralelně.",
			"less.lint.important.desc": "Nepoužívejte vlastnost !important. Indikuje, že specificita celého kódu CSS není pod kontrolou a vyžaduje refaktorování.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "Vlastnost je ignorována kvůli vlastnosti display. Například s vlastností display: inline nemají vlastnosti width, height, margin-top, margin-bottom žádný vliv.",
			"less.lint.universalSelector.desc": "Univerzální selektor (*) bývá pomalý.",
			"less.lint.unknownAtRules.desc": "Neznámé pravidlo at",
			"less.lint.unknownProperties.desc": "Neznámá vlastnost.",
			"less.lint.unknownVendorSpecificProperties.desc": "Neznámá vlastnost specifická pro dodavatele",
			"less.lint.validProperties.desc": "Seznam vlastností, které nejsou ověřovány podle pravidla unknownProperties",
			"less.lint.vendorPrefix.desc": "Při použití předpony specifické pro dodavatele je potřeba uvést také standardní vlastnost.",
			"less.lint.zeroUnits.desc": "Pro nulu nejsou potřeba žádné jednotky.",
			"less.title": "LESS",
			"less.validate.desc": "Povolí nebo zakáže všechna ověřování.",
			"less.validate.title": "Řídí ověřování a závažnosti problémů jazyka LESS.",
			"scss.colorDecorators.enable.deprecationMessage": "Nastavení scss.colorDecorators.enable je zastaralé. Místo něj se používá nastavení editor.colorDecorators.",
			"scss.completion.completePropertyWithSemicolon.desc": "Při dokončování vlastností CSS vkládat na konec řádku středník",
			"scss.completion.triggerPropertyValueCompletion.desc": "Ve výchozím nastavení VS Code aktivuje dokončování hodnot vlastností po výběru vlastnosti CSS. Toto chování můžete pomocí tohoto nastavení zakázat.",
			"scss.format.braceStyle.desc": "Vložte složené závorky na stejný řádek jako pravidla (collapse) nebo vložte složené závorky na vlastní řádek (expand).",
			"scss.format.enable.desc": "Umožňuje povolit nebo zakázat výchozí formátovací modul SCSS.",
			"scss.format.maxPreserveNewLines.desc": "Maximální počet konců řádků, které se mají zachovat v jednom bloku, pokud je povolená možnost #scss.format.preserveNewLines#.",
			"scss.format.newlineBetweenRules.desc": "Sady pravidel oddělte prázdným řádkem.",
			"scss.format.newlineBetweenSelectors.desc": "Selektory oddělte novým řádkem.",
			"scss.format.preserveNewLines.desc": "Určuje, jestli se mají před elementy zachovat stávající konce řádků.",
			"scss.format.spaceAroundSelectorSeparator.desc": "Ujistěte se, že kolem oddělovačů selektorů >, +, ~ (např. a > b) je znak mezery.",
			"scss.hover.documentation": "Zobrazí dokumentaci k vlastnostem a hodnotě v SCSS při najetí myší.",
			"scss.hover.references": "Po najetí myší zobrazovat odkazy na MDN pomocí SCSS",
			"scss.lint.argumentsInColorFunction.desc": "Neplatný počet parametrů",
			"scss.lint.boxModel.desc": "Při použití vlastnosti padding nebo border nepoužívejte vlastnost width nebo height.",
			"scss.lint.compatibleVendorPrefixes.desc": "Při použití předpony specifické pro dodavatele nezapomeňte uvést i všechny ostatní vlastnosti specifické pro dodavatele.",
			"scss.lint.duplicateProperties.desc": "Nepoužívejte duplicitní definice stylů.",
			"scss.lint.emptyRules.desc": "Nepoužívejte prázdné sady pravidel.",
			"scss.lint.float.desc": "Nepoužívejte datový typ float. Při používání datového typu float se může kód CSS snadno poškodit, pokud se změní jeden aspekt rozložení.",
			"scss.lint.fontFaceProperties.desc": "Pravidlo @font-face musí definovat vlastnosti src a font-family.",
			"scss.lint.hexColorLength.desc": "Hexadecimální barvy musí být definovány 3, 4, 6 nebo 8 hexadecimálními (šestnáctkovými) číslicemi.",
			"scss.lint.idSelector.desc": "Selektory by neměly obsahovat ID, protože tato pravidla jsou příliš pevně spojena s HTML.",
			"scss.lint.ieHack.desc": "IE hacky jsou nezbytné pouze pro podporu Internetu Exploreru verze 7 a starších verzí.",
			"scss.lint.importStatement.desc": "Příkazy importu se nenačítají paralelně.",
			"scss.lint.important.desc": "Nepoužívejte vlastnost !important. Indikuje, že specificita celého kódu CSS není pod kontrolou a vyžaduje refaktorování.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "Vlastnost je ignorována kvůli vlastnosti display. Například s vlastností display: inline nemají vlastnosti width, height, margin-top, margin-bottom žádný vliv.",
			"scss.lint.universalSelector.desc": "Univerzální selektor (*) bývá pomalý.",
			"scss.lint.unknownAtRules.desc": "Neznámé pravidlo at-rule.",
			"scss.lint.unknownProperties.desc": "Neznámá vlastnost",
			"scss.lint.unknownVendorSpecificProperties.desc": "Neznámá vlastnost specifická pro dodavatele",
			"scss.lint.validProperties.desc": "Seznam vlastností, které nejsou ověřovány podle pravidla unknownProperties",
			"scss.lint.vendorPrefix.desc": "Při použití předpony specifické pro dodavatele je potřeba uvést také standardní vlastnost.",
			"scss.lint.zeroUnits.desc": "Pro nulu nejsou potřeba žádné jednotky.",
			"scss.title": "SCSS (Sass)",
			"scss.validate.desc": "Povolí nebo zakáže všechna ověřování.",
			"scss.validate.title": "Řídí ověřování a závažnosti problémů jazyka SCSS."
		}
	}
}