{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "Nie można rozpoznać elementu $ref \"{0}\" w \"{1}\".",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Wartość domyślna. Używane przez sugestie.",
			"A descriptive title of the schema.": "Opisowy tytuł schematu.",
			"A long description of the schema. Used in hover menus and suggestions.": "Długi opis schematu. Używane w menu i sugestiach aktywowania.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Mapa nazw właściwości na tablicę nazw właściwości lub schemat. Tablica nazw właściwości oznacza, że właściwość nazwana w kluczu zależy od właściwości w tablicy znajdującej się w obiekcie, aby była prawidłowa. Jeśli wartość jest schematem, schemat jest stosowany do obiektu tylko wtedy, gdy właściwość w kluczu istnieje w obiekcie.",
			"A map of property names to schemas for each property.": "Mapa nazw właściwości do schematów dla każdej właściwości.",
			"A map of regular expressions on property names to schemas for matching properties.": "Mapa wyrażeń regularnych nazw właściwości do schematów w celu dopasowania właściwości.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Liczba, która powinna całkowicie podzielić bieżącą wartość (tj. nie zawiera reszty).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Wyrażenie regularne pasujące do ciągu. Nie jest niejawnie zakotwiczony.",
			"A schema which must not match.": "Schemat, który nie może być zgodny.",
			"A unique identifier for the schema.": "Unikatowy identyfikator schematu.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Wystąpienie tablicy jest prawidłowe względem elementu „contains”, jeśli co najmniej jeden z jego elementów jest prawidłowy względem danego schematu.",
			"An array of schemas, all of which must match.": "Tablica schematów, z których wszystkie muszą być zgodne.",
			"An array of schemas, exactly one of which must match.": "Tablica schematów, z których dokładnie jeden musi być zgodny.",
			"An array of schemas, where at least one must match.": "Tablica schematów, w której co najmniej jeden ze schematów musi być zgodny.",
			"An array of strings that lists the names of all properties required on this object.": "Tablica ciągów zawierająca nazwy wszystkich właściwości wymaganych w tym obiekcie.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Wystąpienie sprawdza poprawność tego słowa kluczowego, jeśli jego wartość jest równa wartości słowa kluczowego.",
			"Array does not contain required item.": "Tablica nie zawiera wymaganego elementu.",
			"Array has duplicate items.": "Tablica zawiera zduplikowane elementy.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "Tablica zawiera zbyt mało elementów zgodnych z ograniczeniem „contains”. Oczekiwano {0} lub więcej.",
			"Array has too few items. Expected {0} or more.": "Tablica zawiera za mało elementów. Oczekiwano {0} lub więcej.",
			"Array has too many items according to schema. Expected {0} or fewer.": "Tablica zawiera zbyt wiele elementów zgodnie ze schematem. Oczekiwano {0} lub mniej.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "Tablica zawiera zbyt wiele elementów zgodnych z ograniczeniem „contains”. Oczekiwano {0} lub mniej.",
			"Array has too many items. Expected {0} or fewer.": "Tablica zawiera zbyt wiele elementów. Oczekiwano {0} lub mniej.",
			"Colon expected": "Oczekiwano dwukropka",
			"Comments are not permitted in JSON.": "Komentarze nie są dozwolone w formacie JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Komentarze autorów schematów do czytelników lub osób utrzymujących schemat.",
			"Configure": "Konfiguruj",
			"Configured by extension: {0}": "Skonfigurowane przez rozszerzenie: {0}",
			"Configured in user settings": "Skonfigurowane w ustawieniach użytkownika",
			"Configured in workspace settings": "Skonfigurowane w ustawieniach obszaru roboczego",
			"Default value": "Wartość domyślna",
			"Describes the content encoding of a string property.": "Opisuje kodowanie zawartości właściwości ciągu.",
			"Describes the format expected for the value. By default, not used for validation": "Opisuje format oczekiwany dla wartości. Domyślnie nieużywane do sprawdzania poprawności",
			"Describes the media type of a string property.": "Opisuje typ nośnika właściwości ciągu.",
			"Downloading schemas is disabled through setting '{0}'": "Pobieranie schematów zostało wyłączone za pomocą ustawienia „{0}”",
			"Downloading schemas is disabled. Click to configure.": "Pobieranie schematów jest wyłączone. Kliknij, aby skonfigurować.",
			"Draft-03 schemas are not supported.": "Schematy wersji roboczej 03 nie są obsługiwane.",
			"Duplicate anchor declaration: '{0}'": "Zduplikowana deklaracja kotwicy: \"{0}\"",
			"Duplicate object key": "Zduplikowany klucz obiektu",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Schemat lub wartość logiczna. Jeśli schemat jest używany do sprawdzania poprawności wszystkich właściwości niezgodnych z właściwościami „properties”, „propertyNames” lub „patternProperties”. W przypadku wartości false wszystkie właściwości niezdefiniowane przez sąsiadujące słowa kluczowe spowodują niepowodzenie tego schematu.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Ciąg jednego z podstawowych typów schematów (liczba, liczba całkowita, null, tablica, obiekt, wartość logiczna, ciąg) lub tablica ciągów określająca podzbiór tych typów.",
			"End of file expected.": "Oczekiwano końca pliku.",
			"Expected a JSON object, array or literal.": "Oczekiwano obiektu JSON, tablicy lub literału.",
			"Expected comma": "Oczekiwano przecinka",
			"Expected comma or closing brace": "Oczekiwano przecinka lub zamykającego nawiasu klamrowego",
			"Expected comma or closing bracket": "Oczekiwano przecinka lub nawiasu zamykającego",
			"Failed to sort the JSONC document, please consider opening an issue.": "Nie można posortować dokumentu JSONC. Rozważ otwarcie problemu.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "W przypadku tablic tylko wtedy, gdy elementy są ustawiane jako tablica. Jeśli elementy są schematem, ten schemat sprawdza poprawność elementów po elementach określonych przez schemat elementów. W przypadku wartości false dodatkowe elementy spowodują niepowodzenie sprawdzania poprawności.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Dla tablic. Może to być schemat do sprawdzania poprawności każdego elementu lub tablica schematów w celu zweryfikowania każdego elementu w kolejności (pierwszy schemat zweryfikuje pierwszy element, drugi schemat zweryfikuje drugi element itd.).",
			"If all of the items in the array must be unique. Defaults to false.": "Jeśli wszystkie elementy w tablicy muszą być unikatowe. Wartość domyślna to false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Jeśli wystąpienie jest obiektem, to słowo kluczowe sprawdza, czy każda nazwa właściwości w wystąpieniu sprawdza poprawność względem podanego schematu.",
			"Incorrect type. Expected \"{0}\".": "Nieprawidłowy typ. Oczekiwano „{0}”.",
			"Incorrect type. Expected one of {0}.": "Nieprawidłowy typ. Oczekiwano jednego z {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Wskazuje, że wartość wystąpienia jest zarządzana wyłącznie przez organ będący właścicielem.",
			"Invalid characters in string. Control characters must be escaped.": "Nieprawidłowe znaki w ciągu. Znaki kontrolne muszą być zmienione.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Nieprawidłowy format koloru. Użyj formatu #RGB, #RGBA, #RRGGBB lub #RRGGBBAA.",
			"Invalid escape character in string.": "Nieprawidłowy znak ucieczki w ciągu.",
			"Invalid number format.": "Nieprawidłowy format liczb.",
			"Invalid unicode sequence in string.": "Nieprawidłowa sekwencja unicode w ciągu.",
			"Item does not match any validation rule from the array.": "Element nie jest zgodny z żadną regułą poprawności z tablicy.",
			"JSON Language Server": "Serwer języka JSON",
			"JSON Outline Status": "Stan konspektu JSON",
			"JSON Validation Status": "Stan weryfikacji JSON",
			"JSON schema cache cleared.": "Wyczyszczono pamięć podręczną schematu JSON.",
			"JSON schema configured": "Skonfigurowano schemat JSON",
			"JSON: Schema Resolution Error": "JSON: błąd rozpoznawania schematu",
			"Learn more about JSON schema configuration...": "Dowiedz się więcej o konfiguracji schematu JSON...",
			"Loading JSON info": "Ładowanie informacji JSON",
			"Makes the maximum property exclusive.": "Sprawia, że właściwość maksymalna jest wyłączna.",
			"Makes the minimum property exclusive.": "Powoduje, że właściwość minimalna jest wyłączna.",
			"Matches a schema that is not allowed.": "Dopasowuje schemat, który jest niedozwolony.",
			"Matches multiple schemas when only one must validate.": "Dopasowuje wiele schematów, gdy tylko jeden musi zostać zweryfikowany.",
			"Missing property \"{0}\".": "Brak właściwości „{0}”.",
			"New array": "Nowa tablica",
			"New object": "Nowy obiekt",
			"No schema configured for this file": "Nie skonfigurowano schematu dla tego pliku",
			"No schema validation": "Brak weryfikacji schematu",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Nie jest używane do sprawdzania poprawności. Tutaj umieść schematy podrzędne, do których chcesz się odwoływać w tekście za pomocą $ref.",
			"Object has fewer properties than the required number of {0}": "Obiekt ma mniej właściwości niż wymagana liczba {0}",
			"Object has more properties than limit of {0}.": "Obiekt ma więcej właściwości niż limit {0}.",
			"Object is missing property {0} required by property {1}.": "W obiekcie brakuje właściwości {0} wymaganej przez właściwość {1}.",
			"Open Extension": "Otwórz rozszerzenie",
			"Open Settings": "Otwórz ustawienia",
			"Outline": "Konspekt",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problem z odczytem zawartości \"{0}\": wykryto UTF-8 z BOM, dozwolony jest tylko kod UTF 8.",
			"Problems loading reference '{0}': {1}": "Problemy z ładowaniem odwołania \"{0}\": {1}",
			"Property expected": "Oczekiwano właściwości",
			"Property keys must be doublequoted": "Klucze właściwości muszą mieć podwójny cudzysłów",
			"Property {0} is not allowed.": "Właściwość {0} nie jest dozwolona.",
			"Reference a definition hosted on any location.": "Odwołaj się do definicji hostowanej w dowolnej lokalizacji.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Przykładowe wartości JSON skojarzone z określonym schematem w celu zilustrowania użycia.",
			"Schema not found: {0}": "Nie znaleziono schematu: {0}",
			"Schema validated": "Sprawdzono poprawność schematu",
			"Select the schema to use for {0}": "Wybierz schemat, który ma być używany dla {0}",
			"Show Schemas": "Pokaż schematy",
			"Sort JSON": "Sortuj pliki JSON",
			"String does not match the pattern of \"{0}\".": "Ciąg nie jest zgodny ze wzorcem „{0}”.",
			"String is longer than the maximum length of {0}.": "Ciąg jest dłuższy niż maksymalna długość {0}.",
			"String is not a RFC3339 date-time.": "Ciąg nie jest datą/godziną RFC3339.",
			"String is not a RFC3339 date.": "Ciąg nie jest datą RFC3339.",
			"String is not a RFC3339 time.": "Ciąg nie jest czasem RFC3339.",
			"String is not a URI: {0}": "Ciąg nie jest identyfikatorem URI: {0}",
			"String is not a hostname.": "Ciąg nie jest nazwą hosta.",
			"String is not an IPv4 address.": "Ciąg nie jest adresem IPv4.",
			"String is not an IPv6 address.": "Ciąg nie jest adresem IPv6.",
			"String is not an e-mail address.": "Ciąg nie jest adresem e-mail.",
			"String is shorter than the minimum length of {0}.": "Długość ciągu jest mniejsza niż minimalna długość {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Schemat podrzędny „else” jest używany do sprawdzania poprawności, gdy schemat podrzędny „if” zakończy się niepowodzeniem.",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "Schemat podrzędny „then” jest używany do sprawdzania poprawności, gdy schemat podrzędny „if” zakończy się powodzeniem.",
			"The maximum length of a string.": "Maksymalna długość ciągu.",
			"The maximum number of items that can be inside an array. Inclusive.": "Maksymalna liczba elementów, które mogą znajdować się wewnątrz tablicy. All inclusive.",
			"The maximum number of properties an object can have. Inclusive.": "Maksymalna liczba właściwości, które może mieć obiekt. All inclusive.",
			"The maximum numerical value, inclusive by default.": "Maksymalna wartość liczbowa domyślnie włącznie.",
			"The minimum length of a string.": "Minimalna długość ciągu.",
			"The minimum number of items that can be inside an array. Inclusive.": "Minimalna liczba elementów, które mogą znajdować się wewnątrz tablicy. All inclusive.",
			"The minimum number of properties an object can have. Inclusive.": "Minimalna liczba właściwości, które może mieć obiekt. All inclusive.",
			"The minimum numerical value, inclusive by default.": "Minimalna wartość liczbowa domyślnie włącznie.",
			"The schema to verify this document against.": "Schemat, względem którego ma zostać zweryfikowany ten dokument.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Schemat używa funkcji meta-schematu ({0}), które nie są jeszcze obsługiwane przez moduł sprawdzania poprawności.",
			"The set of literal values that are valid.": "Zestaw prawidłowych wartości literału.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Wynik weryfikacji schematu podrzędnego „if” określa, które ze słów kluczowych „then” i „else” są oceniane.",
			"Trailing comma": "Przecinek końcowy",
			"URI expected.": "Oczekiwano identyfikatora URI.",
			"URI is expected.": "Oczekiwany jest identyfikator URI.",
			"URI with a scheme is expected.": "Oczekiwany jest identyfikator URI ze schematem.",
			"Unable to compute used schemas: No document": "Nie można obliczyć używanych schematów: brak dokumentu",
			"Unable to compute used schemas: {0}": "Nie można obliczyć używanych schematów: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Nie można załadować schematu z „{0}”: Brak dostępnej usługi żądania schematu",
			"Unable to load schema from '{0}': No content.": "Nie można załadować schematu z elementu \"{0}\": brak zawartości.",
			"Unable to load schema from '{0}': {1}.": "Nie można załadować schematu z elementu \"{0}\": {1}.",
			"Unable to load {0}": "Nie można załadować {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Nie można przeanalizować zawartości z elementu ''{0}'': błąd analizy przy przesunięciu {1}.",
			"Unable to resolve schema. Click to retry.": "Nie można rozpoznać schematu. Kliknij, aby ponowić próbę.",
			"Unexpected end of comment.": "Nieoczekiwany koniec komentarza.",
			"Unexpected end of number.": "Nieoczekiwany koniec liczby.",
			"Unexpected end of string.": "Nieoczekiwany koniec ciągu.",
			"Value expected": "Oczekiwano wartości",
			"Value is above the exclusive maximum of {0}.": "Wartość przekracza maksymalną wartość równą {0}.",
			"Value is above the maximum of {0}.": "Wartość jest większa niż maksimum {0}.",
			"Value is below the exclusive minimum of {0}.": "Wartość jest niższa niż wartość minimalna wyłączności wynosząca {0}.",
			"Value is below the minimum of {0}.": "Wartość jest mniejsza niż wartość minimalna {0}.",
			"Value is deprecated": "Wartość jest przestarzała",
			"Value is not accepted. Valid values: {0}.": "Wartość nie została zaakceptowana. Prawidłowe wartości: {0}.",
			"Value is not divisible by {0}.": "Wartość nie jest podzielna przez {0}.",
			"Value must be {0}.": "Wartość musi wynosić {0}.",
			"multiple JSON schemas configured": "Skonfigurowano wiele schematów JSON",
			"no JSON schema configured": "Nie skonfigurowano schematu JSON",
			"only {0} document symbols shown for performance reasons": "ze względów wydajnościowych, pokazywane są tylko {0} symbole dokumentów",
			"{0} is a directory, not a file": "{0} jest katalogiem, a nie plikiem"
		},
		"package": {
			"description": "Udostępnia zaawansowaną obsługę języka dla plików JSON.",
			"displayName": "Funkcje języka JSON",
			"json.clickToRetry": "Kliknij, aby ponowić próbę.",
			"json.colorDecorators.enable.deprecationMessage": "Ustawienie „json.colorDecorators.enable” jest przestarzałe na rzecz ustawienia „editor.colorDecorators”.",
			"json.colorDecorators.enable.desc": "Włącza lub wyłącza dekoratory kolorów",
			"json.command.clearCache": "Wyczyść pamięć podręczną schematu",
			"json.command.sort": "Sortuj dokument",
			"json.enableSchemaDownload.desc": "Po włączeniu schematy JSON mogą być pobierane z lokalizacji http i https.",
			"json.format.enable.desc": "Włącz/wyłącz domyślny program formatujący JSON",
			"json.format.keepLines.desc": "Zachowaj wszystkie istniejące nowe wiersze podczas formatowania.",
			"json.maxItemsComputed.desc": "Maksymalna liczba symboli konspektu i obliczonych regionów składania (ograniczenie ze względu na wydajność).",
			"json.maxItemsExceededInformation.desc": "Pokaż powiadomienie po przekroczeniu maksymalnej liczby symboli konspektu i regionów zwijania.",
			"json.schemaResolutionErrorMessage": "Nie można rozpoznać schematu.",
			"json.schemas.desc": "Skojarz schematy z plikami JSON w bieżącym projekcie.",
			"json.schemas.fileMatch.desc": "Tablica wzorców plików do dopasowania podczas rozwiązywania plików JSON do schematów. `*` i „**” mogą być używane jako symbole wieloznaczne. Można również zdefiniować wzorce wykluczeń, rozpoczynając je od symbolu „!”. Plik jest zgodny, gdy istnieje co najmniej jeden pasujący wzorzec, a ostatni pasujący wzorzec nie jest wzorcem wykluczenia.",
			"json.schemas.fileMatch.item.desc": "Wzorzec pliku, który może zawierać „*” i „**” do dopasowania podczas rozpoznawania plików JSON do schematów. Jeśli wartość zaczyna się od „!”, definiuje wzorzec wykluczenia.",
			"json.schemas.schema.desc": "Definicja schematu dla danego adresu URL. Należy podać tylko schemat, aby uniknąć dostępu do adresu URL schematu.",
			"json.schemas.url.desc": "Adres URL lub bezwzględna ścieżka do pliku schematu. Może być ścieżką względną (rozpoczynającą się od znaku „./”) w ustawieniach obszaru roboczego i folderu obszaru roboczego.",
			"json.tracing.desc": "Śledzi komunikację między programem VS Code i serwerem języka JSON.",
			"json.validate.enable.desc": "Włącz/wyłącz walidację kodu JSON."
		}
	}
}