{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"størë\" æ þøølëæñ tëst før lætër ëvælµætïøñ ïñ æ gµærð ør ïf().",
			"'from' expected": "'frøm' ëxpëçtëð",
			"'in' expected": "'ïñ' ëxpëçtëð",
			"'through' or 'to' expected": "'thrøµgh' ør 'tø' ëxpëçtëð",
			"'{0}'": "'{0}'",
			"( expected": "( ëxpëçtëð",
			") expected": ") ëxpëçtëð",
			"<undefined>": "<µñðëfïñëð>",
			"@font-face": "@føñt-fæçë",
			"@font-face rule must define 'src' and 'font-family' properties": "@føñt-fæçë rµlë mµst ðëfïñë 'srç' æñð 'føñt-fæmïlÿ' prøpërtïës",
			"@keyframes {0}": "@këÿfræmës {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Æ lïst øf prøpërtïës thæt ærë ñøt vælïðætëð ægæïñst thë `µñkñøwñPrøpërtïës` rµlë.",
			"Adds quotes to a string.": "Æððs qµøtës tø æ strïñg.",
			"Also define the standard property '{0}' for compatibility": "Ælsø ðëfïñë thë stæñðærð prøpërtÿ '{0}' før çømpætïþïlïtÿ",
			"Always define standard rule '@keyframes' when defining keyframes.": "Ælwæÿs ðëfïñë stæñðærð rµlë '@këÿfræmës' whëñ ðëfïñïñg këÿfræmës.",
			"Always include all vendor specific properties: Missing: {0}": "Ælwæÿs ïñçlµðë æll vëñðør spëçïfïç prøpërtïës: Mïssïñg: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Ælwæÿs ïñçlµðë æll vëñðør spëçïfïç rµlës: Mïssïñg: {0}",
			"Appends a single value onto the end of a list.": "Æppëñðs æ sïñglë vælµë øñtø thë ëñð øf æ lïst.",
			"Appends selectors to one another without spaces in between.": "Æppëñðs sëlëçtørs tø øñë æñøthër wïthøµt spæçës ïñ þëtwëëñ.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Ævøïð µsïñg !ïmpørtæñt. Ït ïs æñ ïñðïçætïøñ thæt thë spëçïfïçïtÿ øf thë ëñtïrë Ç§§ hæs gøttëñ øµt øf çøñtrøl æñð ñëëðs tø þë rëfæçtørëð.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Ævøïð µsïñg 'fløæt'. Fløæts lëæð tø frægïlë Ç§§ thæt ïs ëæsÿ tø þrëæk ïf øñë æspëçt øf thë læÿøµt çhæñgës.",
			"Causes one or more rules to be emitted at the root of the document.": "Çæµsës øñë ør mørë rµlës tø þë ëmïttëð æt thë røøt øf thë ðøçµmëñt.",
			"Changes one or more properties of a color.": "Çhæñgës øñë ør mørë prøpërtïës øf æ çølør.",
			"Changes the alpha component for a color.": "Çhæñgës thë ælphæ çømpøñëñt før æ çølør.",
			"Changes the hue of a color.": "Çhæñgës thë hµë øf æ çølør.",
			"Character entity representing '{0}'": "Çhæræçtër ëñtïtÿ rëprësëñtïñg '{0}'",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Çhæræçtër ëñtïtÿ rëprësëñtïñg '{0}', µñïçøðë ëqµïvælëñt '{1}'",
			"Closing bracket expected.": "Çløsïñg þræçkët ëxpëçtëð.",
			"Closing bracket missing.": "Çløsïñg þræçkët mïssïñg.",
			"Combines several lists into a single multidimensional list.": "Çømþïñës sëvëræl lïsts ïñtø æ sïñglë mµltïðïmëñsïøñæl lïst.",
			"Configure": "Çøñfïgµrë",
			"Converts a color into the format understood by IE filters.": "Çøñvërts æ çølør ïñtø thë førmæt µñðërstøøð þÿ ÏË fïltërs.",
			"Converts a color to grayscale.": "Çøñvërts æ çølør tø græÿsçælë.",
			"Converts a string to lower case.": "Çøñvërts æ strïñg tø løwër çæsë.",
			"Converts a string to upper case.": "Çøñvërts æ strïñg tø µppër çæsë.",
			"Converts a unitless number to a percentage.": "Çøñvërts æ µñïtlëss ñµmþër tø æ përçëñtægë.",
			"Creates a Color from hue, saturation, and lightness values.": "Çrëætës æ Çølør frøm hµë, sætµrætïøñ, æñð lïghtñëss vælµës.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Çrëætës æ Çølør frøm hµë, sætµrætïøñ, lïghtñëss, æñð ælphæ vælµës.",
			"Creates a Color from hue, white, and black values.": "Çrëætës æ Çølør frøm hµë, whïtë, æñð þlæçk vælµës.",
			"Creates a Color from lightness, a, and b values.": "Çrëætës æ Çølør frøm lïghtñëss, æ, æñð þ vælµës.",
			"Creates a Color from lightness, chroma, and hue values.": "Çrëætës æ Çølør frøm lïghtñëss, çhrømæ, æñð hµë vælµës.",
			"Creates a Color from red, green, and blue values.": "Çrëætës æ Çølør frøm rëð, grëëñ, æñð þlµë vælµës.",
			"Creates a Color from red, green, blue, and alpha values.": "Çrëætës æ Çølør frøm rëð, grëëñ, þlµë, æñð ælphæ vælµës.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Çrëætës æ Çølør frøm thë hµë, sætµrætïøñ, æñð lïghtñëss vælµës øf æñøthër Çølør.",
			"Creates a Color from the hue, white, and black values of another Color.": "Çrëætës æ Çølør frøm thë hµë, whïtë, æñð þlæçk vælµës øf æñøthër Çølør.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Çrëætës æ Çølør frøm thë lïghtñëss, æ, æñð þ vælµës øf æñøthër Çølør.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Çrëætës æ Çølør frøm thë lïghtñëss, çhrømæ, æñð hµë vælµës øf æñøthër Çølør.",
			"Creates a Color from the red, green, and blue values of another Color.": "Çrëætës æ Çølør frøm thë rëð, grëëñ, æñð þlµë vælµës øf æñøthër Çølør.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Çrëætës æ Çølør ïñ æ spëçïfïç çølør spæçë frøm rëð, grëëñ, æñð þlµë vælµës.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Çrëætës æ Çølør ïñ æ spëçïfïç çølør spæçë frøm thë rëð, grëëñ, æñð þlµë vælµës øf æñøthër Çølør.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Ðëfïñës çømplëx øpërætïøñs thæt çæñ þë rë-µsëð thrøµghøµt stÿlëshëëts.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Ðëfïñës stÿlës thæt çæñ þë rë-µsëð thrøµghøµt thë stÿlëshëët wïth `@ïñçlµðë`.",
			"Do not use duplicate style definitions": "Ðø ñøt µsë ðµplïçætë stÿlë ðëfïñïtïøñs",
			"Do not use empty rulesets": "Ðø ñøt µsë ëmptÿ rµlësëts",
			"Do not use width or height when using padding or border": "Ðø ñøt µsë wïðth ør hëïght whëñ µsïñg pæððïñg ør þørðër",
			"Dynamically calls a Sass function.": "Ðÿñæmïçællÿ çælls æ §æss fµñçtïøñ.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Ëæçh løøp thæt sëts `$vær` tø ëæçh ïtëm ïñ thë lïst ør mæp, thëñ øµtpµts thë stÿlës ït çøñtæïñs µsïñg thæt vælµë øf `$vær`.",
			"End tag name expected.": "Ëñð tæg ñæmë ëxpëçtëð.",
			"Exposes the details of Sass’s inner workings.": "Ëxpøsës thë ðëtæïls øf §æss’s ïññër wørkïñgs.",
			"Extends $extendee with $extender within $selector.": "Ëxtëñðs $ëxtëñðëë wïth $ëxtëñðër wïthïñ $sëlëçtør.",
			"Extracts a substring from $string.": "Ëxtræçts æ sµþstrïñg frøm $strïñg.",
			"Finds the maximum of several numbers.": "Fïñðs thë mæxïmµm øf sëvëræl ñµmþërs.",
			"Finds the minimum of several numbers.": "Fïñðs thë mïñïmµm øf sëvëræl ñµmþërs.",
			"Fluidly scales one or more properties of a color.": "Flµïðlÿ sçælës øñë ør mørë prøpërtïës øf æ çølør.",
			"Folding Region End": "Følðïñg Rëgïøñ Ëñð",
			"Folding Region Start": "Følðïñg Rëgïøñ §tært",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Før løøp thæt rëpëætëðlÿ øµtpµts æ sët øf stÿlës før ëæçh `$vær` ïñ thë `frøm/thrøµgh` ør `frøm/tø` çlæµsë.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Gëñërætës ñëw çølørs þæsëð øñ ëxïstïñg øñës, mækïñg ït ëæsÿ tø þµïlð çølør thëmës.",
			"Gets the blue component of a color.": "Gëts thë þlµë çømpøñëñt øf æ çølør.",
			"Gets the green component of a color.": "Gëts thë grëëñ çømpøñëñt øf æ çølør.",
			"Gets the hue component of a color.": "Gëts thë hµë çømpøñëñt øf æ çølør.",
			"Gets the lightness component of a color.": "Gëts thë lïghtñëss çømpøñëñt øf æ çølør.",
			"Gets the opacity component of a color.": "Gëts thë øpæçïtÿ çømpøñëñt øf æ çølør.",
			"Gets the red component of a color.": "Gëts thë rëð çømpøñëñt øf æ çølør.",
			"Gets the saturation component of a color.": "Gëts thë sætµrætïøñ çømpøñëñt øf æ çølør.",
			"HTML Language Server": "HTM£ £æñgµægë §ërvër",
			"Hex colors must consist of three, four, six or eight hex numbers": "Hëx çølørs mµst çøñsïst øf thrëë, føµr, sïx ør ëïght hëx ñµmþërs",
			"IE hacks are only necessary when supporting IE7 and older": "ÏË hæçks ærë øñlÿ ñëçëssærÿ whëñ sµppørtïñg ÏË7 æñð ølðër",
			"Import statements do not load in parallel": "Ïmpørt stætëmëñts ðø ñøt løæð ïñ pærællël",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Ïñçlµðës thë þøðÿ ïf thë ëxprëssïøñ ðøës ñøt ëvælµætë tø `fælsë` ør `ñµll`.",
			"Includes the styles defined by another mixin into the current rule.": "Ïñçlµðës thë stÿlës ðëfïñëð þÿ æñøthër mïxïñ ïñtø thë çµrrëñt rµlë.",
			"Increases or decreases one or more components of a color.": "Ïñçrëæsës ør ðëçrëæsës øñë ør mørë çømpøñëñts øf æ çølør.",
			"Inherits the styles of another selector.": "Ïñhërïts thë stÿlës øf æñøthër sëlëçtør.",
			"Inserts $insert into $string at $index.": "Ïñsërts $ïñsërt ïñtø $strïñg æt $ïñðëx.",
			"Invalid number of parameters": "Ïñvælïð ñµmþër øf pæræmëtërs",
			"Joins together two lists into one.": "Jøïñs tøgëthër twø lïsts ïñtø øñë.",
			"Lets you access and modify values in lists.": "£ëts ÿøµ æççëss æñð møðïfÿ vælµës ïñ lïsts.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "£øæðs æ §æss stÿlëshëët æñð mækës ïts mïxïñs, fµñçtïøñs, æñð værïæþlës ævæïlæþlë whëñ thïs stÿlëshëët ïs løæðëð wïth thë @µsë rµlë.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "£øæðs mïxïñs, fµñçtïøñs, æñð værïæþlës frøm øthër §æss stÿlëshëëts æs 'møðµlës', æñð çømþïñës Ç§§ frøm mµltïplë stÿlëshëëts tøgëthër.",
			"Makes a color darker.": "Mækës æ çølør ðærkër.",
			"Makes a color less saturated.": "Mækës æ çølør lëss sætµrætëð.",
			"Makes a color lighter.": "Mækës æ çølør lïghtër.",
			"Makes a color more opaque.": "Mækës æ çølør mørë øpæqµë.",
			"Makes a color more saturated.": "Mækës æ çølør mørë sætµrætëð.",
			"Makes a color more transparent.": "Mækës æ çølør mørë træñspærëñt.",
			"Makes it easy to combine, search, or split apart strings.": "Mækës ït ëæsÿ tø çømþïñë, sëærçh, ør splït æpært strïñgs.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Mækës ït pøssïþlë tø løøk µp thë vælµë æssøçïætëð wïth æ këÿ ïñ æ mæp, æñð mµçh mørë.",
			"Merges two maps together into a new map.": "Mërgës twø mæps tøgëthër ïñtø æ ñëw mæp.",
			"Mix two colors together in a polar color space.": "Mïx twø çølørs tøgëthër ïñ æ pølær çølør spæçë.",
			"Mix two colors together in a rectangular color space.": "Mïx twø çølørs tøgëthër ïñ æ rëçtæñgµlær çølør spæçë.",
			"Mixes two colors together.": "Mïxës twø çølørs tøgëthër.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Ñësts sëlëçtør þëñëæth øñë æñøthër lïkë thëÿ wøµlð þë ñëstëð ïñ thë stÿlëshëët.",
			"No unit for zero needed": "Ñø µñït før zërø ñëëðëð",
			"Parses a selector into the format returned by &.": "Pærsës æ sëlëçtør ïñtø thë førmæt rëtµrñëð þÿ &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Prïñts thë vælµë øf æñ ëxprëssïøñ tø thë stæñðærð ërrør øµtpµt strëæm. Üsëfµl før ðëþµggïñg çømplïçætëð §æss fïlës.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Prïñts thë vælµë øf æñ ëxprëssïøñ tø thë stæñðærð ërrør øµtpµt strëæm. Üsëfµl før lïþrærïës thæt ñëëð tø wærñ µsërs øf ðëprëçætïøñs ør rëçøvërïñg frøm mïñør mïxïñ µsægë mïstækës. Wærñïñgs çæñ þë tµrñëð øff wïth thë `--qµïët` çømmæñð-lïñë øptïøñ ør thë `:qµïët` §æss øptïøñ.",
			"Property is ignored due to the display.": "Prøpërtÿ ïs ïgñørëð ðµë tø thë ðïsplæÿ.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Prøpërtÿ ïs ïgñørëð ðµë tø thë ðïsplæÿ. Wïth 'ðïsplæÿ: þløçk', vërtïçæl-ælïgñ shøµlð ñøt þë µsëð.",
			"Provides access to Sass’s powerful selector engine.": "Prøvïðës æççëss tø §æss’s pøwërfµl sëlëçtør ëñgïñë.",
			"Provides functions that operate on numbers.": "Prøvïðës fµñçtïøñs thæt øpërætë øñ ñµmþërs.",
			"Removes quotes from a string.": "Rëmøvës qµøtës frøm æ strïñg.",
			"Rename to '{0}'": "Rëñæmë tø '{0}'",
			"Replaces $original with $replacement within $selector.": "Rëplæçës $ørïgïñæl wïth $rëplæçëmëñt wïthïñ $sëlëçtør.",
			"Replaces the nth item in a list.": "Rëplæçës thë ñth ïtëm ïñ æ lïst.",
			"Returns a list of all keys in a map.": "Rëtµrñs æ lïst øf æll këÿs ïñ æ mæp.",
			"Returns a list of all values in a map.": "Rëtµrñs æ lïst øf æll vælµës ïñ æ mæp.",
			"Returns a new map with keys removed.": "Rëtµrñs æ ñëw mæp wïth këÿs rëmøvëð.",
			"Returns a random number.": "Rëtµrñs æ ræñðøm ñµmþër.",
			"Returns a specific item in a list.": "Rëtµrñs æ spëçïfïç ïtëm ïñ æ lïst.",
			"Returns the absolute value of a number.": "Rëtµrñs thë æþsølµtë vælµë øf æ ñµmþër.",
			"Returns the complement of a color.": "Rëtµrñs thë çømplëmëñt øf æ çølør.",
			"Returns the index of the first occurance of $substring in $string.": "Rëtµrñs thë ïñðëx øf thë fïrst øççµræñçë øf $sµþstrïñg ïñ $strïñg.",
			"Returns the inverse of a color.": "Rëtµrñs thë ïñvërsë øf æ çølør.",
			"Returns the keywords passed to a function that takes variable arguments.": "Rëtµrñs thë këÿwørðs pæssëð tø æ fµñçtïøñ thæt tækës værïæþlë ærgµmëñts.",
			"Returns the length of a list.": "Rëtµrñs thë lëñgth øf æ lïst.",
			"Returns the number of characters in a string.": "Rëtµrñs thë ñµmþër øf çhæræçtërs ïñ æ strïñg.",
			"Returns the position of a value within a list.": "Rëtµrñs thë pøsïtïøñ øf æ vælµë wïthïñ æ lïst.",
			"Returns the separator of a list.": "Rëtµrñs thë sëpærætør øf æ lïst.",
			"Returns the simple selectors that comprise a compound selector.": "Rëtµrñs thë sïmplë sëlëçtørs thæt çømprïsë æ çømpøµñð sëlëçtør.",
			"Returns the string representation of a value as it would be represented in Sass.": "Rëtµrñs thë strïñg rëprësëñtætïøñ øf æ vælµë æs ït wøµlð þë rëprësëñtëð ïñ §æss.",
			"Returns the type of a value.": "Rëtµrñs thë tÿpë øf æ vælµë.",
			"Returns the unit(s) associated with a number.": "Rëtµrñs thë µñït(s) æssøçïætëð wïth æ ñµmþër.",
			"Returns the value in a map associated with a given key.": "Rëtµrñs thë vælµë ïñ æ mæp æssøçïætëð wïth æ gïvëñ këÿ.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Rëtµrñs whëthër $sµpër mætçhës æll thë ëlëmëñts $sµþ ðøës, æñð pøssïþlÿ mørë.",
			"Returns whether a feature exists in the current Sass runtime.": "Rëtµrñs whëthër æ fëætµrë ëxïsts ïñ thë çµrrëñt §æss rµñtïmë.",
			"Returns whether a function with the given name exists.": "Rëtµrñs whëthër æ fµñçtïøñ wïth thë gïvëñ ñæmë ëxïsts.",
			"Returns whether a map has a value associated with a given key.": "Rëtµrñs whëthër æ mæp hæs æ vælµë æssøçïætëð wïth æ gïvëñ këÿ.",
			"Returns whether a mixin with the given name exists.": "Rëtµrñs whëthër æ mïxïñ wïth thë gïvëñ ñæmë ëxïsts.",
			"Returns whether a number has units.": "Rëtµrñs whëthër æ ñµmþër hæs µñïts.",
			"Returns whether a variable with the given name exists in the current scope.": "Rëtµrñs whëthër æ værïæþlë wïth thë gïvëñ ñæmë ëxïsts ïñ thë çµrrëñt sçøpë.",
			"Returns whether a variable with the given name exists in the global scope.": "Rëtµrñs whëthër æ værïæþlë wïth thë gïvëñ ñæmë ëxïsts ïñ thë gløþæl sçøpë.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Rëtµrñs whëthër twø ñµmþërs çæñ þë æððëð, sµþtræçtëð, ør çømpærëð.",
			"Rounds a number down to the previous whole number.": "Røµñðs æ ñµmþër ðøwñ tø thë prëvïøµs whølë ñµmþër.",
			"Rounds a number to the nearest whole number.": "Røµñðs æ ñµmþër tø thë ñëærëst whølë ñµmþër.",
			"Rounds a number up to the next whole number.": "Røµñðs æ ñµmþër µp tø thë ñëxt whølë ñµmþër.",
			"Sass documentation": "§æss ðøçµmëñtætïøñ",
			"Selector Specificity": "§ëlëçtør §pëçïfïçïtÿ",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "§ëlëçtørs shøµlð ñøt çøñtæïñ ÏÐs þëçæµsë thësë rµlës ærë tøø tïghtlÿ çøµplëð wïth thë HTM£.",
			"Simple HTML5 starting point": "§ïmplë HTM£5 stærtïñg pøïñt",
			"Start tag name expected.": "§tært tæg ñæmë ëxpëçtëð.",
			"Tag name must directly follow the open bracket.": "Tæg ñæmë mµst ðïrëçtlÿ følløw thë øpëñ þræçkët.",
			"The universal selector (*) is known to be slow": "Thë µñïvërsæl sëlëçtør (*) ïs kñøwñ tø þë sløw",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Thrøws thë vælµë øf æñ ëxprëssïøñ æs æ fætæl ërrør wïth stæçk træçë. Üsëfµl før vælïðætïñg ærgµmëñts tø mïxïñs æñð fµñçtïøñs.",
			"URI expected": "ÜRÏ ëxpëçtëð",
			"URL encodes a string": "ÜR£ ëñçøðës æ strïñg",
			"Unexpected character in tag.": "Üñëxpëçtëð çhæræçtër ïñ tæg.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Üñïfïës twø sëlëçtørs tø prøðµçë æ sëlëçtør thæt mætçhës ëlëmëñts mætçhëð þÿ þøth.",
			"Unknown at-rule.": "Üñkñøwñ æt-rµlë.",
			"Unknown property.": "Üñkñøwñ prøpërtÿ.",
			"Unknown property: '{0}'": "Üñkñøwñ prøpërtÿ: '{0}'",
			"Unknown vendor specific property.": "Üñkñøwñ vëñðør spëçïfïç prøpërtÿ.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "V§ Çøðë ñøw hæs þµïlt-ïñ sµppørt før æµtø-rëñæmïñg tægs. Ðø ÿøµ wæñt tø ëñæþlë ït?",
			"When using a vendor-specific prefix also include the standard property": "Whëñ µsïñg æ vëñðør-spëçïfïç prëfïx ælsø ïñçlµðë thë stæñðærð prøpërtÿ",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Whëñ µsïñg æ vëñðør-spëçïfïç prëfïx mækë sµrë tø ælsø ïñçlµðë æll øthër vëñðør-spëçïfïç prøpërtïës",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Whïlë løøp thæt tækës æñ ëxprëssïøñ æñð rëpëætëðlÿ øµtpµts thë ñëstëð stÿlës µñtïl thë stætëmëñt ëvælµætës tø `fælsë`.",
			"[ expected": "[ ëxpëçtëð",
			"] expected": "] ëxpëçtëð",
			"absolute value of a number": "æþsølµtë vælµë øf æ ñµmþër",
			"arccosine - inverse of cosine function": "ærççøsïñë - ïñvërsë øf çøsïñë fµñçtïøñ",
			"arcsine - inverse of sine function": "ærçsïñë - ïñvërsë øf sïñë fµñçtïøñ",
			"arctangent - inverse of tangent function": "ærçtæñgëñt - ïñvërsë øf tæñgëñt fµñçtïøñ",
			"argument from '{0}'": "ærgµmëñt frøm '{0}'",
			"at-rule or selector expected": "æt-rµlë ør sëlëçtør ëxpëçtëð",
			"at-rule unknown": "æt-rµlë µñkñøwñ",
			"bind the evaluation of a ruleset to each member of a list.": "þïñð thë ëvælµætïøñ øf æ rµlësët tø ëæçh mëmþër øf æ lïst.",
			"calculates square root of a number": "çælçµlætës sqµærë røøt øf æ ñµmþër",
			"colon expected": "çøløñ ëxpëçtëð",
			"comma expected": "çømmæ ëxpëçtëð",
			"condition expected": "çøñðïtïøñ ëxpëçtëð",
			"converts numbers from one type into another": "çøñvërts ñµmþërs frøm øñë tÿpë ïñtø æñøthër",
			"converts to a %, e.g. 0.5 > 50%": "çøñvërts tø æ %, ë.g. 0.5 > 50%",
			"cosine function": "çøsïñë fµñçtïøñ",
			"creates a #AARRGGBB": "çrëætës æ #ÆÆRRGGßß",
			"creates a color": "çrëætës æ çølør",
			"css.builtin.lab": "çss.þµïltïñ.læþ",
			"dot expected": "ðøt ëxpëçtëð",
			"escape string content": "ësçæpë strïñg çøñtëñt",
			"expression expected": "ëxprëssïøñ ëxpëçtëð",
			"first argument modulus second argument": "fïrst ærgµmëñt møðµlµs sëçøñð ærgµmëñt",
			"first argument raised to the power of the second argument": "fïrst ærgµmëñt ræïsëð tø thë pøwër øf thë sëçøñð ærgµmëñt",
			"generate a list spanning a range of values": "gëñërætë æ lïst spæññïñg æ ræñgë øf vælµës",
			"identifier expected": "ïðëñtïfïër ëxpëçtëð",
			"identifier or variable expected": "ïðëñtïfïër ør værïæþlë ëxpëçtëð",
			"identifier or wildcard expected": "ïðëñtïfïër ør wïlðçærð ëxpëçtëð",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "ïñlïñë-þløçk ïs ïgñørëð ðµë tø thë fløæt. Ïf 'fløæt' hæs æ vælµë øthër thæñ 'ñøñë', thë þøx ïs fløætëð æñð 'ðïsplæÿ' ïs trëætëð æs 'þløçk'",
			"inlines a resource and falls back to `url()`": "ïñlïñës æ rësøµrçë æñð fælls þæçk tø `µrl()`",
			"media query expected": "mëðïæ qµërÿ ëxpëçtëð",
			"number expected": "ñµmþër ëxpëçtëð",
			"operator expected": "øpërætør ëxpëçtëð",
			"page directive or declaraton expected": "pægë ðïrëçtïvë ør ðëçlærætøñ ëxpëçtëð",
			"parses a string to a color": "pærsës æ strïñg tø æ çølør",
			"percentage expected": "përçëñtægë ëxpëçtëð",
			"property value expected": "prøpërtÿ vælµë ëxpëçtëð",
			"remove or change the unit of a dimension": "rëmøvë ør çhæñgë thë µñït øf æ ðïmëñsïøñ",
			"return `@color` 10% points darker": "rëtµrñ `@çølør` 10% pøïñts ðærkër",
			"return `@color` 10% points less saturated": "rëtµrñ `@çølør` 10% pøïñts lëss sætµrætëð",
			"return `@color` 10% points less transparent": "rëtµrñ `@çølør` 10% pøïñts lëss træñspærëñt",
			"return `@color` 10% points lighter": "rëtµrñ `@çølør` 10% pøïñts lïghtër",
			"return `@color` 10% points more saturated": "rëtµrñ `@çølør` 10% pøïñts mørë sætµrætëð",
			"return `@color` 10% points more transparent": "rëtµrñ `@çølør` 10% pøïñts mørë træñspærëñt",
			"return `@color` with 50% transparency": "rëtµrñ `@çølør` wïth 50% træñspærëñçÿ",
			"return `@color` with a 10 degree larger in hue": "rëtµrñ `@çølør` wïth æ 10 ðëgrëë lærgër ïñ hµë",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "rëtµrñ `@ðærkçølør` ïf `@çølør1 ïs> 43% lµmæ` øthërwïsë rëtµrñ `@lïghtçølør`, sëë ñøtës",
			"return a mix of `@color1` and `@color2`": "rëtµrñ æ mïx øf `@çølør1` æñð `@çølør2`",
			"returns a grey, 100% desaturated color": "rëtµrñs æ grëÿ, 100% ðësætµrætëð çølør",
			"returns a value at the specified position in the list": "rëtµrñs æ vælµë æt thë spëçïfïëð pøsïtïøñ ïñ thë lïst",
			"returns one of two values depending on a condition.": "rëtµrñs øñë øf twø vælµës ðëpëñðïñg øñ æ çøñðïtïøñ.",
			"returns pi": "rëtµrñs pï",
			"returns the `alpha` channel of `@color`": "rëtµrñs thë `ælphæ` çhæññël øf `@çølør`",
			"returns the `blue` channel of `@color`": "rëtµrñs thë `þlµë` çhæññël øf `@çølør`",
			"returns the `green` channel of `@color`": "rëtµrñs thë `grëëñ` çhæññël øf `@çølør`",
			"returns the `hue` channel of `@color` in the HSL space": "rëtµrñs thë `hµë` çhæññël øf `@çølør` ïñ thë H§£ spæçë",
			"returns the `hue` channel of `@color` in the HSV space": "rëtµrñs thë `hµë` çhæññël øf `@çølør` ïñ thë H§V spæçë",
			"returns the `lightness` channel of `@color` in the HSL space": "rëtµrñs thë `lïghtñëss` çhæññël øf `@çølør` ïñ thë H§£ spæçë",
			"returns the `luma` value (perceptual brightness) of `@color`": "rëtµrñs thë `lµmæ` vælµë (përçëptµæl þrïghtñëss) øf `@çølør`",
			"returns the `red` channel of `@color`": "rëtµrñs thë `rëð` çhæññël øf `@çølør`",
			"returns the `saturation` channel of `@color` in the HSL space": "rëtµrñs thë `sætµrætïøñ` çhæññël øf `@çølør` ïñ thë H§£ spæçë",
			"returns the `saturation` channel of `@color` in the HSV space": "rëtµrñs thë `sætµrætïøñ` çhæññël øf `@çølør` ïñ thë H§V spæçë",
			"returns the `value` channel of `@color` in the HSV space": "rëtµrñs thë `vælµë` çhæññël øf `@çølør` ïñ thë H§V spæçë",
			"returns the lowest of one or more values": "rëtµrñs thë løwëst øf øñë ør mørë vælµës",
			"returns the number of elements in a value list": "rëtµrñs thë ñµmþër øf ëlëmëñts ïñ æ vælµë lïst",
			"rounds a number to a number of places": "røµñðs æ ñµmþër tø æ ñµmþër øf plæçës",
			"rounds down to an integer": "røµñðs ðøwñ tø æñ ïñtëgër",
			"rounds up to an integer": "røµñðs µp tø æñ ïñtëgër",
			"selector expected": "sëlëçtør ëxpëçtëð",
			"semi-colon expected": "sëmï-çøløñ ëxpëçtëð",
			"sine function": "sïñë fµñçtïøñ",
			"string literal expected": "strïñg lïtëræl ëxpëçtëð",
			"string replace": "strïñg rëplæçë",
			"tangent function": "tæñgëñt fµñçtïøñ",
			"term expected": "tërm ëxpëçtëð",
			"unknown keyword": "µñkñøwñ këÿwørð",
			"uri or string expected": "µrï ør strïñg ëxpëçtëð",
			"variable name expected": "værïæþlë ñæmë ëxpëçtëð",
			"variable value expected": "værïæþlë vælµë ëxpëçtëð",
			"whitespace expected": "whïtëspæçë ëxpëçtëð",
			"wildcard expected": "wïlðçærð ëxpëçtëð",
			"{ expected": "{ ëxpëçtëð",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "} ëxpëçtëð"
		},
		"package": {
			"description": "Prøvïðës rïçh læñgµægë sµppørt før HTM£ æñð Hæñðlëþær fïlës",
			"displayName": "HTM£ £æñgµægë Fëætµrës",
			"html.autoClosingTags": "Ëñæþlë/ðïsæþlë æµtøçløsïñg øf HTM£ tægs.",
			"html.autoCreateQuotes": "Ëñæþlë/ðïsæþlë æµtø çrëætïøñ øf qµøtës før HTM£ ættrïþµtë æssïgñmëñt. Thë tÿpë øf qµøtës çæñ þë çøñfïgµrëð þÿ `#html.çømplëtïøñ.ættrïþµtëÐëfæµltVælµë#`.",
			"html.completion.attributeDefaultValue": "Çøñtrøls thë ðëfæµlt vælµë før ættrïþµtës whëñ çømplëtïøñ ïs æççëptëð.",
			"html.completion.attributeDefaultValue.doublequotes": "Ættrïþµtë vælµë ïs sët tø \"\".",
			"html.completion.attributeDefaultValue.empty": "Ættrïþµtë vælµë ïs ñøt sët.",
			"html.completion.attributeDefaultValue.singlequotes": "Ættrïþµtë vælµë ïs sët tø ''.",
			"html.customData.desc": "Æ lïst øf rëlætïvë fïlë pæths pøïñtïñg tø J§ØÑ fïlës følløwïñg thë [çµstøm ðætæ førmæt](https://gïthµþ.çøm/mïçrøsøft/vsçøðë-html-læñgµægësërvïçë/þløþ/mæstër/ðøçs/çµstømÐætæ.mð).\r\n\r\nV§ Çøðë løæðs çµstøm ðætæ øñ stærtµp tø ëñhæñçë ïts HTM£ sµppørt før thë çµstøm HTM£ tægs, ættrïþµtës æñð ættrïþµtë vælµës ÿøµ spëçïfÿ ïñ thë J§ØÑ fïlës.\r\n\r\nThë fïlë pæths ærë rëlætïvë tø wørkspæçë æñð øñlÿ wørkspæçë følðër sëttïñgs ærë çøñsïðërëð.",
			"html.format.contentUnformatted.desc": "£ïst øf tægs, çømmæ sëpærætëð, whërë thë çøñtëñt shøµlðñ't þë rëførmættëð. `ñµll` ðëfæµlts tø thë `prë` tæg.",
			"html.format.enable.desc": "Ëñæþlë/ðïsæþlë ðëfæµlt HTM£ førmættër.",
			"html.format.extraLiners.desc": "£ïst øf tægs, çømmæ sëpærætëð, thæt shøµlð hævë æñ ëxtræ ñëwlïñë þëførë thëm. `ñµll` ðëfæµlts tø `\"hëæð, þøðÿ, /html\"`.",
			"html.format.indentHandlebars.desc": "Førmæt æñð ïñðëñt `{{#føø}}` æñð `{{/føø}}`.",
			"html.format.indentInnerHtml.desc": "Ïñðëñt `<hëæð>` æñð `<þøðÿ>` sëçtïøñs.",
			"html.format.maxPreserveNewLines.desc": "Mæxïmµm ñµmþër øf lïñë þrëæks tø þë prësërvëð ïñ øñë çhµñk. Üsë `ñµll` før µñlïmïtëð.",
			"html.format.preserveNewLines.desc": "Çøñtrøls whëthër ëxïstïñg lïñë þrëæks þëførë ëlëmëñts shøµlð þë prësërvëð. Øñlÿ wørks þëførë ëlëmëñts, ñøt ïñsïðë tægs ør før tëxt.",
			"html.format.templating.desc": "Høñør ðjæñgø, ërþ, hæñðlëþærs æñð php tëmplætïñg læñgµægë tægs.",
			"html.format.unformatted.desc": "£ïst øf tægs, çømmæ sëpærætëð, thæt shøµlðñ't þë rëførmættëð. `ñµll` ðëfæµlts tø æll tægs lïstëð æt https://www.w3.ørg/TR/html5/ðøm.html#phræsïñg-çøñtëñt.",
			"html.format.unformattedContentDelimiter.desc": "Këëp tëxt çøñtëñt tøgëthër þëtwëëñ thïs strïñg.",
			"html.format.wrapAttributes.alignedmultiple": "Wræp whëñ lïñë lëñgth ïs ëxçëëðëð, ælïgñ ættrïþµtës vërtïçællÿ.",
			"html.format.wrapAttributes.auto": "Wræp ættrïþµtës øñlÿ whëñ lïñë lëñgth ïs ëxçëëðëð.",
			"html.format.wrapAttributes.desc": "Wræp ættrïþµtës.",
			"html.format.wrapAttributes.force": "Wræp ëæçh ættrïþµtë ëxçëpt fïrst.",
			"html.format.wrapAttributes.forcealign": "Wræp ëæçh ættrïþµtë ëxçëpt fïrst æñð këëp ælïgñëð.",
			"html.format.wrapAttributes.forcemultiline": "Wræp ëæçh ættrïþµtë.",
			"html.format.wrapAttributes.preserve": "Prësërvë wræppïñg øf ættrïþµtës.",
			"html.format.wrapAttributes.preservealigned": "Prësërvë wræppïñg øf ættrïþµtës þµt ælïgñ.",
			"html.format.wrapAttributesIndentSize.desc": "Ïñðëñt wræppëð ættrïþµtës tø æftër Ñ çhæræçtërs. Üsë `ñµll` tø µsë thë ðëfæµlt ïñðëñt sïzë. Ïgñørëð ïf `#html.førmæt.wræpÆttrïþµtës#` ïs sët tø `ælïgñëð`.",
			"html.format.wrapLineLength.desc": "Mæxïmµm æmøµñt øf çhæræçtërs për lïñë (0 = ðïsæþlë).",
			"html.hover.documentation": "§høw tæg æñð ættrïþµtë ðøçµmëñtætïøñ ïñ høvër.",
			"html.hover.references": "§høw rëfërëñçës tø MÐÑ ïñ høvër.",
			"html.mirrorCursorOnMatchingTag": "Ëñæþlë/ðïsæþlë mïrrørïñg çµrsør øñ mætçhïñg HTM£ tæg.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Ðëprëçætëð ïñ fævør øf `ëðïtør.lïñkëðËðïtïñg`",
			"html.suggest.html5.desc": "Çøñtrøls whëthër thë þµïlt-ïñ HTM£ læñgµægë sµppørt sµggësts HTM£5 tægs, prøpërtïës æñð vælµës.",
			"html.trace.server.desc": "Træçës thë çømmµñïçætïøñ þëtwëëñ V§ Çøðë æñð thë HTM£ læñgµægë sërvër.",
			"html.validate.scripts": "Çøñtrøls whëthër thë þµïlt-ïñ HTM£ læñgµægë sµppørt vælïðætës ëmþëððëð sçrïpts.",
			"html.validate.styles": "Çøñtrøls whëthër thë þµïlt-ïñ HTM£ læñgµægë sµppørt vælïðætës ëmþëððëð stÿlës."
		}
	}
}