{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "« stocker » un test booléen pour une évaluation ultérieure dans un guard ou if().",
			"'from' expected": "« from » attendu.",
			"'in' expected": "'in' attendu",
			"'through' or 'to' expected": "« through » ou « to » attendu",
			"'{0}'": "'{0}'",
			"( expected": "( attendue",
			") expected": ") attendue",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "La règle @font-face doit définir les propriétés 'src' et 'font-family'",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Liste de propriétés non validées par la règle 'unknownProperties'.",
			"Adds quotes to a string.": "Ajoute des guillemets à une chaîne.",
			"Also define the standard property '{0}' for compatibility": "Définir également la propriété standard '{0}' pour la compatibilité",
			"Always define standard rule '@keyframes' when defining keyframes.": "Toujours définir la règle standard '@keyframes' lors de la définition d’images clés.",
			"Always include all vendor specific properties: Missing: {0}": "Toujours inclure toutes les propriétés spécifiques au fournisseur : propriétés manquantes : {0}",
			"Always include all vendor specific rules: Missing: {0}": "Toujours inclure toutes les règles spécifiques au fournisseur : manquantes : {0}",
			"Appends a single value onto the end of a list.": "Ajoute une valeur unique à la fin d’une liste.",
			"Appends selectors to one another without spaces in between.": "Ajoute les sélecteurs les uns aux autres sans espaces entre les deux.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Évitez d'utiliser !important. Cela indique que la spécificité de l’intégralité du code CSS est incorrecte et qu’il doit être refactorisé.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Évitez d’utiliser « float ». Les floats conduisent à un CSS fragile qui est facile à rompre, si un des aspects de la mise en page change.",
			"Causes one or more rules to be emitted at the root of the document.": "Entraîne l’émission d’une ou de plusieurs règles à la racine du document.",
			"Changes one or more properties of a color.": "Modifie une ou plusieurs propriétés d’une couleur.",
			"Changes the alpha component for a color.": "Modifie le composant alpha d’une couleur.",
			"Changes the hue of a color.": "Modifie la teinte d’une couleur.",
			"Character entity representing '{0}'": "Entité de caractère représentant « {0} »",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Entité de caractère représentant « {0} », équivalent Unicode « {1} »",
			"Closing bracket expected.": "Crochet fermant attendu.",
			"Closing bracket missing.": "Crochet fermant manquant.",
			"Combines several lists into a single multidimensional list.": "Regroupe plusieurs listes en une seule liste multidimensionnelle.",
			"Configure": "Configurer",
			"Converts a color into the format understood by IE filters.": "Convertit une couleur au format compris par les filtres Internet Explorer.",
			"Converts a color to grayscale.": "Convertit une couleur en nuances de gris.",
			"Converts a string to lower case.": "Convertit une chaîne en minuscules.",
			"Converts a string to upper case.": "Convertit une chaîne en majuscules.",
			"Converts a unitless number to a percentage.": "Convertit un nombre sans unité en pourcentage.",
			"Creates a Color from hue, saturation, and lightness values.": "Crée une couleur à partir des valeurs de teinte, de saturation et de clarté.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Crée une couleur à partir de la teinte, de la saturation, de la clarté et des valeurs alpha.",
			"Creates a Color from hue, white, and black values.": "Crée une couleur à partir de valeurs de teinte, de blanc et de noir.",
			"Creates a Color from lightness, a, and b values.": "Crée une couleur à partir des valeurs de clarté et a et b.",
			"Creates a Color from lightness, chroma, and hue values.": "Crée une couleur à partir des valeurs de clarté, de chrome et de teinte.",
			"Creates a Color from red, green, and blue values.": "Crée une couleur à partir des valeurs rouge, verte et bleue.",
			"Creates a Color from red, green, blue, and alpha values.": "Crée une couleur à partir des valeurs rouge, verte, bleue et alpha.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Crée une couleur à partir des valeurs de teinte, de saturation et de clarté d’une autre couleur.",
			"Creates a Color from the hue, white, and black values of another Color.": "Crée une couleur à partir des valeurs de teinte, de blanc et de noir d’une autre couleur.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Crée une couleur à partir des valeurs de clarté, a et b d’une autre couleur.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Crée une couleur à partir des valeurs de clarté, de chrome et de teinte d’une autre couleur.",
			"Creates a Color from the red, green, and blue values of another Color.": "Crée une couleur à partir des valeurs rouge, verte et bleue d’une autre couleur.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Crée une couleur dans un espace de couleurs spécifique à partir des valeurs rouge, vert et bleu.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Crée une couleur dans un espace de couleur spécifique à partir des valeurs rouge, verte et bleue d’une autre couleur.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Définit des opérations complexes qui peuvent être réutilisées dans des feuilles de style.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Définit les styles qui peuvent être réutilisés dans l’ensemble de la feuille de style avec « @include ».",
			"Do not use duplicate style definitions": "Ne pas utiliser les définitions de style en doublon",
			"Do not use empty rulesets": "Ne pas utiliser d’ensembles de règles vides",
			"Do not use width or height when using padding or border": "Ne pas utiliser width ou height lorsque vous utilisez padding ou border",
			"Dynamically calls a Sass function.": "Appelle dynamiquement une fonction Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Chaque boucle qui définit `$var` à chaque élément de la liste ou du mappage, puis génère les styles contenus à l’aide de la valeur `$var`.",
			"End tag name expected.": "Nom de balise de fin attendu.",
			"Exposes the details of Sass’s inner workings.": "Expose les détails du fonctionnement interne de Sass.",
			"Extends $extendee with $extender within $selector.": "Étend $extendee avec $extender dans $selector.",
			"Extracts a substring from $string.": "Extrait une sous-chaîne de $string.",
			"Finds the maximum of several numbers.": "Recherche le maximum de plusieurs nombres.",
			"Finds the minimum of several numbers.": "Recherche le minimum de plusieurs nombres.",
			"Fluidly scales one or more properties of a color.": "Met à l’échelle de manière fluide une ou plusieurs propriétés d’une couleur.",
			"Folding Region End": "Fin de la zone de pliage",
			"Folding Region Start": "Début de la région repliable",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Pour une boucle qui génère à plusieurs reprises un ensemble de styles pour chaque `$var` dans la clause `from/through` ou `fromto`.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Génère de nouvelles couleurs basées sur celles existantes, ce qui facilite la génération de thèmes de couleurs.",
			"Gets the blue component of a color.": "Obtient le composant bleu d’une couleur.",
			"Gets the green component of a color.": "Obtient le composant vert d’une couleur.",
			"Gets the hue component of a color.": "Obtient la teinte d’une couleur.",
			"Gets the lightness component of a color.": "Obtient le composant de clarté d’une couleur.",
			"Gets the opacity component of a color.": "Obtient le composant d’opacité d’une couleur.",
			"Gets the red component of a color.": "Obtient le composant rouge d’une couleur.",
			"Gets the saturation component of a color.": "Obtient le composant de saturation d’une couleur.",
			"HTML Language Server": "Serveur de langage HTML",
			"Hex colors must consist of three, four, six or eight hex numbers": "Les couleurs hexadécimales doivent être constituées de trois, quatre, six ou huit nombres hexadécimaux",
			"IE hacks are only necessary when supporting IE7 and older": "Les hacks IE sont uniquement nécessaires pour prendre en charge IE7 et les versions antérieures",
			"Import statements do not load in parallel": "Les instructions Import ne se chargent pas en parallèle",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Inclut le corps si l’expression n’a pas la valeur « false » ou « null ».",
			"Includes the styles defined by another mixin into the current rule.": "Inclut les styles définis par un autre mixin dans la règle actuelle.",
			"Increases or decreases one or more components of a color.": "Augmente ou diminue un ou plusieurs composants d’une couleur.",
			"Inherits the styles of another selector.": "Hérite des styles d’un autre sélecteur.",
			"Inserts $insert into $string at $index.": "Insère $insert dans $string à $index.",
			"Invalid number of parameters": "Nombre de paramètres non valide",
			"Joins together two lists into one.": "Regroupe deux listes en une seule.",
			"Lets you access and modify values in lists.": "Vous permet d’accéder aux valeurs des listes et de les modifier.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Charge une feuille de style Sass et rend ses mixins, fonctions et variables disponibles lorsque cette feuille de style est chargée avec la règle @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Charge les mixins, les fonctions et les variables d’autres feuilles de style Sass sous forme de 'modules' et associe les CSS de plusieurs feuilles de style.",
			"Makes a color darker.": "Rend une couleur plus foncée.",
			"Makes a color less saturated.": "Rend une couleur moins saturée.",
			"Makes a color lighter.": "Rend une couleur plus claire.",
			"Makes a color more opaque.": "Rend une couleur plus opaque.",
			"Makes a color more saturated.": "Rend une couleur plus saturée.",
			"Makes a color more transparent.": "Rend une couleur plus transparente.",
			"Makes it easy to combine, search, or split apart strings.": "Facilite la combinaison, la recherche ou le fractionnement de chaînes.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Permet de rechercher la valeur associée à une clé dans une carte, et bien plus encore.",
			"Merges two maps together into a new map.": "Fusionne deux cartes dans une nouvelle carte.",
			"Mix two colors together in a polar color space.": "Mélangez deux couleurs dans un espace de couleurs polaire.",
			"Mix two colors together in a rectangular color space.": "Mélangez deux couleurs dans un espace de couleurs rectangulaire.",
			"Mixes two colors together.": "Mélange deux couleurs.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Imbrique les sélecteurs les uns sous les autres comme s’ils étaient imbriqués dans la feuille de style.",
			"No unit for zero needed": "Aucune unité nécessaire pour zéro",
			"Parses a selector into the format returned by &.": "Analyse un sélecteur dans le format retourné par &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Imprime la valeur d’une expression dans le flux de sortie d’erreur standard. Utile pour déboguer des fichiers Sass complexes.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Imprime la valeur d’une expression dans le flux de sortie d’erreur standard. Utile pour les bibliothèques qui doivent avertir les utilisateurs des désapprobations ou de la récupération suite à des erreurs mineures d’utilisation de mixin. Les avertissements peuvent être désactivés avec l’option de ligne de commande « --quiet » ou l’option Sass « :quiet ».",
			"Property is ignored due to the display.": "La propriété est ignorée en raison de l’affichage.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "La propriété est ignorée en raison de l’affichage. Avec « display: block », l’alignement vertical ne doit pas être utilisé.",
			"Provides access to Sass’s powerful selector engine.": "Donne accès au moteur sélecteur puissant de Sass.",
			"Provides functions that operate on numbers.": "Fournit des fonctions qui agissent sur des nombres.",
			"Removes quotes from a string.": "Supprime les guillemets d’une chaîne.",
			"Rename to '{0}'": "Renommer en '{0}'",
			"Replaces $original with $replacement within $selector.": "Remplace $original par $replacement dans $selector.",
			"Replaces the nth item in a list.": "Remplace le nième élément d’une liste.",
			"Returns a list of all keys in a map.": "Renvoie une liste de toutes les clés d’un mappage.",
			"Returns a list of all values in a map.": "Retourne une liste de toutes les valeurs d’un mappage.",
			"Returns a new map with keys removed.": "Retourne un nouveau mappage avec les clés supprimées.",
			"Returns a random number.": "Retourne un nombre aléatoire.",
			"Returns a specific item in a list.": "Retourne un élément spécifique dans une liste.",
			"Returns the absolute value of a number.": "Retourne la valeur absolue d'un nombre.",
			"Returns the complement of a color.": "Renvoie le complément d’une couleur.",
			"Returns the index of the first occurance of $substring in $string.": "Retourne l’index de la première occurrence de $substring dans $string.",
			"Returns the inverse of a color.": "Renvoie l’inverse d’une couleur.",
			"Returns the keywords passed to a function that takes variable arguments.": "Retourne les mots clés passés à une fonction qui accepte les arguments de variables.",
			"Returns the length of a list.": "Retourne la longueur d’une liste.",
			"Returns the number of characters in a string.": "Retourne le nombre de caractères dans une chaîne.",
			"Returns the position of a value within a list.": "Renvoie la position d’une valeur dans une liste.",
			"Returns the separator of a list.": "Retourne le séparateur d’une liste.",
			"Returns the simple selectors that comprise a compound selector.": "Retourne les sélecteurs simples qui contiennent un sélecteur composé.",
			"Returns the string representation of a value as it would be represented in Sass.": "Renvoie la représentation sous forme de chaîne d’une valeur telle qu’elle serait représentée dans Sass.",
			"Returns the type of a value.": "Renvoie le type d’une valeur.",
			"Returns the unit(s) associated with a number.": "Retourne la ou les unités associées à un nombre.",
			"Returns the value in a map associated with a given key.": "Renvoie la valeur dans un mappage associé à une clé donnée.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Indique si $super correspond à tous les éléments. $sub y correspond, et peut-être bien plus encore.",
			"Returns whether a feature exists in the current Sass runtime.": "Renvoie une valeur indiquant si une fonctionnalité existe dans le runtime Sass actuel.",
			"Returns whether a function with the given name exists.": "Indique en retour si une fonction portant le nom donné existe.",
			"Returns whether a map has a value associated with a given key.": "Indique en retour si un mappage a une valeur associée à une clé donnée.",
			"Returns whether a mixin with the given name exists.": "Indique si un mixin portant le nom donné existe.",
			"Returns whether a number has units.": "Indique si un nombre a des unités.",
			"Returns whether a variable with the given name exists in the current scope.": "Renvoie une valeur indiquant si une variable portant le nom donné existe dans l’étendue actuelle.",
			"Returns whether a variable with the given name exists in the global scope.": "Retourne une valeur indiquant si une variable portant le nom donné existe dans l’étendue globale.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Indique en retour si deux nombres peuvent être ajoutés, soustraits ou comparés.",
			"Rounds a number down to the previous whole number.": "Arrondit un nombre au nombre entier précédent.",
			"Rounds a number to the nearest whole number.": "Arrondit un nombre par défaut à l’entier le plus proche.",
			"Rounds a number up to the next whole number.": "Arrondit un nombre au nombre entier suivant.",
			"Sass documentation": "Documentation Sass",
			"Selector Specificity": "Spécifique du sélecteur",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Les sélecteurs ne doivent pas contenir d'ID, car ces règles sont trop fortement couplées au code HTML.",
			"Simple HTML5 starting point": "Point de départ HTML5 simple",
			"Start tag name expected.": "Nom de balise de début attendu.",
			"Tag name must directly follow the open bracket.": "Le nom de la balise doit suivre directement le crochet ouvrant.",
			"The universal selector (*) is known to be slow": "Le sélecteur universel (*) est connu pour être lent",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Lève la valeur d’une expression en tant qu’erreur irrécupérable avec une trace. Utile pour valider des arguments dans des mixins et des fonctions.",
			"URI expected": "URI attendu",
			"URL encodes a string": "L’URL encode une chaîne",
			"Unexpected character in tag.": "Caractère inattendu dans la balise.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Unifie deux sélecteurs pour produire un sélecteur qui correspond aux éléments mis en correspondance par les deux.",
			"Unknown at-rule.": "Règle-at inconnue.",
			"Unknown property.": "Propriété inconnue.",
			"Unknown property: '{0}'": "Propriété inconnue : '{0}'",
			"Unknown vendor specific property.": "Propriété spécifique à un fournisseur inconnue.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "VS Code dispose désormais d'une prise en charge intégrée des étiquettes de renommage automatique. Voulez-vous l'activer ?",
			"When using a vendor-specific prefix also include the standard property": "Quand vous utilisez un préfixe spécifique au fournisseur, incluez également la propriété standard",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Quand vous utilisez un préfixe spécifique au fournisseur, veillez à inclure également toutes les autres propriétés spécifiques au fournisseur.",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Pendant que la boucle prend une expression et génère à plusieurs reprises les styles imbriqués jusqu’à ce que l’instruction ait la valeur `false`.",
			"[ expected": "[ attendue",
			"] expected": "] attendue",
			"absolute value of a number": "valeur absolue d’un nombre",
			"arccosine - inverse of cosine function": "arc cosinus : inverse de la fonction cosinus",
			"arcsine - inverse of sine function": "arc sinus : inverse de la fonction sinus",
			"arctangent - inverse of tangent function": "arc tangente : inverse de la fonction tangente",
			"argument from '{0}'": "argument de « {0} »",
			"at-rule or selector expected": "règle-at ou sélecteur attendu",
			"at-rule unknown": "règle-at inconnue",
			"bind the evaluation of a ruleset to each member of a list.": "Liez l’évaluation d’un ensemble de règles à chaque membre d’une liste.",
			"calculates square root of a number": "calcule la racine carrée d’un nombre",
			"colon expected": "signe deux-points attendu",
			"comma expected": "virgule attendue",
			"condition expected": "condition attendue",
			"converts numbers from one type into another": "convertit des nombres d’un type en un autre",
			"converts to a %, e.g. 0.5 > 50%": "convertit en %, par exemple 0,5 > 50 %",
			"cosine function": "fonction cosinus",
			"creates a #AARRGGBB": "crée une valeur #AARRGGBB",
			"creates a color": "crée une couleur",
			"dot expected": "point attendu",
			"escape string content": "contenu de chaîne d’échappement",
			"expression expected": "expression attendue",
			"first argument modulus second argument": "premier argument modulo second argument",
			"first argument raised to the power of the second argument": "premier argument élevé à la puissance du deuxième argument",
			"generate a list spanning a range of values": "générer une liste couvrant une plage de valeurs",
			"identifier expected": "Identificateur attendu",
			"identifier or variable expected": "identificateur ou variable attendu",
			"identifier or wildcard expected": "identificateur ou caractère générique attendu",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block est ignoré en raison du float. Si « float » a une valeur autre que « none », la zone est rendue flottante et « display » est traité comme « block ».",
			"inlines a resource and falls back to `url()`": "place une ressource dans du code (inline) et revient à `url()`",
			"media query expected": "requête de média attendue",
			"number expected": "nombre attendu",
			"operator expected": "opérateur attendu",
			"page directive or declaraton expected": "directive de page ou déclaration attendue",
			"parses a string to a color": "analyse une chaîne en une couleur",
			"percentage expected": "pourcentage attendu",
			"property value expected": "valeur de propriété attendue",
			"remove or change the unit of a dimension": "supprimer ou modifier l’unité d’une dimension",
			"return `@color` 10% points darker": "renvoyer les points 10 % plus sombres de '@color'",
			"return `@color` 10% points less saturated": "renvoyer « @color » 10 % de points moins saturés",
			"return `@color` 10% points less transparent": "retourner `@color` 10 % de points moins transparents",
			"return `@color` 10% points lighter": "renvoie les points 10 % plus clairs de « @color »",
			"return `@color` 10% points more saturated": "renvoyer « @color » 10 % de points plus saturés",
			"return `@color` 10% points more transparent": "renvoyer `@color` 10 % de points plus transparents",
			"return `@color` with 50% transparency": "retourner '@color' avec 50 % de transparence",
			"return `@color` with a 10 degree larger in hue": "retourne `@color` avec une teinte plus grande de 10 degrés",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "renvoyer `@darkcolor` if `@color1 is> 43% luma` sinon, renvoyer `@lightcolor`, veuillez consulter les notes",
			"return a mix of `@color1` and `@color2`": "retourne un mélange de `@color1` et `@color2`",
			"returns a grey, 100% desaturated color": "renvoie une couleur grise 100 % désaturée",
			"returns a value at the specified position in the list": "renvoie une valeur à la position spécifiée dans la liste",
			"returns one of two values depending on a condition.": "renvoie l’une des deux valeurs en fonction d’une condition.",
			"returns pi": "renvoie pi",
			"returns the `alpha` channel of `@color`": "retourne le canal `alpha` de `@color`",
			"returns the `blue` channel of `@color`": "renvoie le canal « blue » de « @color »",
			"returns the `green` channel of `@color`": "retourne le canal `green` de `@color`",
			"returns the `hue` channel of `@color` in the HSL space": "renvoie le canal « hue » de « @color » dans l’espace TSL",
			"returns the `hue` channel of `@color` in the HSV space": "renvoie le canal `hue` de '@color' dans l’espace HTSV",
			"returns the `lightness` channel of `@color` in the HSL space": "renvoie le canal `lightness` de `@color` dans l’espace TSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "renvoie la valeur « luma » (luminosité perceptuelle) de « @color »",
			"returns the `red` channel of `@color`": "retourne le canal `red` de `@color`",
			"returns the `saturation` channel of `@color` in the HSL space": "renvoie le canal 'saturation' de '@color' dans l’espace TSL",
			"returns the `saturation` channel of `@color` in the HSV space": "renvoie le canal `saturation` de `@color` dans l’espace TSV",
			"returns the `value` channel of `@color` in the HSV space": "renvoie le canal 'value' de '@color' dans l’espace TSV",
			"returns the lowest of one or more values": "renvoie la valeur la plus faible d’une ou plusieurs valeurs",
			"returns the number of elements in a value list": "renvoie le nombre d’éléments dans une liste de valeurs",
			"rounds a number to a number of places": "arrondit un nombre à un certain nombre d’emplacements",
			"rounds down to an integer": "arrondit à un entier",
			"rounds up to an integer": "arrondit à un entier",
			"selector expected": "sélecteur attendu",
			"semi-colon expected": "point-virgule attendu",
			"sine function": "fonction sinus",
			"string literal expected": "littéral de chaîne attendu",
			"string replace": "remplacement de chaîne",
			"tangent function": "fonction tangente",
			"term expected": "terme attendu",
			"unknown keyword": "mot clé inconnu",
			"uri or string expected": "URI ou chaîne attendu",
			"variable name expected": "nom de variable attendu",
			"variable value expected": "valeur de variable attendue",
			"whitespace expected": "espace blanc attendu",
			"wildcard expected": "caractère générique attendu",
			"{ expected": "{ attendue",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "} attendue"
		},
		"package": {
			"description": "Fournit une prise en charge de langage complète pour les fichiers HTML et Handlebar",
			"displayName": "Fonctionnalités de langage HTML",
			"html.autoClosingTags": "Activez/désactivez la fermeture automatique des balises HTML.",
			"html.autoCreateQuotes": "Activez/désactivez la création automatique de guillemets pour l’attribution d’attribut HTML. Le type de guillemets peut être configuré par « #html.completion.attributeDefaultValue# ».",
			"html.completion.attributeDefaultValue": "Contrôle la valeur par défaut des attributs une fois l’achèvement accepté",
			"html.completion.attributeDefaultValue.doublequotes": "La valeur de l'attribut est fixée à \"\".",
			"html.completion.attributeDefaultValue.empty": "La valeur de l'attribut n'est pas définie.",
			"html.completion.attributeDefaultValue.singlequotes": "La valeur de l'attribut est fixée à ''.",
			"html.customData.desc": "Liste de chemins de fichiers relatifs pointant vers des fichiers JSON respectant le [format de données personnalisé](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code charge des données personnalisées au démarrage pour améliorer la prise en charge des balises, attributs et valeurs d’attribut HTML personnalisés que vous spécifiez dans les fichiers JSON.\r\n\r\nLes chemins de fichiers sont relatifs à l’espace de travail, et seuls les paramètres de dossier d’espace de travail sont pris en compte.",
			"html.format.contentUnformatted.desc": "Liste des balises, séparés par des virgules, où le contenu ne devrait pas être reformaté. `null` par défaut pour la balise `pre`.",
			"html.format.enable.desc": "Activer/désactiver le formateur HTML par défaut.",
			"html.format.extraLiners.desc": "Liste des balises, séparées par des virgules, qui devraient avoir un saut de ligne supplémentaire devant eux. `null` par défaut pour `\"head, body, /html\"`.",
			"html.format.indentHandlebars.desc": "Mettez en forme et indenter `{{#foo}}`, ainsi que `{{/foo}}`.",
			"html.format.indentInnerHtml.desc": "Mettez en retrait les sections '<head>' et '<body>'.",
			"html.format.maxPreserveNewLines.desc": "Nombre maximal de sauts de ligne à être conservés dans un segment unique. Utiliser `null` pour illimité.",
			"html.format.preserveNewLines.desc": "Contrôle si les sauts de ligne existants avant des éléments doivent être préservés. Fonctionne uniquement avant des éléments, pas à l’intérieur de balises ou dans le texte.",
			"html.format.templating.desc": "Privilégie les balises de langage de templating django, erb, handlebars et php.",
			"html.format.unformatted.desc": "Liste des balises, séparées par des virgules, qui ne devrait pas être reformatées. `null` par défaut toutes les balises répertoriées dans https://www.w3.org/TR/html5/dom.html#phrasing-content.",
			"html.format.unformattedContentDelimiter.desc": "Garde ensemble le contenu du texte dans cette chaîne.",
			"html.format.wrapAttributes.alignedmultiple": "Entourer lorsque la longueur de ligne est dépassée, aligner verticalement les attributs.",
			"html.format.wrapAttributes.auto": "Retour automatique à la ligne des attributs uniquement en cas de dépassement de la longueur de la ligne.",
			"html.format.wrapAttributes.desc": "Retour à la ligne des attributs.",
			"html.format.wrapAttributes.force": "Retour automatique à la ligne de chaque attribut, sauf le premier.",
			"html.format.wrapAttributes.forcealign": "Retour automatique à la ligne de chaque attribut, sauf le premier, avec maintien de l'alignement.",
			"html.format.wrapAttributes.forcemultiline": "Retour automatique à la ligne de chaque attribut.",
			"html.format.wrapAttributes.preserve": "Conserve le retour à la ligne des attributs.",
			"html.format.wrapAttributes.preservealigned": "Conservez le wrapping des attributs, mais alignez-les.",
			"html.format.wrapAttributesIndentSize.desc": "Mettez en retrait les attributs encapsulés après N caractères. Utilisez « null » pour utiliser la taille de retrait par défaut. Ignoré si #html.format.wrapAttributes# a la valeur aligned.",
			"html.format.wrapLineLength.desc": "Nombre maximal de caractères par ligne (0 = désactiver).",
			"html.hover.documentation": "Affiche la documentation relative aux balises et aux attributs quand le curseur passe sur l'élément.",
			"html.hover.references": "Affiche les références à MDN quand le curseur passe sur l'élément.",
			"html.mirrorCursorOnMatchingTag": "Activez/désactivez le curseur de mise en miroir sur la balise HTML correspondante.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Déprécié au profit de 'editor.linkedEditing'",
			"html.suggest.html5.desc": "Contrôle si la prise en charge intégrée du langage HTML propose des balises, des propriétés et des valeurs HTML5.",
			"html.trace.server.desc": "Trace la communication entre VS Code et le serveur de langage HTML.",
			"html.validate.scripts": "Contrôle si la prise en charge intégrée du langage HTML valide les scripts incorporés.",
			"html.validate.styles": "Contrôle si la prise en charge intégrée du langage HTML valide les styles incorporés."
		}
	}
}