{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Ëxæmplë",
			"Files by Extension": "Fïlës þÿ Ëxtëñsïøñ",
			"Files with Extension": "Fïlës wïth Ëxtëñsïøñ",
			"Files with Multiple Extensions": "Fïlës wïth Mµltïplë Ëxtëñsïøñs",
			"Files with Path": "Fïlës wïth Pæth",
			"Files with Siblings by Name": "Fïlës wïth §ïþlïñgs þÿ Ñæmë",
			"Folder by Name (Any Location)": "Følðër þÿ Ñæmë (Æñÿ £øçætïøñ)",
			"Folder by Name (Top Level)": "Følðër þÿ Ñæmë (Tøp £ëvël)",
			"Folders with Multiple Names (Top Level)": "Følðërs wïth Mµltïplë Ñæmës (Tøp £ëvël)",
			"GitHub": "GïtHµþ",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Mæp æll fïlës mætçhïñg thë æþsølµtë pæth gløþ pættërñ ïñ thëïr pæth tø thë læñgµægë wïth thë gïvëñ ïðëñtïfïër.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Mæp æll fïlës mætçhïñg thë gløþ pættërñ ïñ thëïr fïlëñæmë tø thë læñgµægë wïth thë gïvëñ ïðëñtïfïër.",
			"Match a folder with a specific name in any location.": "Mætçh æ følðër wïth æ spëçïfïç ñæmë ïñ æñÿ løçætïøñ.",
			"Match a top level folder with a specific name.": "Mætçh æ tøp lëvël følðër wïth æ spëçïfïç ñæmë.",
			"Match all files of a specific file extension.": "Mætçh æll fïlës øf æ spëçïfïç fïlë ëxtëñsïøñ.",
			"Match all files with any of the file extensions.": "Mætçh æll fïlës wïth æñÿ øf thë fïlë ëxtëñsïøñs.",
			"Match files that have siblings with the same name but a different extension.": "Mætçh fïlës thæt hævë sïþlïñgs wïth thë sæmë ñæmë þµt æ ðïffërëñt ëxtëñsïøñ.",
			"Match multiple top level folders.": "Mætçh mµltïplë tøp lëvël følðërs.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Thë çhæræçtër µsëð þÿ thë øpërætïñg sÿstëm tø sëpærætë çømpøñëñts ïñ fïlë pæths. Ïs ælsø ælïæsëð tø '/'.",
			"The current opened file": "Thë çµrrëñt øpëñëð fïlë",
			"The current opened file relative to ${workspaceFolder}": "Thë çµrrëñt øpëñëð fïlë rëlætïvë tø ${wørkspæçëFølðër}",
			"The current opened file workspace folder name without any slashes (/)": "Thë çµrrëñt øpëñëð fïlë wørkspæçë følðër ñæmë wïthøµt æñÿ slæshës (/)",
			"The current opened file's basename": "Thë çµrrëñt øpëñëð fïlë's þæsëñæmë",
			"The current opened file's basename with no file extension": "Thë çµrrëñt øpëñëð fïlë's þæsëñæmë wïth ñø fïlë ëxtëñsïøñ",
			"The current opened file's dirname": "Thë çµrrëñt øpëñëð fïlë's ðïrñæmë",
			"The current opened file's dirname relative to ${workspaceFolder}": "Thë çµrrëñt øpëñëð fïlë's ðïrñæmë rëlætïvë tø ${wørkspæçëFølðër}",
			"The current opened file's extension": "Thë çµrrëñt øpëñëð fïlë's ëxtëñsïøñ",
			"The current opened file's folder name": "Thë çµrrëñt øpëñëð fïlë's følðër ñæmë",
			"The current selected line number in the active file": "Thë çµrrëñt sëlëçtëð lïñë ñµmþër ïñ thë æçtïvë fïlë",
			"The current selected text in the active file": "Thë çµrrëñt sëlëçtëð tëxt ïñ thë æçtïvë fïlë",
			"The file extension of the editor (e.g. txt)": "Thë fïlë ëxtëñsïøñ øf thë ëðïtør (ë.g. txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Thë fïlë ñæmë øf thë ëðïtør wïthøµt ïts ðïrëçtørÿ ør ëxtëñsïøñ (ë.g. mÿFïlë)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Thë ñæmë øf thë ðëfæµlt þµïlð tæsk. Ïf thërë ïs ñøt æ sïñglë ðëfæµlt þµïlð tæsk thëñ æ qµïçk pïçk ïs shøwñ tø çhøøsë thë þµïlð tæsk.",
			"The name of the folder opened in VS Code without any slashes (/)": "Thë ñæmë øf thë følðër øpëñëð ïñ V§ Çøðë wïthøµt æñÿ slæshës (/)",
			"The nth parent folder name of the editor": "Thë ñth pærëñt følðër ñæmë øf thë ëðïtør",
			"The parent folder name of the editor (e.g. myFileFolder)": "Thë pærëñt følðër ñæmë øf thë ëðïtør (ë.g. mÿFïlëFølðër)",
			"The path of the folder opened in VS Code": "Thë pæth øf thë følðër øpëñëð ïñ V§ Çøðë",
			"The path where an extension is installed.": "Thë pæth whërë æñ ëxtëñsïøñ ïs ïñstællëð.",
			"The task runner's current working directory on startup": "Thë tæsk rµññër's çµrrëñt wørkïñg ðïrëçtørÿ øñ stærtµp",
			"Use the language of the currently active text editor if any": "Üsë thë læñgµægë øf thë çµrrëñtlÿ æçtïvë tëxt ëðïtør ïf æñÿ",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "æ çøñðïtïøñæl sëpærætør (' - ') thæt øñlÿ shøws whëñ sµrrøµñðëð þÿ værïæþlës wïth vælµës",
			"an indicator for when the active editor has unsaved changes": "æñ ïñðïçætør før whëñ thë æçtïvë ëðïtør hæs µñsævëð çhæñgës",
			"e.g. SSH": "ë.g. §§H",
			"e.g. VS Code": "ë.g. V§ Çøðë",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "fïlë pæth øf thë wørkspæçë (ë.g. /Üsërs/Ðëvëløpmëñt/mÿWørkspæçë)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "fïlë pæth øf thë wørkspæçë følðër thë fïlë ïs çøñtæïñëð ïñ (ë.g. /Üsërs/Ðëvëløpmëñt/mÿFølðër)",
			"gist": "gïst",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "ñæmë øf thë wørkspæçë følðër thë fïlë ïs çøñtæïñëð ïñ (ë.g. mÿFølðër)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "ñæmë øf thë wørkspæçë wïth øptïøñæl rëmøtë ñæmë æñð wørkspæçë ïñðïçætør ïf æpplïçæþlë (ë.g. mÿFølðër, mÿRëmøtëFølðër [§§H] ør mÿWørkspæçë (Wørkspæçë))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "shørtëñëð ñæmë øf thë wørkspæçë wïthøµt sµffïxës (ë.g. mÿFølðër ør mÿWørkspæçë)",
			"the file name (e.g. myFile.txt)": "thë fïlë ñæmë (ë.g. mÿFïlë.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "thë fµll pæth øf thë fïlë (ë.g. /Üsërs/Ðëvëløpmëñt/mÿFølðër/mÿFïlëFølðër/mÿFïlë.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "thë fµll pæth øf thë følðër thë fïlë ïs çøñtæïñëð ïñ (ë.g. /Üsërs/Ðëvëløpmëñt/mÿFølðër/mÿFïlëFølðër)",
			"the name of the active branch in the active repository (e.g. main)": "thë ñæmë øf thë æçtïvë þræñçh ïñ thë æçtïvë rëpøsïtørÿ (ë.g. mæïñ)",
			"the name of the active repository (e.g. vscode)": "thë ñæmë øf thë æçtïvë rëpøsïtørÿ (ë.g. vsçøðë)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "thë ñæmë øf thë følðër thë fïlë ïs çøñtæïñëð ïñ (ë.g. mÿFïlëFølðër)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "thë pæth øf thë fïlë rëlætïvë tø thë wørkspæçë følðër (ë.g. mÿFølðër/mÿFïlëFølðër/mÿFïlë.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "thë pæth øf thë følðër thë fïlë ïs çøñtæïñëð ïñ, rëlætïvë tø thë wørkspæçë følðër (ë.g. mÿFølðër/mÿFïlëFølðër)",
			"the state of the active editor (e.g. modified).": "thë stætë øf thë æçtïvë ëðïtør (ë.g. møðïfïëð)."
		},
		"package": {
			"description": "Prøvïðës çæpæþïlïtïës (æðvæñçëð Ïñtëllï§ëñsë, æµtø-fïxïñg) ïñ çøñfïgµrætïøñ fïlës lïkë sëttïñgs, læµñçh, æñð ëxtëñsïøñ rëçømmëñðætïøñ fïlës.",
			"displayName": "Çøñfïgµrætïøñ Ëðïtïñg"
		}
	}
}