{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref {0} v {1} se nedá přeložit.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Výchozí hodnota. Používá se v návrzích.",
			"A descriptive title of the schema.": "Popisný název schématu.",
			"A long description of the schema. Used in hover menus and suggestions.": "Dlouhý popis schématu. Používá se v nabídkách a návrzích při přechodu myší.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Mapa názvů vlastností pro pole názvů vlastností nebo schéma. Pole názvů vlastností znamená, že platnost vlastnosti pojmenované v klíči závisí na tom, aby se vlastnosti v poli nacházely i v objektu. Pokud je hodnotou schéma, použije se schéma na objekt pouze v případě, že vlastnost v klíči existuje i v objektu.",
			"A map of property names to schemas for each property.": "Mapa názvů vlastností pro schémata pro každou vlastnost.",
			"A map of regular expressions on property names to schemas for matching properties.": "Mapa regulárních výrazů v názvech vlastností pro schémata pro odpovídající vlastnosti.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Číslo, které by mělo vyčistit dělení aktuální hodnoty (tj. dělit beze zbytku).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Regulární výraz, se kterým se má řetězec shodovat. Není implicitně ukotven.",
			"A schema which must not match.": "Schéma, které se nesmí shodovat.",
			"A unique identifier for the schema.": "Jedinečný identifikátor daného schématu.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Instance pole je platná pro „contains“, pokud je alespoň jeden z jejích prvků platný proti danému schématu.",
			"An array of schemas, all of which must match.": "Pole schémat, které se musí shodovat.",
			"An array of schemas, exactly one of which must match.": "Pole schémat, z nichž přesně jedno se musí shodovat.",
			"An array of schemas, where at least one must match.": "Pole schémat, kde se musí shodovat alespoň jedno.",
			"An array of strings that lists the names of all properties required on this object.": "Pole řetězců, které obsahuje názvy všech vlastností požadovaných pro tento objekt.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Instance se úspěšně ověří vůči tomuto klíčovému slovu, pokud se její hodnota rovná hodnotě klíčového slova.",
			"Array does not contain required item.": "Pole neobsahuje požadovanou položku.",
			"Array has duplicate items.": "Pole obsahuje duplicitní položky.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "Pole má příliš málo položek, které odpovídají omezení typu contains. Očekává se {0} nebo více.",
			"Array has too few items. Expected {0} or more.": "Pole má příliš málo položek. Očekávalo se {0} nebo více.",
			"Array has too many items according to schema. Expected {0} or fewer.": "Pole má podle schématu příliš mnoho položek. Očekává se {0} nebo méně.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "Pole obsahuje příliš mnoho položek, které se shodují s argumentem omezení typu contains. Očekává se {0} nebo menší.",
			"Array has too many items. Expected {0} or fewer.": "Pole obsahuje příliš mnoho položek. Očekávalo se {0} nebo méně.",
			"Colon expected": "Očekává se dvojtečka.",
			"Comments are not permitted in JSON.": "Komentáře nejsou ve formátu JSON povolené.",
			"Comments from schema authors to readers or maintainers of the schema.": "Komentáře autorů schémat pro čtenáře nebo správce schématu.",
			"Configure": "Konfigurovat",
			"Configured by extension: {0}": "Nakonfigurováno rozšířením: {0}",
			"Configured in user settings": "Nakonfigurováno v uživatelských nastaveních",
			"Configured in workspace settings": "Nakonfigurováno v nastavení pracovního prostoru",
			"Default value": "Výchozí hodnota",
			"Describes the content encoding of a string property.": "Popisuje kódování obsahu řetězcové vlastnosti.",
			"Describes the format expected for the value. By default, not used for validation": "Popisuje formát očekávaný pro hodnotu. Ve výchozím nastavení se nepoužívá k ověření.",
			"Describes the media type of a string property.": "Popisuje typ média vlastnosti řetězce.",
			"Downloading schemas is disabled through setting '{0}'": "Stahování schémat je prostřednictvím nastavení {0} zakázané.",
			"Downloading schemas is disabled. Click to configure.": "Stahování schémat je zakázané. Po kliknutí ho můžete nakonfigurovat.",
			"Draft-03 schemas are not supported.": "Schémata Draft-03 se nepodporují.",
			"Duplicate anchor declaration: '{0}'": "Duplicitní deklarace ukotvení: {0}",
			"Duplicate object key": "Duplikovat klíč objektu",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Schéma nebo logická hodnota. Pokud jde o schéma, použije se k ověření všech vlastností, které neodpovídají vlastnostem properties, propertyNames nebo patternProperties. Pokud je false, všechny vlastnosti, které nejsou definovány pomocí souvisejících klíčových slov, způsobí selhání tohoto schématu.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Buď řetězec jednoho ze základních typů schématu (číslo, celé číslo, null, pole, objekt, logická hodnota, řetězec), nebo pole řetězců určující podmnožinu těchto typů.",
			"End of file expected.": "Očekával se konec souboru.",
			"Expected a JSON object, array or literal.": "Očekává se objekt JSON, pole nebo literál.",
			"Expected comma": "Očekává se čárka",
			"Expected comma or closing brace": "Očekávala se čárka nebo pravá složená závorka.",
			"Expected comma or closing bracket": "Očekává se čárka nebo pravá hranatá závorka",
			"Failed to sort the JSONC document, please consider opening an issue.": "Nepovedlo se seřadit dokument JSONC. Zvažte prosím nahlášení problému.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Pro pole pouze v případě, že jsou položky nastaveny jako pole. Pokud jsou položky schématem, toto schéma ověří položky po položkách zadaných ve schématu položek. Pokud je false, způsobí další položky selhání ověření.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Pro pole. Může se jednat o schéma, proti němuž se ověří každý prvek, nebo pole schémat pro ověření jednotlivých položek v uvedeném pořadí (první schéma ověří první prvek, druhé schéma ověří druhý prvek atd.",
			"If all of the items in the array must be unique. Defaults to false.": "Použijte, pokud musí být všechny položky v poli jedinečné. Výchozí hodnota je false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Pokud je instance objektem, toto klíčové slovo ověří, jestli se všechny názvy vlastností v instanci ověřují proti zadanému schématu.",
			"Incorrect type. Expected \"{0}\".": "Nesprávný typ. Očekávalo se „{0}“.",
			"Incorrect type. Expected one of {0}.": "Nesprávný typ. Očekával se některý z {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Označuje, že hodnotu instance spravuje výhradně vlastnící autorita.",
			"Invalid characters in string. Control characters must be escaped.": "Neplatné znaky v řetězci. Řídicí znaky musí být uvozeny řídicím znakem.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Neplatný formát barvy. Použijte #RGB, #RGBA, #RRGGBB nebo #RRGGBBAA.",
			"Invalid escape character in string.": "Neplatný řídicí znak v řetězci.",
			"Invalid number format.": "Neplatný formát čísla.",
			"Invalid unicode sequence in string.": "Neplatná sekvence Unicode v řetězci.",
			"Item does not match any validation rule from the array.": "Položka neodpovídá žádnému ověřovacímu pravidlu z pole.",
			"JSON Language Server": "Server jazyka JSON",
			"JSON Outline Status": "Stav osnovy JSON",
			"JSON Validation Status": "Stav ověření JSON",
			"JSON schema cache cleared.": "Mezipaměť schémat JSON byla vymazána.",
			"JSON schema configured": "schéma JSON je nakonfigurované",
			"JSON: Schema Resolution Error": "JSON: chyba vyhodnocení schématu",
			"Learn more about JSON schema configuration...": "Další informace o konfiguraci schématu JSON…",
			"Loading JSON info": "Načítají se informace JSON.",
			"Makes the maximum property exclusive.": "Vyhradí maximální vlastnost.",
			"Makes the minimum property exclusive.": "Nastaví minimální vlastnost jako výhradní.",
			"Matches a schema that is not allowed.": "Odpovídá nepovolenému schématu.",
			"Matches multiple schemas when only one must validate.": "Odpovídá více schématům, když se musí ověřit jenom jedno.",
			"Missing property \"{0}\".": "Chybí vlastnost „{0}“.",
			"New array": "Nové pole",
			"New object": "Nový objekt",
			"No schema configured for this file": "Pro tento soubor není nakonfigurované žádné schéma.",
			"No schema validation": "Žádné ověření schématu",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Nepoužívá se k ověření. Sem umístěte dílčí nákresy, na které chcete odkazovat pomocí $ref.",
			"Object has fewer properties than the required number of {0}": "Objekt má méně vlastností, než je požadovaný počet {0}",
			"Object has more properties than limit of {0}.": "Objekt má více vlastností, než je limit {0}.",
			"Object is missing property {0} required by property {1}.": "U objektu chybí vlastnost {0} vyžadovaná vlastností {1}.",
			"Open Extension": "Otevřít rozšíření",
			"Open Settings": "Otevřít nastavení",
			"Outline": "Osnova",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problém se čtením obsahu z {0}: Zjistilo se UTF-8 s BOM, povoluje se jen UTF 8.",
			"Problems loading reference '{0}': {1}": "Problémy s načítáním odkazu {0}: {1}",
			"Property expected": "Očekává se vlastnost",
			"Property keys must be doublequoted": "Klíče vlastností musí být ve dvojitých uvozovkách.",
			"Property {0} is not allowed.": "Vlastnost {0} není povolená.",
			"Reference a definition hosted on any location.": "Odkazujte na definici hostovanou v libovolném umístění.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Ukázkové hodnoty JSON přidružené k určitému schématu pro účely ilustrace použití.",
			"Schema not found: {0}": "Schéma nenalezeno: {0}",
			"Schema validated": "Schéma ověřeno",
			"Select the schema to use for {0}": "Vyberte schéma, které se má použít pro {0}",
			"Show Schemas": "Zobrazit schémata",
			"Sort JSON": "Seřadit JSON",
			"String does not match the pattern of \"{0}\".": "Řetězec neodpovídá vzoru „{0}“.",
			"String is longer than the maximum length of {0}.": "Řetězec je delší než maximální délka {0}.",
			"String is not a RFC3339 date-time.": "Řetězec není datum a čas RFC3339.",
			"String is not a RFC3339 date.": "Řetězec není datum RFC3339.",
			"String is not a RFC3339 time.": "Řetězec není čas RFC3339.",
			"String is not a URI: {0}": "Řetězec není identifikátor URI: {0}",
			"String is not a hostname.": "Řetězec není název hostitele.",
			"String is not an IPv4 address.": "Řetězec není IPv4 adresa.",
			"String is not an IPv6 address.": "Řetězec není IPv6 adresa.",
			"String is not an e-mail address.": "Řetězec není e-mailová adresa.",
			"String is shorter than the minimum length of {0}.": "Řetězec je kratší než minimální délka {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Podschéma else se používá k ověření, když selže podschéma if.",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "Podschéma then se používá k ověření, když je podschéma if úspěšné.",
			"The maximum length of a string.": "Maximální délka řetězce.",
			"The maximum number of items that can be inside an array. Inclusive.": "Maximální počet položek, které mohou být uvnitř pole. Inkluzivní.",
			"The maximum number of properties an object can have. Inclusive.": "Maximální počet vlastností, které objekt může mít. Inkluzivní.",
			"The maximum numerical value, inclusive by default.": "Minimální číselná hodnota, která je ve výchozím nastavení inkluzivní.",
			"The minimum length of a string.": "Minimální délka řetězce.",
			"The minimum number of items that can be inside an array. Inclusive.": "Minimální počet položek, které mohou být uvnitř pole. Inkluzivní.",
			"The minimum number of properties an object can have. Inclusive.": "Minimální počet vlastností, které objekt může mít. Inkluzivní.",
			"The minimum numerical value, inclusive by default.": "Minimální číselná hodnota, která je ve výchozím nastavení inkluzivní.",
			"The schema to verify this document against.": "Schéma, proti kterému se má tento dokument ověřit.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Schéma používá funkce meta schématu ({0}), které validátor zatím nepodporuje.",
			"The set of literal values that are valid.": "Sada hodnot literálů, které jsou platné.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Výsledek ověření podschématu if určuje, které klíčové slovo (then nebo else) se vyhodnotí.",
			"Trailing comma": "Koncová čárka",
			"URI expected.": "Očekával se identifikátor URI.",
			"URI is expected.": "Očekává se identifikátor URI.",
			"URI with a scheme is expected.": "Očekává se identifikátor URI se schématem.",
			"Unable to compute used schemas: No document": "Nelze vypočítat použitá schémata: Žádný dokument",
			"Unable to compute used schemas: {0}": "Nelze vypočítat použitá schémata: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Nepovedlo se načíst schéma z(e) „{0}“. Není k dispozici žádná služba žádostí o schéma.",
			"Unable to load schema from '{0}': No content.": "Nelze načíst schéma z {0}: žádný obsah.",
			"Unable to load schema from '{0}': {1}.": "Nelze načíst schéma z {0}: {1}.",
			"Unable to load {0}": "Nelze načíst {0}.",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Nelze analyzovat obsah z {0}: chyba analýzy na posunu {1}",
			"Unable to resolve schema. Click to retry.": "Schéma nelze vyhodnotit. Kliknutím to můžete zkusit znovu.",
			"Unexpected end of comment.": "Neočekávaný konec komentáře.",
			"Unexpected end of number.": "Neočekávaný konec čísla.",
			"Unexpected end of string.": "Neočekávaný konec řetězce.",
			"Value expected": "Očekává se hodnota",
			"Value is above the exclusive maximum of {0}.": "Hodnota je nad výhradním maximem {0}.",
			"Value is above the maximum of {0}.": "Hodnota je vyšší než maximální hodnota {0}.",
			"Value is below the exclusive minimum of {0}.": "Hodnota je nižší než výhradní minimum {0}.",
			"Value is below the minimum of {0}.": "Hodnota je nižší než minimum {0}.",
			"Value is deprecated": "Hodnota je zastaralá.",
			"Value is not accepted. Valid values: {0}.": "Tato hodnota se nepřijímá. Platné hodnoty: {0}.",
			"Value is not divisible by {0}.": "Hodnota není dělitelná {0}.",
			"Value must be {0}.": "Hodnota musí být {0}.",
			"multiple JSON schemas configured": "nakonfigurovalo se několik schémat JSON",
			"no JSON schema configured": "není nakonfigurované žádné schéma JSON",
			"only {0} document symbols shown for performance reasons": "z důvodu výkonu se zobrazuje jen tento počet symbolů: {0}",
			"{0} is a directory, not a file": "{0} je adresář, ne soubor."
		},
		"package": {
			"description": "Poskytuje rozšířenou podporu jazyka pro soubory JSON.",
			"displayName": "Funkce jazyka JSON",
			"json.clickToRetry": "Kliknutím to můžete zkusit znovu.",
			"json.colorDecorators.enable.deprecationMessage": "Nastavení json.colorDecorators.enable je zastaralé. Místo něj se používá nastavení editor.colorDecorators.",
			"json.colorDecorators.enable.desc": "Povolí nebo zakáže dekoratéry barev.",
			"json.command.clearCache": "Vymazat mezipaměť schématu",
			"json.command.sort": "Seřadit dokument",
			"json.enableSchemaDownload.desc": "Pokud je tato možnost povolená, schémata JSON se dají načíst z umístění HTTP a HTTPS.",
			"json.format.enable.desc": "Umožňuje povolit nebo zakázat výchozí formátovací modul JSON.",
			"json.format.keepLines.desc": "Při formátování zachovejte všechny existující nové řádky.",
			"json.maxItemsComputed.desc": "Maximální počet symbolů osnovy a vypočítaných oblastí sbalení (omezeno kvůli výkonu)",
			"json.maxItemsExceededInformation.desc": "Zobrazí oznámení při překročení maximálního počtu symbolů osnovy a oblastí sbalení.",
			"json.schemaResolutionErrorMessage": "Schéma nelze vyhodnotit.",
			"json.schemas.desc": "Přidružit schémata k souborům JSON v aktuálním projektu",
			"json.schemas.fileMatch.desc": "Pole vzorů souborů, které se mají porovnat při překladu souborů JSON na schémata * a ** se dají použít jako zástupný znak. Můžete také definovat vzory vyloučení začínající symbolem „!“. Soubor se shoduje, když existuje minimálně jeden odpovídající vzor a poslední odpovídající vzor není vzorem vyloučení.",
			"json.schemas.fileMatch.item.desc": "Vzor souboru, který může obsahovat hvězdičku (* a **) a který umožňuje vyhledat shody při překladu souborů JSON na schémata. Když začíná znakem !, definuje vzor vyloučení.",
			"json.schemas.schema.desc": "Definice schématu pro danou adresu URL. Schéma musí být zadáno pouze proto, aby se zabránilo přístupu k adrese URL schématu.",
			"json.schemas.url.desc": "Adresa URL nebo absolutní cesta k souboru schématu. Může se jednat o relativní cestu (začínající na ./) v nastavení pracovního prostoru a složky pracovního prostoru.",
			"json.tracing.desc": "Umožňuje sledovat komunikaci mezi VS Code a serverem jazyka JSON.",
			"json.validate.enable.desc": "Povolí nebo zakáže ověřování JSON."
		}
	}
}