{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "Bir koruyucuda veya () koşulu için daha sonra değerlendirme yapmak için bir Boole testi \"store\" et.",
			"'from' expected": "'from' bekleniyor",
			"'in' expected": "'in' bekleniyor",
			"'through' or 'to' expected": "'through' veya 'to' bekleniyor",
			"'{0}'": "'{0}'",
			"( expected": "( bekleniyor",
			") expected": ") bekleniyor",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "@font-face kuralı 'src' ve 'font-family' özelliklerini tanımlamalıdır",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "'unknownProperties' kuralına göre doğrulanmamış özellikler listesi.",
			"Adds quotes to a string.": "Dizeye tırnak işaretleri ekler.",
			"Also define the standard property '{0}' for compatibility": "Uyumluluk için '{0}' standart özelliğini de tanımla",
			"Always define standard rule '@keyframes' when defining keyframes.": "Ana kareler tanımlanırken '@keyframes' standart kuralını her zaman tanımlayın.",
			"Always include all vendor specific properties: Missing: {0}": "Satıcıya özgü tüm özellikleri her zaman dahil et: Eksik: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Satıcıya özgü tüm kuralları her zaman dahil et: Eksik: {0}",
			"Appends a single value onto the end of a list.": "Bir liste sonuna tek bir değer ekler.",
			"Appends selectors to one another without spaces in between.": "Seçicileri aralarında boşluk olmadan bir diğerinin sonuna ekler.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "!important kullanmaktan kaçının. Bu, CSS'nin tüm özgül değerlerinin denetimden çıktığını ve yeniden düzenleme yapılması gerektiğini gösterir.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "'float' kullanmaktan kaçının. Float ayarları, düzenin bir yönden değişmesi durumunda kolayca bozulan kırılgan bir CSS ortaya çıkarır.",
			"CSS Language Server": "CSS Dili Sunucusu",
			"CSS fix is outdated and can't be applied to the document.": "CSS düzeltmesi güncel değil ve belgeye uygulanamıyor.",
			"Causes one or more rules to be emitted at the root of the document.": "Bir veya daha fazla kuralın belgenin kökünde gösterilmesine neden olur.",
			"Changes one or more properties of a color.": "Bir rengin bir veya daha fazla özelliğini değiştirir.",
			"Changes the alpha component for a color.": "Bir rengin alfa bileşenini değiştirir.",
			"Changes the hue of a color.": "Rengin tonunu değiştirir.",
			"Combines several lists into a single multidimensional list.": "Birkaç listeyi tek bir çok boyutlu liste olarak birleştirir.",
			"Converts a color into the format understood by IE filters.": "Rengi IE filtreleri tarafından anlaşılan biçime dönüştürür.",
			"Converts a color to grayscale.": "Rengi gri tonlamaya dönüştürür.",
			"Converts a string to lower case.": "Dizeyi küçük harfe dönüştürür.",
			"Converts a string to upper case.": "Dizeyi büyük harfe dönüştürür.",
			"Converts a unitless number to a percentage.": "Birimsiz sayıyı bir yüzdeye dönüştürür.",
			"Creates a Color from hue, saturation, and lightness values.": "Ton, doygunluk ve ışık değerlerinden bir Renk oluşturur.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Ton, doygunluk, ışık ve alfa değerlerinden bir Renk oluşturur.",
			"Creates a Color from hue, white, and black values.": "Ton, beyaz ve siyah değerlerinden bir Renk oluşturur.",
			"Creates a Color from lightness, a, and b values.": "Işık, a ve b değerlerinden bir Renk oluşturur.",
			"Creates a Color from lightness, chroma, and hue values.": "Işık, renk ve ton değerlerinden bir Renk oluşturur.",
			"Creates a Color from red, green, and blue values.": "Kırmızı, yeşil ve mavi değerlerinden bir Renk oluşturur.",
			"Creates a Color from red, green, blue, and alpha values.": "Kırmızı, yeşil, mavi ve alfa değerlerinden bir Renk oluşturur.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Başka bir Rengin ton, doygunluk ve ışık değerlerinden bir Renk oluşturur.",
			"Creates a Color from the hue, white, and black values of another Color.": "Başka bir Rengin ton, beyaz ve siyah değerlerinden bir Renk oluşturur.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Başka bir Rengin ışık, a ve b değerlerinden bir Renk oluşturur.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Başka bir Rengin ışık, renk ve ton değerlerinden bir Renk oluşturur.",
			"Creates a Color from the red, green, and blue values of another Color.": "Başka bir Rengin kırmızı, yeşil ve mavi değerlerinden bir Renk oluşturur.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Belirli bir renk alanında kırmızı, yeşil ve mavi değerlerinden bir Renk oluşturur.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Belirli bir renk alanında başka bir Rengin kırmızı, yeşil ve mavi değerlerinden bir Renk oluşturur.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Stil sayfaları boyunca yeniden kullanılabilecek karmaşık işlemleri tanımlar.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "`@include` değerine sahip stil sayfası boyunca yeniden kullanılabilen stilleri belirler.",
			"Do not use duplicate style definitions": "Yinelenen stil tanımları kullanmayın",
			"Do not use empty rulesets": "Boş kural kümeleri kullanmayın",
			"Do not use width or height when using padding or border": "Doldurma veya kenarlık kullanırken genişlik veya yükseklik kullanmayın",
			"Dynamically calls a Sass function.": "Sass işlevini dinamik olarak çağırır.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "`$var` değerini listedeki veya eşlemedeki her öğeye ayarlayıp içerdiği stilleri bu `$var` değerini kullanarak çıkaran her döngü.",
			"Exposes the details of Sass’s inner workings.": "Sass iç çalışmalarının ayrıntılarını kullanıma sunar.",
			"Extends $extendee with $extender within $selector.": "$selector içinde $extender öğesine sahip $extendee öğesini genişletir.",
			"Extracts a substring from $string.": "$string öğesinden bir alt dize ayıklar.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "Belgeye CSS düzeltmesi uygulanamadı. Lütfen yeniden oluşturma adımları içeren bir sorun açmayı düşünün.",
			"Finds the maximum of several numbers.": "Birkaç sayının en yüksek değerini bulur.",
			"Finds the minimum of several numbers.": "Birkaç sayının en düşük değerini bulur.",
			"Fluidly scales one or more properties of a color.": "Rengin bir veya daha fazla özelliğini akıcı bir şekilde ölçeklendirir.",
			"Folding Region End": "Katlama Bölgesi Sonu",
			"Folding Region Start": "Katlama Bölgesi Başlangıcı",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "`from/through` veya `from/to` yan tümcesindeki her `$var` için tekrar tekrar bir stil kümesi çıkaran for döngüsü.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Mevcut renklere göre yeni renkler üreterek renk temaları oluşturmanızı kolaylaştırır.",
			"Gets the blue component of a color.": "Bir rengin mavi bileşenini alır.",
			"Gets the green component of a color.": "Rengin yeşil bileşenini alır.",
			"Gets the hue component of a color.": "Bir rengin ton bileşenini alır.",
			"Gets the lightness component of a color.": "Bir rengin ışık bileşenini alır.",
			"Gets the opacity component of a color.": "Bir rengin opaklık bileşenini alır.",
			"Gets the red component of a color.": "Bir rengin kırmızı bileşenini alır.",
			"Gets the saturation component of a color.": "Rengin doygunluk bileşenini alır.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Onaltılık renkler üç, dört, altı veya sekiz onaltılık sayıdan oluşmalıdır",
			"IE hacks are only necessary when supporting IE7 and older": "IE kodlaması yalnızca IE7 ve daha eski sürümler desteklenirken gereklidir",
			"Import statements do not load in parallel": "İçeri aktarma deyimleri paralel olarak yüklenmez",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "İfade `false` veya `null` olarak değerlendirilmezse gövdeyi içerir.",
			"Includes the styles defined by another mixin into the current rule.": "Geçerli kurala başka bir karışım tarafından tanımlanan stilleri içerir.",
			"Increases or decreases one or more components of a color.": "Bir rengin bir veya daha fazla bileşenini artırır veya azaltır.",
			"Inherits the styles of another selector.": "Başka bir seçicinin stillerini devralır.",
			"Insert url() Function": "url() İşlevi Ekle",
			"Insert url() Functions": "url() İşlevleri Ekle",
			"Inserts $insert into $string at $index.": "$index konumunda $string değerine $insert öğesini ekler.",
			"Invalid number of parameters": "Geçersiz parametre sayısı",
			"Joins together two lists into one.": "İki listeyi birleştirerek tek bir liste oluşturur.",
			"Lets you access and modify values in lists.": "Listelerde değerlere erişmenizi ve bu değerleri değiştirmenizi sağlar.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Sass stil sayfası yükler ve bu stil sayfası @use kuralıyla yüklendiğinde karışımlarını, işlevlerini ve değişkenlerini kullanılabilir kılar.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Diğer Sass stil sayfalarındaki karışımları, işlevleri ve değişkenleri 'modules' olarak yükler ve birden çok stil sayfasındaki CSS'yi birleştirir.",
			"Makes a color darker.": "Rengi daha koyu hale getirir.",
			"Makes a color less saturated.": "Rengin doygunluğunu azaltır.",
			"Makes a color lighter.": "Rengi daha açık hale getirir.",
			"Makes a color more opaque.": "Rengi daha donuk hale getirir.",
			"Makes a color more saturated.": "Bir rengi daha doygun hale getirir.",
			"Makes a color more transparent.": "Rengi daha saydam yapar.",
			"Makes it easy to combine, search, or split apart strings.": "Dizeleri birleştirmeyi, aramayı veya bölmeyi kolaylaştırır.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Eşlemedeki bir anahtarla ilişkili değeri aramanızı ve daha fazlasını yapmanızı mümkün kılar.",
			"Merges two maps together into a new map.": "İki eşlemeyi birleştirerek yeni bir eşleme oluşturur.",
			"Mix two colors together in a polar color space.": "İki rengi polar renk alanında bir araya getirir.",
			"Mix two colors together in a rectangular color space.": "İki rengi dikdörtgen renk alanında bir araya getirir.",
			"Mixes two colors together.": "İki rengi birbiriyle karıştırır.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Seçiciyi, stil sayfasında iç içe geçmiş olduğu gibi iç içe geçirir.",
			"No unit for zero needed": "Sıfır için birim gerekli değil",
			"Parses a selector into the format returned by &.": "Seçiciyi, & tarafından döndürülen biçime ayrıştırır.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "İfadenin değerini standart hata çıkış akışına yazdırır. Karmaşık Sass dosyalarında hata ayıklamak için faydalıdır.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "İfadenin değerini standart hata çıkışı akışına yazdırır. Kullanımdan kaldırma veya küçük karışık kullanım hatalarından kurtarma konusunda kullanıcıları uyarması gereken kitaplıklar için faydalıdır. Uyarılar ,'--quiet' komut satırı seçeneği veya ':quiet' Sass seçeneğiyle kapatılabilir.",
			"Property is ignored due to the display.": "Görüntü nedeniyle özellik yok sayıldı.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Görüntü nedeniyle özellik yok sayıldı. 'display: block' değeriyle birlikte vertical-align kullanılmamalıdır.",
			"Provides access to Sass’s powerful selector engine.": "Sass'in güçlü seçici altyapısına erişim sağlar.",
			"Provides functions that operate on numbers.": "Sayılarda çalışan işlevler sağlar.",
			"Removes quotes from a string.": "Dizeden tırnak işaretlerini kaldırır.",
			"Rename to '{0}'": "'{0}' olarak yeniden adlandırın",
			"Replaces $original with $replacement within $selector.": "$original öğesini $selector içinde $replacement ile değiştirir.",
			"Replaces the nth item in a list.": "Bir listedeki n. öğeyi değiştirir.",
			"Returns a list of all keys in a map.": "Eşlemedeki tüm anahtarların listesini döndürür.",
			"Returns a list of all values in a map.": "Eşlemedeki tüm değerlerin listesini döndürür.",
			"Returns a new map with keys removed.": "Anahtarları kaldırılmış yeni bir eşleme döndürür.",
			"Returns a random number.": "Rastgele bir sayı döndürür.",
			"Returns a specific item in a list.": "Listedeki belirli bir öğeyi döndürür.",
			"Returns the absolute value of a number.": "Sayının mutlak değerini döndürür.",
			"Returns the complement of a color.": "Bir rengin tümleyenini döndürür.",
			"Returns the index of the first occurance of $substring in $string.": "$string içindeki ilk $substring oluşumunun dizinini döndürür.",
			"Returns the inverse of a color.": "Rengin ters değerini döndürür.",
			"Returns the keywords passed to a function that takes variable arguments.": "Değişken bağımsız değişkenlerini alan bir işleve geçirilen anahtar sözcükleri döndürür.",
			"Returns the length of a list.": "Bir liste uzunluğunu döndürür.",
			"Returns the number of characters in a string.": "Dizedeki karakter sayısını verir.",
			"Returns the position of a value within a list.": "Bir listedeki değerin konumunu döndürür.",
			"Returns the separator of a list.": "Bir listenin ayırıcısını döndürür.",
			"Returns the simple selectors that comprise a compound selector.": "Bileşik seçici oluşturan basit seçicileri döndürür.",
			"Returns the string representation of a value as it would be represented in Sass.": "Değerin dize gösterimini Sass'de temsil edildiği şekilde döndürür.",
			"Returns the type of a value.": "Bir değerin türünü döndürür.",
			"Returns the unit(s) associated with a number.": "Bir sayıyla ilişkili birimleri döndürür.",
			"Returns the value in a map associated with a given key.": "Belirtilen anahtarla ilişkili bir eşlemedeki değeri döndürür.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "$super değerinin, $sub değerinin eşleştiği tüm öğelerle ve muhtemelen daha fazlasıyla eşleşip eşleşmediğini döndürür.",
			"Returns whether a feature exists in the current Sass runtime.": "Bir özelliğin geçerli Sass çalışma zamanında mevcut olup olmadığını döndürür.",
			"Returns whether a function with the given name exists.": "Belirtilen ada sahip bir işlevin mevcut olup olmadığını döndürür.",
			"Returns whether a map has a value associated with a given key.": "Eşlemenin belirtilen bir anahtarla ilişkili bir değere sahip olup olmadığını döndürür.",
			"Returns whether a mixin with the given name exists.": "Belirtilen ada sahip bir karışımın mevcut olup olmadığını döndürür.",
			"Returns whether a number has units.": "Bir sayının birimlere sahip olup olmadığını döndürür.",
			"Returns whether a variable with the given name exists in the current scope.": "Belirtilen ada sahip bir değişkenin geçerli kapsamda mevcut olup olmadığını döndürür.",
			"Returns whether a variable with the given name exists in the global scope.": "Belirtilen ada sahip bir değişkenin genel kapsamda mevcut olup olmadığını döndürür.",
			"Returns whether two numbers can be added, subtracted, or compared.": "İki sayının eklenebilir, çıkarılabilir veya karşılaştırılabilir olup olmadığını döndürür.",
			"Rounds a number down to the previous whole number.": "Sayıyı önceki tamsayıya yuvarlar.",
			"Rounds a number to the nearest whole number.": "Bir sayıyı en yakın tamsayıya yuvarlar.",
			"Rounds a number up to the next whole number.": "Sayıyı sonraki tamsayıya yuvarlar.",
			"Sass documentation": "Sass belgeleri",
			"Selector Specificity": "Seçici Özgüllük",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Bu kurallar HTML ile çok sıkı olarak birleştirilmiş olduğundan, seçiciler kimlik içermemelidir.",
			"The universal selector (*) is known to be slow": "Evrensel seçicinin (*) yavaş olduğu bilinir",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Bir ifadenin değerini yığın izlemesinde önemli bir hata olarak oluşturur. Karışımlara ve işlevlere yönelik bağımsız değişkenleri doğrulamada faydalıdır.",
			"URI expected": "Beklenen URI",
			"URL encodes a string": "URL bir dizeyi kodlar",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Her ikisiyle eşleşen öğelerle eşleşen bir seçici oluşturmak için iki seçiciyi birleştirir.",
			"Unknown at-rule.": "Bilinmeyen konum kuralı.",
			"Unknown property.": "Bilinmeyen özellik.",
			"Unknown property: '{0}'": "Bilinmeyen özellik: '{0}'",
			"Unknown vendor specific property.": "Bilinmeyen satıcıya özgü özellik.",
			"When using a vendor-specific prefix also include the standard property": "Satıcıya özgü ön ek kullanırken standart özelliği de ekleyin.",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Satıcıya özgü ön ek kullanırken satıcıya özel diğer tüm özellikleri de dahil ettiğinizden emin olun",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Bir ifade alan ve deyim, `false` olarak hesaplanana kadar iç içe stilleri tekrar tekrar çıkaran while döngüsü.",
			"[ expected": "[ bekleniyor",
			"] expected": "] bekleniyor",
			"absolute value of a number": "bir sayının mutlak değeri",
			"arccosine - inverse of cosine function": "arkkosinüs - kosinüs işlevinin tersi",
			"arcsine - inverse of sine function": "arksinüs - sinüs işlevinin tersi",
			"arctangent - inverse of tangent function": "arktanjant - tanjant işlevinin tersi",
			"argument from '{0}'": "'{0}' konumundaki bağımsız değişken",
			"at-rule or selector expected": "beklenen konum kuralı veya seçici",
			"at-rule unknown": "at-rule bilinmiyor",
			"bind the evaluation of a ruleset to each member of a list.": "kural kümesinin değerlendirmesini bir listedeki her üyeye bağlayın.",
			"calculates square root of a number": "Sayının karekökünü hesaplar",
			"colon expected": "iki nokta üst üste bekleniyor",
			"comma expected": "virgül bekleniyor",
			"condition expected": "koşul bekleniyor",
			"converts numbers from one type into another": "sayıları bir türden başka bir türe dönüştürür",
			"converts to a %, e.g. 0.5 > 50%": "bir % değerine ör. 0.5 > %50 olarak dönüştürür",
			"cosine function": "kosinüs işlevi",
			"creates a #AARRGGBB": "#AARRGGBB oluşturur",
			"creates a color": "renk oluşturur",
			"dot expected": "nokta bekleniyor",
			"escape string content": "kaçış dizesi içeriği",
			"expression expected": "ifade bekleniyor.",
			"first argument modulus second argument": "birinci bağımsız değişken modül ikinci bağımsız değişken",
			"first argument raised to the power of the second argument": "ikinci bağımsız değişken ilk bağımsız değişkenin kuvvetine yükseltildi",
			"generate a list spanning a range of values": "bir değer aralığını kapsayan liste oluşturma",
			"identifier expected": "Tanımlayıcı bekleniyor",
			"identifier or variable expected": "beklenen tanımlayıcı veya değişken",
			"identifier or wildcard expected": "tanımlayıcı veya joker karakter bekleniyor",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block, float nedeniyle yok sayıldı. 'float' değeri 'none' dışında bir değere sahipse alan kaydırılır ve 'display' değeri 'block' olarak kabul edilir",
			"inlines a resource and falls back to `url()`": "kaynağı satır içine alır ve `url()` değerine geri döner",
			"media query expected": "beklenen medya sorgusu",
			"number expected": "sayı bekleniyor",
			"operator expected": "işleç bekleniyor",
			"page directive or declaraton expected": "beklenen sayfa yönergesi veya bildirim",
			"parses a string to a color": "Dizeyi bir renge ayrıştırır",
			"percentage expected": "beklenen yüzde",
			"property value expected": "beklenen özellik değeri",
			"remove or change the unit of a dimension": "boyutun birimini kaldır veya değiştir",
			"return `@color` 10% points darker": "`@color` öğesini %10 puan daha koyu döndür",
			"return `@color` 10% points less saturated": "`@color` öğesini %10 puan daha düşük doygunlukla döndürür",
			"return `@color` 10% points less transparent": "%10 puan daha az saydam `@color` döndür",
			"return `@color` 10% points lighter": "`@color` öğesini %10 puan daha açık döndür",
			"return `@color` 10% points more saturated": "`@color` öğesini %10 puan daha yüksek doygunlukla döndür",
			"return `@color` 10% points more transparent": "`@color` öğesini %10 puan daha yüksek saydamlıkla döndür",
			"return `@color` with 50% transparency": "`@color` öğesini %50 saydamlıkla döndür",
			"return `@color` with a 10 degree larger in hue": "`@color` öğesini tonda 10 derece daha büyük olarak döndür",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "`@color1 is> 43% luma` ise `@darkcolor` döndür, aksi halde `@lightcolor` döndürür, notlara bakın",
			"return a mix of `@color1` and `@color2`": "`@color1` ve `@color2` karışımı döndür",
			"returns a grey, 100% desaturated color": "gri, doygunluğu %100 azaltılmış renk döndürür",
			"returns a value at the specified position in the list": "listede belirtilen konumdaki bir değeri döndürür",
			"returns one of two values depending on a condition.": "bir koşula bağlı olarak iki değerden birini döndürür.",
			"returns pi": "pi değerini döndürür",
			"returns the `alpha` channel of `@color`": "`@color` için `alpha` kanalını döndürür",
			"returns the `blue` channel of `@color`": "`@color` için `blue` kanalını döndürür",
			"returns the `green` channel of `@color`": "`@color` için `green` kanalını döndürür",
			"returns the `hue` channel of `@color` in the HSL space": "HSL alanında `@color` için `hue` kanalını döndürür",
			"returns the `hue` channel of `@color` in the HSV space": "HSV alanında `@color` için `hue` kanalını döndürür",
			"returns the `lightness` channel of `@color` in the HSL space": "HSL alanında `@color` öğesinin `lightness` kanalını döndürür",
			"returns the `luma` value (perceptual brightness) of `@color`": "`@color` için `luma` değerini (algısal parlaklık) döndürür",
			"returns the `red` channel of `@color`": "`@color` için `red` kanalını döndürür",
			"returns the `saturation` channel of `@color` in the HSL space": "HSL alanında `@color` için `saturation` kanalını döndürür",
			"returns the `saturation` channel of `@color` in the HSV space": "HSV alanında `@color` öğesinin `saturation` kanalını döndürür",
			"returns the `value` channel of `@color` in the HSV space": "HSV alanında `@color` için `value` kanalını döndürür",
			"returns the lowest of one or more values": "bir veya daha fazla değerin en küçüğünü döndürür",
			"returns the number of elements in a value list": "bir değer listesindeki öğe sayısını döndürür",
			"rounds a number to a number of places": "sayıyı bir basamak sayısına yuvarlar",
			"rounds down to an integer": "alt tamsayıya yuvarlar",
			"rounds up to an integer": "bir tamsayıya yuvarlar",
			"selector expected": "seçici bekleniyor",
			"semi-colon expected": "noktalı virgül bekleniyor",
			"sine function": "sinüs işlevi",
			"string literal expected": "Beklenen dize sabit değeri",
			"string replace": "dize değiştirme",
			"tangent function": "tanjant işlevi",
			"term expected": "terim bekleniyor",
			"unknown keyword": "bilinmeyen anahtar sözcük",
			"uri or string expected": "beklenen URI veya dize",
			"variable name expected": "değişken adı bekleniyor",
			"variable value expected": "değişken değeri bekleniyor",
			"whitespace expected": "boşluk bekleniyor",
			"wildcard expected": "beklenen joker karakter",
			"{ expected": "{ bekleniyor",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "} bekleniyor"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "`css.colorDecorators.enable` ayarı kullanım dışı bırakılarak yerine `editor.colorDecorators` ayarı getirildi.",
			"css.completion.completePropertyWithSemicolon.desc": "CSS özelliklerini tamamlarken satırın sonuna noktalı virgül ekleyin.",
			"css.completion.triggerPropertyValueCompletion.desc": "Varsayılan olarak VS Code, bir CSS özelliği seçildikten sonra özellik değeri tamamlamayı tetikler. Bu davranışı devre dışı bırakmak için bu ayarı kullanın.",
			"css.customData.desc": "[Özel veri biçimini](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md) izleyen JSON dosyalarını gösteren göreli dosya yollarının listesi.\r\n\r\nVS Code; özel CSS özellikleri (değişkenler), konum kuralları, sahte sınıflar ve JSON dosyalarında belirttiğiniz sahte öğeler için CSS desteğini geliştirmek üzere başlangıçta özel veriler yükler.\r\n\r\nDosya yolları çalışma alanına göredir ve yalnızca çalışma alanı klasör ayarları dikkate alınır.",
			"css.format.braceStyle.desc": "Küme ayraçlarını kurallarla aynı satıra yerleştir ('daralt') veya küme ayraçlarını kendi satırına yerleştir ('genişlet').",
			"css.format.enable.desc": "Varsayılan CSS biçimlendiricisini etkinleştir/devre dışı bırak.",
			"css.format.maxPreserveNewLines.desc": "'#css.format.preserveNewLines#' etkinleştirildiğinde tek bir öbekte saklanabilen maksimum satır sonu sayısı.",
			"css.format.newlineBetweenRules.desc": "Kural kümelerini boş bir satırla ayırın.",
			"css.format.newlineBetweenSelectors.desc": "Seçicileri yeni bir satırla ayırın.",
			"css.format.preserveNewLines.desc": "Öğelerin korunması gerekenden önce mevcut satırın sonlanıp sonlanmaması.",
			"css.format.spaceAroundSelectorSeparator.desc": "'>', '+', '~' seçici ayırıcılarının (ör. 'a > b') etrafında bir boşluk karakteri olduğundan emin olun.",
			"css.hover.documentation": "CSS üzerine gelindiğinde özellik ve değer belgelerini görüntüle.",
			"css.hover.references": "CSS üzerine gelme öğelerinde MDN başvurularını görüntüleyin.",
			"css.lint.argumentsInColorFunction.desc": "Geçersiz parametre sayısı.",
			"css.lint.boxModel.desc": "'padding' veya 'border' kullanırken 'width' ya da 'height' kullanmayın.",
			"css.lint.compatibleVendorPrefixes.desc": "Satıcıya özgü ön ek kullanırken satıcıya özgü diğer tüm özellikleri de dahil ettiğinizden emin olun.",
			"css.lint.duplicateProperties.desc": "Yinelenen stil tanımları kullanmayın.",
			"css.lint.emptyRules.desc": "Boş kural kümeleri kullanmayın.",
			"css.lint.float.desc": "'float' kullanmaktan kaçının. Float ayarları, düzenin bir yönden değişmesi durumunda kolayca bozulan kırılgan bir CSS ortaya çıkarır.",
			"css.lint.fontFaceProperties.desc": "'@font-face' kuralı 'src' ve 'font-family' özelliklerini tanımlamalıdır.",
			"css.lint.hexColorLength.desc": "Onaltılık renkler 3, 4, 6 veya 8 onaltılık sayıdan oluşmalıdır.",
			"css.lint.idSelector.desc": "Bu kurallar HTML ile çok sıkı olarak birleştirilmiş olduğundan, seçiciler kimlik içermemelidir.",
			"css.lint.ieHack.desc": "IE kodlaması yalnızca IE7 ve daha eski sürümler desteklenirken gereklidir.",
			"css.lint.importStatement.desc": "İçeri aktarma deyimleri paralel olarak yüklenmez.",
			"css.lint.important.desc": "'!important' kullanmaktan kaçının. Bu, CSS'nin tüm özgül değerlerinin denetimden çıktığını ve yeniden düzenleme yapılması gerektiğini gösterir.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "Özellik, ekran nedeniyle yoksayıldı. Örneğin, 'display: inline' ile 'width', 'height', 'margin-top', 'margin-bottom' ve 'float' özelliklerinin bir etkisi yoktur.",
			"css.lint.universalSelector.desc": "Evrensel seçici ('*') yavaş olarak bilinir.",
			"css.lint.unknownAtRules.desc": "Bilinmeyen konum kuralı.",
			"css.lint.unknownProperties.desc": "Bilinmeyen özellik.",
			"css.lint.unknownVendorSpecificProperties.desc": "Bilinmeyen satıcıya özgü özellik.",
			"css.lint.validProperties.desc": "'unknownProperties' kuralına göre doğrulanmamış özellikler listesi.",
			"css.lint.vendorPrefix.desc": "Satıcıya özgü ön ek kullanırken standart özelliği de ekleyin.",
			"css.lint.zeroUnits.desc": "Sıfır için birim gerekli değil.",
			"css.title": "CSS",
			"css.trace.server.desc": "VS Code ile CSS dil sunucusu arasındaki iletişimi izler.",
			"css.validate.desc": "Tüm doğrulamaları etkinleştirir veya devre dışı bırakır.",
			"css.validate.title": "CSS doğrulamasını ve sorun önem derecelerini denetler.",
			"description": "CSS, LESS ve SCSS dosyaları için zengin dil desteği sağlar.",
			"displayName": "CSS Dili Özellikleri",
			"less.colorDecorators.enable.deprecationMessage": "`less.colorDecorators.enable` ayarı kullanım dışı bırakılarak yerine `editor.colorDecorators` getirildi.",
			"less.completion.completePropertyWithSemicolon.desc": "CSS özelliklerini tamamlarken satırın sonuna noktalı virgül ekleyin.",
			"less.completion.triggerPropertyValueCompletion.desc": "Varsayılan olarak VS Code, bir CSS özelliği seçildikten sonra özellik değeri tamamlamayı tetikler. Bu davranışı devre dışı bırakmak için bu ayarı kullanın.",
			"less.format.braceStyle.desc": "Küme ayraçlarını kurallarla aynı satıra yerleştir ('daralt') veya küme ayraçlarını kendi satırına yerleştir ('genişlet').",
			"less.format.enable.desc": "Varsayılan LESS biçimlendiricisini etkinleştir/devre dışı bırak.",
			"less.format.maxPreserveNewLines.desc": "'#less.format.preserveNewLines#' etkinleştirildiğinde tek bir öbekte saklanabilen maksimum satır sonu sayısı.",
			"less.format.newlineBetweenRules.desc": "Kural kümelerini boş bir satırla ayırın.",
			"less.format.newlineBetweenSelectors.desc": "Seçicileri yeni bir satırla ayırın.",
			"less.format.preserveNewLines.desc": "Öğelerin korunması gerekenden önce mevcut satırın sonlanıp sonlanmaması.",
			"less.format.spaceAroundSelectorSeparator.desc": "'>', '+', '~' seçici ayırıcılarının (ör. 'a > b') etrafında bir boşluk karakteri olduğundan emin olun.",
			"less.hover.documentation": "LESS üzerine gelindiğinde özellik ve değer belgelerini görüntüle.",
			"less.hover.references": "LESS üzerine gelme öğelerinde MDN başvurularını görüntüleyin.",
			"less.lint.argumentsInColorFunction.desc": "Geçersiz parametre sayısı.",
			"less.lint.boxModel.desc": "'padding' veya 'border' kullanırken 'width' ya da 'height' kullanmayın.",
			"less.lint.compatibleVendorPrefixes.desc": "Satıcıya özgü ön ek kullanırken satıcıya özgü diğer tüm özellikleri de dahil ettiğinizden emin olun.",
			"less.lint.duplicateProperties.desc": "Yinelenen stil tanımları kullanmayın.",
			"less.lint.emptyRules.desc": "Boş kural kümeleri kullanmayın.",
			"less.lint.float.desc": "'float' kullanmaktan kaçının. Float ayarları, düzenin bir yönden değişmesi durumunda kolayca bozulan kırılgan bir CSS ortaya çıkarır.",
			"less.lint.fontFaceProperties.desc": "'@font-face' kuralı 'src' ve 'font-family' özelliklerini tanımlamalıdır.",
			"less.lint.hexColorLength.desc": "Onaltılık renkler 3, 4, 6 veya 8 onaltılık sayıdan oluşmalıdır.",
			"less.lint.idSelector.desc": "Bu kurallar HTML ile çok sıkı olarak birleştirilmiş olduğundan, seçiciler kimlik içermemelidir.",
			"less.lint.ieHack.desc": "IE kodlaması yalnızca IE7 ve daha eski sürümler desteklenirken gereklidir.",
			"less.lint.importStatement.desc": "İçeri aktarma deyimleri paralel olarak yüklenmez.",
			"less.lint.important.desc": "'!important' kullanmaktan kaçının. Bu, CSS'nin tüm özgül değerlerinin denetimden çıktığını ve yeniden düzenleme yapılması gerektiğini gösterir.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "Özellik, ekran nedeniyle yoksayıldı. Örneğin, 'display: inline' ile 'width', 'height', 'margin-top', 'margin-bottom' ve 'float' özelliklerinin bir etkisi yoktur.",
			"less.lint.universalSelector.desc": "Evrensel seçici ('*') yavaş olarak bilinir.",
			"less.lint.unknownAtRules.desc": "Bilinmeyen konum kuralı.",
			"less.lint.unknownProperties.desc": "Bilinmeyen özellik.",
			"less.lint.unknownVendorSpecificProperties.desc": "Bilinmeyen satıcıya özgü özellik.",
			"less.lint.validProperties.desc": "'unknownProperties' kuralına göre doğrulanmamış özellikler listesi.",
			"less.lint.vendorPrefix.desc": "Satıcıya özgü ön ek kullanırken standart özelliği de ekleyin.",
			"less.lint.zeroUnits.desc": "Sıfır için birim gerekli değil.",
			"less.title": "LESS",
			"less.validate.desc": "Tüm doğrulamaları etkinleştirir veya devre dışı bırakır.",
			"less.validate.title": "LESS doğrulamasını ve sorun önem derecelerini denetler.",
			"scss.colorDecorators.enable.deprecationMessage": "`scss.colorDecorators.enable` ayarı kullanım dışı bırakılarak yerine `editor.colorDecorators` getirildi.",
			"scss.completion.completePropertyWithSemicolon.desc": "CSS özelliklerini tamamlarken satırın sonuna noktalı virgül ekleyin.",
			"scss.completion.triggerPropertyValueCompletion.desc": "Varsayılan olarak VS Code, bir CSS özelliği seçildikten sonra özellik değeri tamamlamayı tetikler. Bu davranışı devre dışı bırakmak için bu ayarı kullanın.",
			"scss.format.braceStyle.desc": "Küme ayraçlarını kurallarla aynı satıra yerleştir ('daralt') veya küme ayraçlarını kendi satırına yerleştir ('genişlet').",
			"scss.format.enable.desc": "Varsayılan SCSS biçimlendiricisini etkinleştir/devre dışı bırak.",
			"scss.format.maxPreserveNewLines.desc": "'#scss.format.preserveNewLines#' etkinleştirildiğinde tek bir öbekte saklanabilen maksimum satır sonu sayısı.",
			"scss.format.newlineBetweenRules.desc": "Kural kümelerini boş bir satırla ayırın.",
			"scss.format.newlineBetweenSelectors.desc": "Seçicileri yeni bir satırla ayırın.",
			"scss.format.preserveNewLines.desc": "Öğelerin korunması gerekenden önce mevcut satırın sonlanıp sonlanmaması.",
			"scss.format.spaceAroundSelectorSeparator.desc": "'>', '+', '~' seçici ayırıcılarının (ör. 'a > b') etrafında bir boşluk karakteri olduğundan emin olun.",
			"scss.hover.documentation": "SCSS üzerine gelindiğinde özellik ve değer belgelerini görüntüle.",
			"scss.hover.references": "SCSS üzerine gelme öğelerinde MDN başvurularını görüntüleyin.",
			"scss.lint.argumentsInColorFunction.desc": "Geçersiz parametre sayısı.",
			"scss.lint.boxModel.desc": "'padding' veya 'border' kullanırken 'width' ya da 'height' kullanmayın.",
			"scss.lint.compatibleVendorPrefixes.desc": "Satıcıya özgü ön ek kullanırken satıcıya özgü diğer tüm özellikleri de dahil ettiğinizden emin olun.",
			"scss.lint.duplicateProperties.desc": "Yinelenen stil tanımları kullanmayın.",
			"scss.lint.emptyRules.desc": "Boş kural kümeleri kullanmayın.",
			"scss.lint.float.desc": "'float' kullanmaktan kaçının. Float ayarları, düzenin bir yönden değişmesi durumunda kolayca bozulan kırılgan bir CSS ortaya çıkarır.",
			"scss.lint.fontFaceProperties.desc": "'@font-face' kuralı 'src' ve 'font-family' özelliklerini tanımlamalıdır.",
			"scss.lint.hexColorLength.desc": "Onaltılık renkler 3, 4, 6 veya 8 onaltılık sayıdan oluşmalıdır.",
			"scss.lint.idSelector.desc": "Bu kurallar HTML ile çok sıkı olarak birleştirilmiş olduğundan, seçiciler kimlik içermemelidir.",
			"scss.lint.ieHack.desc": "IE kodlaması yalnızca IE7 ve daha eski sürümler desteklenirken gereklidir.",
			"scss.lint.importStatement.desc": "İçeri aktarma deyimleri paralel olarak yüklenmez.",
			"scss.lint.important.desc": "'!important' kullanmaktan kaçının. Bu, CSS'nin tüm özgül değerlerinin denetimden çıktığını ve yeniden düzenleme yapılması gerektiğini gösterir.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "Özellik, ekran nedeniyle yoksayıldı. Örneğin, 'display: inline' ile 'width', 'height', 'margin-top', 'margin-bottom' ve 'float' özelliklerinin bir etkisi yoktur.",
			"scss.lint.universalSelector.desc": "Evrensel seçici ('*') yavaş olarak bilinir.",
			"scss.lint.unknownAtRules.desc": "Bilinmeyen at-rule.",
			"scss.lint.unknownProperties.desc": "Bilinmeyen özellik.",
			"scss.lint.unknownVendorSpecificProperties.desc": "Bilinmeyen satıcıya özgü özellik.",
			"scss.lint.validProperties.desc": "'unknownProperties' kuralına göre doğrulanmamış özellikler listesi.",
			"scss.lint.vendorPrefix.desc": "Satıcıya özgü ön ek kullanırken standart özelliği de ekleyin.",
			"scss.lint.zeroUnits.desc": "Sıfır için birim gerekli değil.",
			"scss.title": "SCSS (Sass)",
			"scss.validate.desc": "Tüm doğrulamaları etkinleştirir veya devre dışı bırakır.",
			"scss.validate.title": "SCSS doğrulamasını ve sorun önem derecelerini denetler."
		}
	}
}