{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"store\" um teste booliano para avaliação posterior em uma proteção ou if().",
			"'from' expected": "'from' esperado",
			"'in' expected": "'in' esperado",
			"'through' or 'to' expected": "\"through\" ou \"to\" esperado",
			"'{0}'": "\"{0}\"",
			"( expected": "( esperado",
			") expected": ") esperado",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "A regra @font-face precisa definir as propriedades `src` e `font-family`.",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Uma lista de propriedades que não são validadas em relação à regra `unknownProperties`.",
			"Adds quotes to a string.": "Adiciona aspas a uma cadeia de caracteres.",
			"Also define the standard property '{0}' for compatibility": "Também defina a propriedade padrão '{0}' para compatibilidade",
			"Always define standard rule '@keyframes' when defining keyframes.": "Sempre definir a regra padrão '@keyframes' ao definir os quadros-chave.",
			"Always include all vendor specific properties: Missing: {0}": "Sempre incluir todas as propriedades específicas do fornecedor: Ausente: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Sempre incluir todas as regras específicas do fornecedor: Ausente: {0}",
			"Appends a single value onto the end of a list.": "Acrescenta um único valor ao final de uma lista.",
			"Appends selectors to one another without spaces in between.": "Acrescenta seletores um ao outro sem espaços entre eles.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Evite usar !important. É uma indicação de que a especificidade do CSS inteiro ficou sem controle e precisa ser refatorada.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Evite usar \"float\". O uso de floats leva a um CSS frágil que será facilmente interrompido se um aspecto do layout for alterado.",
			"Causes one or more rules to be emitted at the root of the document.": "Faz com que uma ou mais regras sejam emitidas na raiz do documento.",
			"Changes one or more properties of a color.": "Altera uma ou mais propriedades de uma cor.",
			"Changes the alpha component for a color.": "Altera o componente alfa para uma cor.",
			"Changes the hue of a color.": "Altera o matiz de uma cor.",
			"Character entity representing '{0}'": "Entidade de caracteres representando “{0}”",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Entidade de caractere representando “{0}”, equivalente em Unicode “{1}”",
			"Closing bracket expected.": "Colchete de fechamento esperado.",
			"Closing bracket missing.": "Colchete de fechamento ausente.",
			"Combines several lists into a single multidimensional list.": "Combina várias listas em uma única lista multidimensional.",
			"Configure": "Configurar",
			"Converts a color into the format understood by IE filters.": "Converte uma cor no formato compreendido pelos filtros do IE.",
			"Converts a color to grayscale.": "Converte uma cor em escala de cinza.",
			"Converts a string to lower case.": "Converte uma cadeia de caracteres em letras minúsculas.",
			"Converts a string to upper case.": "Converte uma cadeia de caracteres em letras maiúsculas.",
			"Converts a unitless number to a percentage.": "Converte um número sem unidade em uma porcentagem.",
			"Creates a Color from hue, saturation, and lightness values.": "Cria uma Cor com base nos valores de matiz, saturação e luz.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Cria uma Cor com base na matiz, saturação, luz e valores alfa.",
			"Creates a Color from hue, white, and black values.": "Cria uma cor a partir dos valores de matiz, branco e preto.",
			"Creates a Color from lightness, a, and b values.": "Cria uma cor a partir dos valores de luminosidade, a e b.",
			"Creates a Color from lightness, chroma, and hue values.": "Cria uma cor a partir dos valores de luminosidade, croma e matiz.",
			"Creates a Color from red, green, and blue values.": "Cria uma Cor com base nos valores vermelho, verde e azul.",
			"Creates a Color from red, green, blue, and alpha values.": "Cria uma Cor com base nos valores vermelho, verde, azul e alfa.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Cria uma cor a partir dos valores de matiz, saturação e luminosidade de outra cor.",
			"Creates a Color from the hue, white, and black values of another Color.": "Cria uma cor a partir dos valores de matiz, branco e preto de outra cor.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Cria uma Color a partir dos valores de luminosidade, a e b de outra Color.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Cria uma cor a partir dos valores de luminosidade, croma e matiz de outra cor.",
			"Creates a Color from the red, green, and blue values of another Color.": "Cria uma cor a partir dos valores de vermelho, verde e azul de outra cor.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Cria uma cor em um espaço de cor específico a partir dos valores de vermelho, verde e azul.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Cria uma cor em um espaço de cor específico a partir dos valores de vermelho, verde e azul de outra cor.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Define operações complexas que podem ser reusadas nas folhas de estilo.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Define estilos que podem ser reutilizados em toda a folha de estilos com `@include.",
			"Do not use duplicate style definitions": "Não use definições de estilo duplicadas",
			"Do not use empty rulesets": "Não use conjuntos de regras vazios.",
			"Do not use width or height when using padding or border": "Não use largura nem altura ao usar o preenchimento ou a borda",
			"Dynamically calls a Sass function.": "Chama dinamicamente uma função do Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Cada loop que define '$var' para cada item na lista ou no mapa e, em seguida, gera os estilos que ele contém usando esse valor de '$var'.",
			"End tag name expected.": "Nome de marca final esperado.",
			"Exposes the details of Sass’s inner workings.": "Expõe os detalhes dos funcionamentos internos de Sass.",
			"Extends $extendee with $extender within $selector.": "Estende $extendee com $extender dentro de $selector.",
			"Extracts a substring from $string.": "Extrai uma subcadeia de caracteres $string.",
			"Finds the maximum of several numbers.": "Localiza o máximo de vários números.",
			"Finds the minimum of several numbers.": "Localiza o mínimo de vários números.",
			"Fluidly scales one or more properties of a color.": "Dimensiona fluidamente uma ou mais propriedades de uma cor.",
			"Folding Region End": "Fim da Região de Dobragem",
			"Folding Region Start": "Início da Região de Dobragem",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Loop For que gera repetidamente um conjunto de estilos para cada '$var' na cláusula 'from/through' ou 'from/to'.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Gera novas cores com base nas existentes, facilitando a criação de temas de cores.",
			"Gets the blue component of a color.": "Obtém o componente azul de uma cor.",
			"Gets the green component of a color.": "Obtém o componente verde de uma cor.",
			"Gets the hue component of a color.": "Obtém o componente de matiz de uma cor.",
			"Gets the lightness component of a color.": "Obtém o componente de luz de uma cor.",
			"Gets the opacity component of a color.": "Obtém o componente de opacidade de uma cor.",
			"Gets the red component of a color.": "Obtém o componente vermelho de uma cor.",
			"Gets the saturation component of a color.": "Obtém o componente de saturação de uma cor.",
			"HTML Language Server": "Servidor de Linguagem HTML",
			"Hex colors must consist of three, four, six or eight hex numbers": "As cores hexa devem consistir em três, quatro, seis ou oito números hexa",
			"IE hacks are only necessary when supporting IE7 and older": "Os raqueamentos do IE só são necessários quando há suporte para IE7 e anteriores.",
			"Import statements do not load in parallel": "As instruções de importação não são carregadas em paralelo",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Incluirá o corpo se a expressão não for avaliada como `false` ou `null`.",
			"Includes the styles defined by another mixin into the current rule.": "Inclui os estilos definidos por outra combinação na regra atual.",
			"Increases or decreases one or more components of a color.": "Aumenta ou diminui um ou mais componentes de uma cor.",
			"Inherits the styles of another selector.": "Herda os estilos de outro seletor.",
			"Inserts $insert into $string at $index.": "Insere $insert no $string no $index.",
			"Invalid number of parameters": "Número inválido de parâmetros",
			"Joins together two lists into one.": "Une duas listas em uma.",
			"Lets you access and modify values in lists.": "Permite que você acesse e modifique valores em listas.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Carrega uma folha de estilos Sass e disponibiliza suas mesclagens, funções e variáveis quando carregada com a regra @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Carrega mixins, funções e variáveis de outras folhas de estilos Sass como 'módulos' e combina o CSS de várias folhas de estilo juntas.",
			"Makes a color darker.": "Escurece uma cor.",
			"Makes a color less saturated.": "Torna uma cor menos saturada.",
			"Makes a color lighter.": "Clareia uma cor.",
			"Makes a color more opaque.": "Torna uma cor mais opaca.",
			"Makes a color more saturated.": "Torna uma cor mais saturada.",
			"Makes a color more transparent.": "Torna uma cor mais transparente.",
			"Makes it easy to combine, search, or split apart strings.": "Facilita combinar, pesquisar ou dividir cadeias de caracteres.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Permite pesquisar o valor associado a uma chave em um mapa e muito mais.",
			"Merges two maps together into a new map.": "Mescla dois mapas em um novo mapa.",
			"Mix two colors together in a polar color space.": "Misture duas cores em um espaço de cores polar.",
			"Mix two colors together in a rectangular color space.": "Misture duas cores em um espaço de cores retangular.",
			"Mixes two colors together.": "Combina duas cores.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Aninha o seletor abaixo um do outro como se eles seriam aninhados na folha de estilos.",
			"No unit for zero needed": "Sem necessidade de unidade para zero",
			"Parses a selector into the format returned by &.": "Analisa um seletor no formato retornado por &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Imprime o valor de uma expressão no fluxo de saída de erro padrão. Útil para depurar arquivos Sass complicados.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Imprime o valor de uma expressão no fluxo de saída de erro padrão. Útil para bibliotecas que precisam avisar os usuários sobre substituições ou recuperação de erros de uso secundários de mesclagem. Os avisos podem ser desativados com a opção de linha de comando `--quiet` ou a opção `:quiet` de Sass.",
			"Property is ignored due to the display.": "A propriedade foi ignorada devido à exibição.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "A propriedade é ignorada devido à exibição. Com 'display: block', o alinhamento vertical não deve ser usado.",
			"Provides access to Sass’s powerful selector engine.": "Fornece acesso ao poderoso mecanismo de seletor de Sass.",
			"Provides functions that operate on numbers.": "Fornece as funções que operam em números.",
			"Removes quotes from a string.": "Remove aspas de uma cadeia de caracteres.",
			"Rename to '{0}'": "Renomear para \"{0}\"",
			"Replaces $original with $replacement within $selector.": "Substitui $original por $replacement dentro do $selector.",
			"Replaces the nth item in a list.": "Substitui o item nth em uma lista.",
			"Returns a list of all keys in a map.": "Retorna uma lista de todos os valores em um mapa.",
			"Returns a list of all values in a map.": "Retorna uma lista de todos os valores em um mapa.",
			"Returns a new map with keys removed.": "Retorna um novo mapa com as chaves removidas.",
			"Returns a random number.": "Retorna um número aleatório.",
			"Returns a specific item in a list.": "Retorna um item específico em uma lista.",
			"Returns the absolute value of a number.": "Retorna o valor absoluto de um número.",
			"Returns the complement of a color.": "Retorna o complemento de uma cor.",
			"Returns the index of the first occurance of $substring in $string.": "Retorna o índice da primeira ocorrência de $substring em $string.",
			"Returns the inverse of a color.": "Retorna o inverso de uma cor.",
			"Returns the keywords passed to a function that takes variable arguments.": "Retorna as palavras-chave passadas para uma função que aceita argumentos variáveis.",
			"Returns the length of a list.": "Retorna o comprimento de uma lista.",
			"Returns the number of characters in a string.": "Retorna o número de caracteres em uma cadeia de caracteres.",
			"Returns the position of a value within a list.": "Retorna a posição de um valor dentro de uma lista.",
			"Returns the separator of a list.": "Retorna o separador de uma lista.",
			"Returns the simple selectors that comprise a compound selector.": "Retorna os seletores simples que compõem um seletor composto.",
			"Returns the string representation of a value as it would be represented in Sass.": "Retorna a representação de cadeia de caracteres de um valor como ele seria representado em Sass.",
			"Returns the type of a value.": "Retorna o tipo de um valor.",
			"Returns the unit(s) associated with a number.": "Retorna a(s) unidade(s) associada(s) a um número.",
			"Returns the value in a map associated with a given key.": "Retorna o valor em um mapa associado a uma determinada chave.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Retorna se $super corresponde a todos os elementos $sub e, possivelmente, mais.",
			"Returns whether a feature exists in the current Sass runtime.": "Retorna se um recurso existe no runtime do Sass atual.",
			"Returns whether a function with the given name exists.": "Retorna se uma função com o nome fornecido existe.",
			"Returns whether a map has a value associated with a given key.": "Retorna se um mapa tem um valor associado a uma determinada chave.",
			"Returns whether a mixin with the given name exists.": "Retorna se existe uma combinação com o nome fornecido.",
			"Returns whether a number has units.": "Retorna se um número tem unidades.",
			"Returns whether a variable with the given name exists in the current scope.": "Retorna se uma variável com o nome fornecido existe no escopo atual.",
			"Returns whether a variable with the given name exists in the global scope.": "Retorna se uma variável com o nome fornecido existe no escopo global.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Retorna se dois números podem ser adicionados, subtraídos ou comparados.",
			"Rounds a number down to the previous whole number.": "Arredonda esse número para baixo até o número inteiro anterior.",
			"Rounds a number to the nearest whole number.": "Arredonda um número para o número inteiro mais próximo.",
			"Rounds a number up to the next whole number.": "Arredonda um número para cima até o próximo número inteiro.",
			"Sass documentation": "Documentação do Sass",
			"Selector Specificity": "Especificação do Seletor",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Os seletores não devem conter IDs porque essas regras estão intimamente vinculadas ao HTML.",
			"Simple HTML5 starting point": "Ponto Inicial do HTML5 Simples",
			"Start tag name expected.": "Nome da marca final esperado.",
			"Tag name must directly follow the open bracket.": "O nome da marca deve seguir diretamente o colchete aberto.",
			"The universal selector (*) is known to be slow": "O seletor universal (`*`) é sabidamente lento.",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Gera o valor de uma expressão como um erro fatal com rastreamento de pilha. Útil para validar argumentos para mixins e funções.",
			"URI expected": "URI esperado",
			"URL encodes a string": "A URL codifica uma cadeia de caracteres",
			"Unexpected character in tag.": "Caractere inesperado na tag.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Unifica dois seletores para produzir um seletor que corresponde aos elementos correspondentes por ambos.",
			"Unknown at-rule.": "Regra \"at\" desconhecida.",
			"Unknown property.": "Propriedade desconhecida.",
			"Unknown property: '{0}'": "Propriedade desconhecida: '{0}'",
			"Unknown vendor specific property.": "Propriedade específica do fornecedor desconhecida.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "O VS Code agora tem suporte interno para as marcas de renomeação automática. Deseja habilitá-lo?",
			"When using a vendor-specific prefix also include the standard property": "Ao usar um prefixo específico do fornecedor, inclua também a propriedade padrão.",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Ao usar um prefixo específico de fornecedor, certifique-se de também incluir todas as outras propriedades específicas do fornecedor.",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Loop While que usa uma expressão e gera repetidamente os estilos aninhados até que a instrução seja avaliada como 'false'.",
			"[ expected": "[ esperado",
			"] expected": "] esperado",
			"absolute value of a number": "valor absoluto de um número",
			"arccosine - inverse of cosine function": "arco cosseno - inverso da função cosseno",
			"arcsine - inverse of sine function": "arco seno - inverso da função seno",
			"arctangent - inverse of tangent function": "arco tangente - inverso da função tangente",
			"argument from '{0}'": "argumento de “{0}”",
			"at-rule or selector expected": "na regra ou seletor esperado",
			"at-rule unknown": "em regra desconhecida",
			"bind the evaluation of a ruleset to each member of a list.": "associar a avaliação de um conjunto de regras a cada membro de uma lista.",
			"calculates square root of a number": "Calcula a raiz quadrada de um número",
			"colon expected": "Dois-pontos esperados",
			"comma expected": "vírgula esperada",
			"condition expected": "condição esperada",
			"converts numbers from one type into another": "converte números de um tipo em outro",
			"converts to a %, e.g. 0.5 > 50%": "converte em um %, por exemplo, 0,5 > 50%",
			"cosine function": "função cosseno",
			"creates a #AARRGGBB": "cria um #AARRGGBB",
			"creates a color": "cria uma cor",
			"dot expected": "ponto esperado",
			"escape string content": "conteúdo da cadeia de caracteres de escape",
			"expression expected": "expressão esperada",
			"first argument modulus second argument": "primeiro argumento de módulo de segundo argumento",
			"first argument raised to the power of the second argument": "primeiro argumento elevado à potência do segundo argumento",
			"generate a list spanning a range of values": "gera uma lista que abrange um intervalo de valores",
			"identifier expected": "identificador esperado",
			"identifier or variable expected": "identificador ou variável esperados",
			"identifier or wildcard expected": "identificador ou curinga esperados",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "bloco embutido é ignorado devido ao float. Se \"float\" tiver um valor diferente de \"none\", a caixa será flutuante e \"display\" será tratado como \"block\"",
			"inlines a resource and falls back to `url()`": "embute um recurso e retorna para `url()`",
			"media query expected": "consulta de mídia esperada",
			"number expected": "número esperado",
			"operator expected": "operador esperado",
			"page directive or declaraton expected": "diretiva de página ou declaração esperada.",
			"parses a string to a color": "analisa uma cadeia de caracteres para uma cor",
			"percentage expected": "porcentagem esperada",
			"property value expected": "valor de propriedade esperado",
			"remove or change the unit of a dimension": "remover ou alterar a unidade de uma dimensão",
			"return `@color` 10% points darker": "retornar '@color' 10% pontos mais escuros",
			"return `@color` 10% points less saturated": "retorna `@color` 10% pontos menos saturados",
			"return `@color` 10% points less transparent": "retornar '@color' 10% pontos menos transparentes",
			"return `@color` 10% points lighter": "retorna `@color` 10% pontos mais claros",
			"return `@color` 10% points more saturated": "retornar '@color' 10% pontos mais saturados",
			"return `@color` 10% points more transparent": "retornar '@color' 10% pontos mais transparentes",
			"return `@color` with 50% transparency": "retornar '@color' com 50% de transparência",
			"return `@color` with a 10 degree larger in hue": "retornar '@color' com um matiz de 10 graus maior",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "retornar '@darkcolor' se '@color1 for> 43% luma', caso contrário, retorne '@lightcolor', consulte as anotações",
			"return a mix of `@color1` and `@color2`": "retornar uma mistura de '@color1' e '@color2'",
			"returns a grey, 100% desaturated color": "retorna uma cor cinza 100% sem saturação",
			"returns a value at the specified position in the list": "retorna um valor na posição especificada na lista",
			"returns one of two values depending on a condition.": "retorna um dos dois valores dependendo de uma condição.",
			"returns pi": "retorna pi",
			"returns the `alpha` channel of `@color`": "retorna o canal 'alfa' de '@color'",
			"returns the `blue` channel of `@color`": "retorna o canal 'blue' de '@color'",
			"returns the `green` channel of `@color`": "retorna o canal `green` de `@color`",
			"returns the `hue` channel of `@color` in the HSL space": "retorna o canal `hue` de `@color` no espaço HSV",
			"returns the `hue` channel of `@color` in the HSV space": "retorna o canal 'hue' de '@color' no espaço HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "retorna o canal 'lightness' de '@color' no espaço HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "retorna o valor `luma` (brilho perceptivo) de `@color`",
			"returns the `red` channel of `@color`": "retorna o canal `red` de `@color`",
			"returns the `saturation` channel of `@color` in the HSL space": "retorna o canal 'saturação' de '@color' no espaço HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "retorna o canal 'saturation' de '@color' no espaço HSV",
			"returns the `value` channel of `@color` in the HSV space": "retorna o canal 'value' de '@color' no espaço HSV",
			"returns the lowest of one or more values": "retorna o menor de um ou mais valores",
			"returns the number of elements in a value list": "retorna o número de elementos em uma lista de valores",
			"rounds a number to a number of places": "arredonda um número para um número de casas",
			"rounds down to an integer": "arredonda para baixo para um inteiro",
			"rounds up to an integer": "arredonda para cima até um inteiro",
			"selector expected": "seletor esperado",
			"semi-colon expected": "ponto e vírgula esperado",
			"sine function": "função seno",
			"string literal expected": "literal de cadeia de caracteres esperado",
			"string replace": "substituição de cadeia de caracteres",
			"tangent function": "função tangente",
			"term expected": "termo esperado",
			"unknown keyword": "palavra-chave desconhecida",
			"uri or string expected": "URI ou cadeia de caracteres esperados",
			"variable name expected": "nome da variável esperado",
			"variable value expected": "valor de variável esperado",
			"whitespace expected": "espaço em branco esperado",
			"wildcard expected": "curinga esperado",
			"{ expected": "{ esperada",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "} esperada"
		},
		"package": {
			"description": "Fornece suporte de linguagem avançada para arquivos HTML e Handlebar",
			"displayName": "Recursos da Linguagem HTML",
			"html.autoClosingTags": "Habilitar/desabilitar o fechamento automático de marcas HTML.",
			"html.autoCreateQuotes": "Habilitar/desabilitar a criação automática de aspas para atribuição de atributos HTML. O tipo de aspas pode ser configurado por '#html.completion.attributeDefaultValue#'.",
			"html.completion.attributeDefaultValue": "Controla o valor padrão dos atributos quando a conclusão é aceita.",
			"html.completion.attributeDefaultValue.doublequotes": "O valor do atributo é definido como \"\".",
			"html.completion.attributeDefaultValue.empty": "O valor do atributo não está definido.",
			"html.completion.attributeDefaultValue.singlequotes": "O valor do atributo é definido como ''.",
			"html.customData.desc": "Uma lista de caminhos de arquivo relativos apontando para arquivos JSON após o [custom data format](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nO VS Code carrega dados personalizados na inicialização para aprimorar o suporte a HTML para as marcas HTML personalizadas, atributos e valores de atributo que você especifica nos arquivos JSON.\r\n\r\nOs caminhos do arquivo são relativos ao espaço de trabalho e somente as configurações da pasta do espaço de trabalho são consideradas.",
			"html.format.contentUnformatted.desc": "Lista de marcas, separadas por vírgulas, nas quais o conteúdo não deve ser reformatado. `null` usa a marca `pre` como padrão.",
			"html.format.enable.desc": "Habilitar/desabilitar o formatador HTML padrão.",
			"html.format.extraLiners.desc": "Lista de marcas, separadas por vírgulas, que devem ter uma nova linha extra antes delas. `null` usa `\"head, body, /html\"` como padrão.",
			"html.format.indentHandlebars.desc": "Formatar e recuar `{{#foo}}` e `{{/foo}}`.",
			"html.format.indentInnerHtml.desc": "Recuar as seções `<head>` e `<body>`.",
			"html.format.maxPreserveNewLines.desc": "Número máximo de quebras de linha a serem preservadas em uma parte. Use `null` para ilimitado.",
			"html.format.preserveNewLines.desc": "Controla se quebras de linha existentes antes de elementos devem ser preservadas. Só funciona antes de elementos, não dentro de marcas ou para texto.",
			"html.format.templating.desc": "Honrar as marcas de linguagem de modelagem django, erb, handlebars e php.",
			"html.format.unformatted.desc": "Lista de marcas, separadas por vírgulas, que não devem ser reformatadas. `null` usa como padrão todas as marcas listadas em https://www.w3.org/TR/html5/dom.html#phrasing-content.",
			"html.format.unformattedContentDelimiter.desc": "Manter o conteúdo de texto junto entre esta cadeia de caracteres.",
			"html.format.wrapAttributes.alignedmultiple": "Quebrar linha quando o comprimento dela for excedido, alinhar os atributos verticalmente.",
			"html.format.wrapAttributes.auto": "Quebrar linha dos atributos somente quando o comprimento da linha for excedido.",
			"html.format.wrapAttributes.desc": "Quebrar linha dos atributos.",
			"html.format.wrapAttributes.force": "Quebrar linha de todos os atributos, exceto do primeiro.",
			"html.format.wrapAttributes.forcealign": "Quebrar linha de todos os atributos, exceto do primeiro, e manter alinhado.",
			"html.format.wrapAttributes.forcemultiline": "Quebrar linha de todos os atributos.",
			"html.format.wrapAttributes.preserve": "Preservar a disposição dos atributos.",
			"html.format.wrapAttributes.preservealigned": "Preservar quebra de linha dos atributos, mas alinhar.",
			"html.format.wrapAttributesIndentSize.desc": "Recue atributos encapsulados para depois de N caracteres. Use `null` para usar o tamanho de recuo padrão. Ignorado se `#html.format.wrapAttributes#` estiver definido como ''aligned''.",
			"html.format.wrapLineLength.desc": "Quantidade máxima de caracteres por linha (0 = desabilitar).",
			"html.hover.documentation": "Mostrar a marca e a documentação de atributo durante a focalização.",
			"html.hover.references": "Mostrar as referências ao MDN durante a focalização.",
			"html.mirrorCursorOnMatchingTag": "Habilitar/desabilitar cursor de espelhamento na marca HTML correspondente.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Preterido e substituído por `editor.linkedEditing`",
			"html.suggest.html5.desc": "Controla se o suporte à linguagem HTML interna sugere marcas, propriedades e valores do HTML5.",
			"html.trace.server.desc": "Rastreia a comunicação entre o VS Code e o servidor de linguagem HTML.",
			"html.validate.scripts": "Controla se o suporte à linguagem HTML interna valida scripts incorporados.",
			"html.validate.styles": "Controla se o suporte à linguagem HTML interna valida estilos incorporados."
		}
	}
}