{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref « {0} » dans « {1} » ne peut pas être résolu.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Valeur par défaut. Utilisée par les suggestions.",
			"A descriptive title of the schema.": "Titre descriptif de schéma.",
			"A long description of the schema. Used in hover menus and suggestions.": "Description longue du schéma. Utilisé dans les menus sensitif et les suggestions.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Mappage des noms de propriétés à un tableau de noms de propriétés ou à un schéma. Un tableau de noms de propriétés signifie que la propriété nommée dans la clé dépend des propriétés du tableau présent dans l’objet pour être valide. Si la valeur est un schéma, le schéma n’est appliqué à l’objet que si la propriété de la clé existe sur l’objet.",
			"A map of property names to schemas for each property.": "Mappage des noms de propriétés aux schémas de chaque propriété.",
			"A map of regular expressions on property names to schemas for matching properties.": "Mappage d’expressions régulières sur des noms de propriétés vers des schémas pour les propriétés correspondantes.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Nombre qui doit diviser correctement la valeur actuelle (à savoir aucun reste à l’issue de l’opération).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Expression régulière à mettre en correspondance avec la chaîne. Elle n’est pas implicitement ancrée.",
			"A schema which must not match.": "Schéma qui ne doit pas correspondre.",
			"A unique identifier for the schema.": "Identificateur unique du schéma.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Une instance de tableau est valide par rapport à « contains » si au moins un de ses éléments est valide par rapport au schéma donné.",
			"An array of schemas, all of which must match.": "Tableau de schémas, qui doivent tous correspondre.",
			"An array of schemas, exactly one of which must match.": "Tableau de schémas, dont l’un doit correspondre exactement.",
			"An array of schemas, where at least one must match.": "Tableau de schémas, où au moins un doit correspondre.",
			"An array of strings that lists the names of all properties required on this object.": "Tableau de chaînes qui répertorie les noms de toutes les propriétés requises sur cet objet.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Une instance est validée avec succès par rapport à ce mot clé si sa valeur est égale à la valeur du mot clé.",
			"Array does not contain required item.": "Le tableau ne contient pas l’élément requis.",
			"Array has duplicate items.": "Le tableau contient des éléments dupliqués.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "Le tableau contient trop peu d’éléments qui correspondent à la contrainte contains. Le système attendait {0} ou plus.",
			"Array has too few items. Expected {0} or more.": "Le tableau comporte trop peu d’éléments. {0} ou plus attendus.",
			"Array has too many items according to schema. Expected {0} or fewer.": "Le tableau contient trop d’éléments selon le schéma. Le système attendait {0} ou moins.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "Le tableau contient trop d’éléments qui correspondent à la contrainte contains. Le système attendait {0} ou moins.",
			"Array has too many items. Expected {0} or fewer.": "Le tableau contient trop d’éléments. Le système attendait {0} ou moins.",
			"Colon expected": "Deux-points attendu",
			"Comments are not permitted in JSON.": "Les commentaires ne sont pas autorisés au format JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Commentaires des auteurs de schéma aux lecteurs ou aux chargés de maintenance du schéma.",
			"Configure": "Configurer",
			"Configured by extension: {0}": "Configuré par l’extension : {0}",
			"Configured in user settings": "Configuré dans les paramètres utilisateur",
			"Configured in workspace settings": "Configuré dans les paramètres de l’espace de travail",
			"Default value": "Valeur par défaut",
			"Describes the content encoding of a string property.": "Décrit l’encodage de contenu d’une propriété de chaîne.",
			"Describes the format expected for the value. By default, not used for validation": "Décrit le format attendu pour la valeur. Par défaut, non utilisé pour la validation",
			"Describes the media type of a string property.": "Décrit le type de média d’une propriété de chaîne.",
			"Downloading schemas is disabled through setting '{0}'": "Le téléchargement des schémas est désactivé via le paramètre '{0}'",
			"Downloading schemas is disabled. Click to configure.": "Le téléchargement des schémas est désactivé. Cliquez pour configurer.",
			"Draft-03 schemas are not supported.": "Les schémas Draft-03 ne sont pas pris en charge.",
			"Duplicate anchor declaration: '{0}'": "Déclaration d’ancre dupliquée : « {0} »",
			"Duplicate object key": "Clé d’objet en double",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Schéma ou booléen. S'il s'agit d'un schéma, utilisé pour valider toutes les propriétés qui ne correspondent pas à « properties », « propertyNames » ou « patternProperties ». Si la valeur est false, toutes les propriétés non définies par les mots clés ada adjacents entraînent l’échec de ce schéma.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Chaîne de l’un des types de schéma de base (nombre, entier, caractère Null, tableau, objet, booléen, chaîne) ou tableau de chaînes spécifiant un sous-ensemble de ces types.",
			"End of file expected.": "Fin de fichier attendue.",
			"Expected a JSON object, array or literal.": "Objet, tableau ou littéral JSON attendu.",
			"Expected comma": "Virgule attendue",
			"Expected comma or closing brace": "Virgule ou accolade fermante attendue",
			"Expected comma or closing bracket": "Virgule ou crochet fermant attendu",
			"Failed to sort the JSONC document, please consider opening an issue.": "Échec du tri du document JSONC. Envisagez d’ouvrir un problème.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Pour les tableaux, uniquement quand les éléments sont définis sous forme de tableau. Si les éléments sont un schéma, ce schéma valide les éléments après ceux spécifiés par le schéma des éléments. Si la valeur est fausse, les éléments supplémentaires entraînent l’échec de la validation.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Pour les tableaux. Peut être un schéma par rapport auquel valider chaque élément ou un tableau de schémas par rapport auquel valider chaque élément dans l’ordre (le premier schéma valide le premier élément, le second schéma valide le deuxième élément, et ainsi de suite).",
			"If all of the items in the array must be unique. Defaults to false.": "Indique si tous les éléments du tableau doivent être uniques. La valeur par défaut est false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Si l’instance est un objet, ce mot clé vérifie si chaque nom de propriété de l’instance est validé par rapport au schéma fourni.",
			"Incorrect type. Expected \"{0}\".": "Type incorrect. « {0} » attendu.",
			"Incorrect type. Expected one of {0}.": "Type incorrect. L’un des {0} attendus.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Indique que la valeur de l’instance est gérée exclusivement par l’autorité propriétaire.",
			"Invalid characters in string. Control characters must be escaped.": "Caractères non valides dans la chaîne. Les caractères de contrôle doivent être placés dans une séquence d’échappement.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Format de couleur non valide. Utilisez #RGB, #RGBA, #RRGGBB ou #RRGGBBAA.",
			"Invalid escape character in string.": "Caractère d’échappement non valide dans la chaîne.",
			"Invalid number format.": "Format de nombre non valide.",
			"Invalid unicode sequence in string.": "Séquence Unicode non valide dans la chaîne.",
			"Item does not match any validation rule from the array.": "L’élément ne correspond à aucune règle de validation du tableau.",
			"JSON Language Server": "Serveur de langage JSON",
			"JSON Outline Status": "État du plan JSON",
			"JSON Validation Status": "Statut de validation JSON",
			"JSON schema cache cleared.": "Cache de schéma JSON effacé.",
			"JSON schema configured": "Schéma JSON configuré",
			"JSON: Schema Resolution Error": "JSON : erreur de résolution de schéma",
			"Learn more about JSON schema configuration...": "En savoir plus sur la configuration du schéma JSON...",
			"Loading JSON info": "Chargement des informations JSON",
			"Makes the maximum property exclusive.": "Rend la propriété maximale exclusive.",
			"Makes the minimum property exclusive.": "Rend la propriété minimale exclusive.",
			"Matches a schema that is not allowed.": "Correspond à un schéma qui n’est pas autorisé.",
			"Matches multiple schemas when only one must validate.": "Correspond à plusieurs schémas quand un seul doit être validé.",
			"Missing property \"{0}\".": "Propriété manquante : « {0} »",
			"New array": "Nouveau tableau",
			"New object": "Nouvel objet",
			"No schema configured for this file": "Aucun schéma configuré pour ce fichier",
			"No schema validation": "Aucune validation de schéma",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Non utilisé pour la validation. Placez ici les sous-schémas que vous souhaitez référencer inline avec $ref.",
			"Object has fewer properties than the required number of {0}": "L’objet a moins de propriétés que le nombre requis de {0}",
			"Object has more properties than limit of {0}.": "L’objet a un nombre de propriétés supérieur à la limite de {0}.",
			"Object is missing property {0} required by property {1}.": "L’objet n’a pas la propriété {0} requise par la propriété {1}.",
			"Open Extension": "Ouvrir l'extension",
			"Open Settings": "Ouvrir les paramètres",
			"Outline": "Structure",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Nous n’avons pas pu lire le contenu depuis « {0} », car UTF-8 a été détecté avec une marque d’ordre d’octet, alors que seul UTF-8 est autorisé.",
			"Problems loading reference '{0}': {1}": "Nous n’avons pas pu charger la référence « {0} », car nous avons rencontré des problèmes : {1}",
			"Property expected": "Propriété attendue",
			"Property keys must be doublequoted": "Les clés de propriété doivent être entre guillemets doubles",
			"Property {0} is not allowed.": "La propriété {0} n’est pas autorisée.",
			"Reference a definition hosted on any location.": "Référencez une définition hébergée à n’importe quel emplacement.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Exemples de valeurs JSON associées à un schéma particulier, dans le but d’illustrer l’utilisation.",
			"Schema not found: {0}": "Schéma introuvable : {0}",
			"Schema validated": "Schéma validé",
			"Select the schema to use for {0}": "Sélectionner le schéma à utiliser pour {0}",
			"Show Schemas": "Afficher les schémas",
			"Sort JSON": "Trier JSON",
			"String does not match the pattern of \"{0}\".": "La valeur {0} ne correspond pas au modèle « {0} ».",
			"String is longer than the maximum length of {0}.": "La chaîne dépasse la longueur maximale de {0}.",
			"String is not a RFC3339 date-time.": "La chaîne n’est pas un horodatage RFC3339.",
			"String is not a RFC3339 date.": "La chaîne n’est pas une date RFC3339.",
			"String is not a RFC3339 time.": "La chaîne n’est pas une heure RFC3339.",
			"String is not a URI: {0}": "La chaîne n’est pas un URI : {0}",
			"String is not a hostname.": "La chaîne n’est pas un nom d’hôte.",
			"String is not an IPv4 address.": "La chaîne n’est pas une adresse IPv4.",
			"String is not an IPv6 address.": "La chaîne n’est pas une adresse IPv6.",
			"String is not an e-mail address.": "La chaîne n’est pas une adresse e-mail.",
			"String is shorter than the minimum length of {0}.": "La chaîne est plus courte que la longueur minimale de {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Le sous-schéma « else » est utilisé pour la validation en cas d’échec du sous-schéma « if ».",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "Le sous-schéma « then » est utilisé pour la validation quand le sous-schéma « if » réussit.",
			"The maximum length of a string.": "Longueur maximale d’une chaîne.",
			"The maximum number of items that can be inside an array. Inclusive.": "Nombre maximal d’éléments pouvant se trouver dans un tableau. Inclusif.",
			"The maximum number of properties an object can have. Inclusive.": "Nombre maximal de propriétés qu’un objet peut avoir. Inclusif.",
			"The maximum numerical value, inclusive by default.": "Valeur numérique maximale, incluse par défaut.",
			"The minimum length of a string.": "Longueur minimale d’une chaîne.",
			"The minimum number of items that can be inside an array. Inclusive.": "Nombre minimal d’éléments pouvant se trouver dans un tableau. Inclusif.",
			"The minimum number of properties an object can have. Inclusive.": "Nombre minimal de propriétés qu’un objet peut avoir. Inclusif.",
			"The minimum numerical value, inclusive by default.": "Valeur numérique minimale, inclusive par défaut.",
			"The schema to verify this document against.": "Schéma par rapport auquel vérifier ce document.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Le schéma utilise des fonctionnalités de méta-schéma ({0}) qui ne sont pas encore prises en charge par le validateur.",
			"The set of literal values that are valid.": "Ensemble de valeurs littérales valides.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Le résultat de validation du sous-schéma « if » contrôle lequel des mots clés « then » ou « else » est évalué.",
			"Trailing comma": "Virgule de fin",
			"URI expected.": "URI attendu.",
			"URI is expected.": "L'URI est attendu.",
			"URI with a scheme is expected.": "Un URI avec un schéma est attendu.",
			"Unable to compute used schemas: No document": "Impossible de calculer les schémas utilisés : aucun document",
			"Unable to compute used schemas: {0}": "Impossible de calculer les schémas utilisés : {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Nous n’avons pas pu charger le schéma depuis « {0} ». Aucun service de requête de schéma disponible",
			"Unable to load schema from '{0}': No content.": "Nous n’avons pas pu charger le schéma depuis « {0} », car aucun contenu n’était présent.",
			"Unable to load schema from '{0}': {1}.": "Nous n’avons pas pu charger le schéma depuis « {0} » : {1}.",
			"Unable to load {0}": "Impossible de charger {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Nous n’avons pas pu analyser le contenu depuis « {0} », car nous avons rencontré une erreur d’analyse au décalage {1}.",
			"Unable to resolve schema. Click to retry.": "Impossible de résoudre le schéma. Cliquez pour réessayer.",
			"Unexpected end of comment.": "Fin de commentaire inattendue.",
			"Unexpected end of number.": "Fin de nombre inattendue.",
			"Unexpected end of string.": "Fin de chaîne inattendue.",
			"Value expected": "Valeur attendue",
			"Value is above the exclusive maximum of {0}.": "La valeur est supérieure au maximum exclusif de {0}.",
			"Value is above the maximum of {0}.": "La valeur est supérieure au maximum de {0}.",
			"Value is below the exclusive minimum of {0}.": "La valeur est inférieure au minimum exclusif de {0}.",
			"Value is below the minimum of {0}.": "La valeur est inférieure au minimum de {0}.",
			"Value is deprecated": "La valeur est déconseillée",
			"Value is not accepted. Valid values: {0}.": "La valeur n’est pas acceptée. Valeurs valides : {0}.",
			"Value is not divisible by {0}.": "La valeur n’est pas divisible par {0}.",
			"Value must be {0}.": "La valeur doit être {0}.",
			"multiple JSON schemas configured": "plusieurs schémas JSON configurés",
			"no JSON schema configured": "aucun schéma JSON configuré",
			"only {0} document symbols shown for performance reasons": "seuls les symboles de document {0} sont affichés pour des raisons de performances",
			"{0} is a directory, not a file": "{0} est un répertoire, et non un fichier"
		},
		"package": {
			"description": "Fournit une prise en charge de langage pour les fichiers JSON",
			"displayName": "Fonctionnalités de langage JSON",
			"json.clickToRetry": "Cliquez pour réessayer.",
			"json.colorDecorators.enable.deprecationMessage": "Le paramètre 'json.colorDecorators.enable' a été déprécié en faveur de 'editor.colorDecorators'.",
			"json.colorDecorators.enable.desc": "Active ou désactive les éléments décoratifs de couleurs",
			"json.command.clearCache": "Effacer le cache de schéma",
			"json.command.sort": "Trier le document",
			"json.enableSchemaDownload.desc": "Quand ils sont activés, les schémas JSON peuvent être récupérés (fetch) à partir des emplacements http et https.",
			"json.format.enable.desc": "Activer/désactiver le formateur JSON par défaut",
			"json.format.keepLines.desc": "Conservez toutes les nouvelles lignes existantes lors de la mise en forme.",
			"json.maxItemsComputed.desc": "Nombre maximal de symboles de plan et de régions de pliage calculé (limité pour des raisons de performances).",
			"json.maxItemsExceededInformation.desc": "Affiche une notification en cas de dépassement du nombre maximal de symboles de plan et de zones de pliage.",
			"json.schemaResolutionErrorMessage": "Impossible de résoudre le schéma.",
			"json.schemas.desc": "Associe les schémas aux fichiers JSON dans le projet actif.",
			"json.schemas.fileMatch.desc": "Tableau de modèles de fichiers à mettre en correspondance lors de la résolution de fichiers JSON en schémas. « * » et « ** » peuvent être utilisés comme caractères génériques. Des modèles d’exclusion peuvent également être définis et commencer par « ! ». Un fichier correspond quand il existe au moins un modèle correspondant et que le dernier modèle correspondant n’est pas un modèle d’exclusion.",
			"json.schemas.fileMatch.item.desc": "Modèle de fichier pouvant contenir « * » et « ** » à mettre en correspondance lors de la résolution de fichiers JSON en schémas. Quand le modèle commence par « ! », il définit un modèle d’exclusion.",
			"json.schemas.schema.desc": "Définition de schéma pour l'URL indiquée. Le schéma doit être fourni uniquement pour éviter les accès à l'URL du schéma.",
			"json.schemas.url.desc": "Une URL ou un chemin de fichier absolu vers un schéma. Il peut s'agir d'un chemin relatif (commençant par « ./ ») dans les paramètres de l'espace de travail et du dossier de l'espace de travail.",
			"json.tracing.desc": "Trace la communication entre VS Code et le serveur de langage JSON.",
			"json.validate.enable.desc": "Activez/désactivez la validation JSON."
		}
	}
}