{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref '{0}' in '{1}' non può essere risolto.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Valore predefinito. Usato dai suggerimenti.",
			"A descriptive title of the schema.": "Titolo descrittivo dello schema.",
			"A long description of the schema. Used in hover menus and suggestions.": "Descrizione lunga dello schema. Usato nei menu e nei suggerimenti al passaggio del mouse.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Una mappa di nomi di proprietà per una matrice di nomi di proprietà o uno schema. Una matrice di nomi di proprietà indica che la proprietà denominata nella chiave dipende dalla presenza delle proprietà della matrice nell\\'oggetto per essere valida. Se il valore è uno schema, lo schema viene applicato all\\'oggetto solo se la proprietà nella chiave esiste nell\\'oggetto.",
			"A map of property names to schemas for each property.": "Una mappa dei nomi delle proprietà e degli schemi per ogni proprietà.",
			"A map of regular expressions on property names to schemas for matching properties.": "Una mappa di espressioni regolari sui nomi delle proprietà e sugli schemi per le proprietà corrispondenti.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Numero che deve dividere in modo pulito il valore corrente (ovvero non deve avere resto).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Espressione regolare rispetto a cui trovare la corrispondenza con la stringa. Non è ancorato in modo implicito.",
			"A schema which must not match.": "Schema che non deve corrispondere.",
			"A unique identifier for the schema.": "Identificatore univoco per lo schema.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Un'istanza di matrice è valida per \"contains\" se almeno uno dei relativi elementi è valido per lo schema specificato.",
			"An array of schemas, all of which must match.": "Matrice di schemi che devono essere tutti corrispondenti.",
			"An array of schemas, exactly one of which must match.": "Matrice di schemi, esattamente uno dei quali deve corrispondere.",
			"An array of schemas, where at least one must match.": "Matrice di schemi, in cui almeno uno deve corrispondere.",
			"An array of strings that lists the names of all properties required on this object.": "Matrice di stringhe che elenca i nomi di tutte le proprietà necessarie per questo oggetto.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Un\\'istanza viene convalidata con successo rispetto a questa parola chiave se il suo valore è uguale al valore della parola chiave.",
			"Array does not contain required item.": "La matrice non contiene l\\'elemento obbligatorio.",
			"Array has duplicate items.": "La matrice contiene elementi duplicati.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "La matrice contiene troppi elementi che corrispondono al limite contains. Previsti {0} o più.",
			"Array has too few items. Expected {0} or more.": "La matrice contiene troppo pochi elementi. Previsto {0} o più.",
			"Array has too many items according to schema. Expected {0} or fewer.": "La matrice contiene troppi elementi in base allo schema. Previsti {0} o meno.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "La matrice contiene troppi elementi che corrispondono al limite contains. Previsti {0} o meno.",
			"Array has too many items. Expected {0} or fewer.": "La matrice contiene troppi elementi. Previsti {0} o meno.",
			"Colon expected": "Sono previsti i due punti",
			"Comments are not permitted in JSON.": "I commenti non sono consentiti in JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Commenti dagli autori dello schema ai lettori o ai gestori dello schema.",
			"Configure": "Configurare",
			"Configured by extension: {0}": "Configurato dall'estensione: {0}",
			"Configured in user settings": "Configurato nelle impostazioni utente",
			"Configured in workspace settings": "Configurato nelle impostazioni dell'area di lavoro",
			"Default value": "Valore predefinito",
			"Describes the content encoding of a string property.": "Descrive la codifica dei contenuti di una proprietà stringa.",
			"Describes the format expected for the value. By default, not used for validation": "Descrive il formato previsto per il valore. Per impostazione predefinita, non usato per la convalida",
			"Describes the media type of a string property.": "Descrive il tipo di supporto di una proprietà stringa.",
			"Downloading schemas is disabled through setting '{0}'": "Il download degli schemi è disabilitato tramite l'impostazione '{0}'",
			"Downloading schemas is disabled. Click to configure.": "Il download degli schemi è disabilitato. Fare clic per configurare.",
			"Draft-03 schemas are not supported.": "Gli schemi Draft-03 non sono supportati.",
			"Duplicate anchor declaration: '{0}'": "Dichiarazione di ancoraggio duplicato: '{0}'",
			"Duplicate object key": "Chiave oggetto duplicata",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Schema o valore booleano. Se uno schema viene usato per convalidare tutte le proprietà non corrispondenti a 'properties', 'propertyNames', o 'patternProperties'. Se false, qualsiasi proprietà non definita dalle parole chiave adiacenti causerà l'esito negativo dello schema.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Stringa di uno dei tipi di schema di base (numero, numero intero, null, matrice, oggetto, valore booleano, stringa) o matrice di stringhe che specificano un subset di tali tipi.",
			"End of file expected.": "È previsto un carattere di fine file.",
			"Expected a JSON object, array or literal.": "È previsto un oggetto JSON, una matrice o un valore letterale.",
			"Expected comma": "Prevista virgola",
			"Expected comma or closing brace": "Prevista virgola o parentesi graffa di chiusura",
			"Expected comma or closing bracket": "Prevista una virgola o una parentesi quadra di chiusura",
			"Failed to sort the JSONC document, please consider opening an issue.": "Non è stato possibile ordinare il documento JSONC. Provare ad aprire un problema.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Per le matrici, solo quando gli elementi sono impostati come matrice. Se gli elementi sono uno schema, questo schema convalida gli elementi dopo quelli specificati dallo schema di elementi. Se false, gli elementi aggiuntivi causeranno l'esito negativo della convalida.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Per le matrici. Può essere uno schema rispetto a cui convalidare ogni elemento o una matrice di schemi rispetto a cui convalidare ogni elemento in ordine: il primo schema convaliderà il primo elemento, il secondo schema convaliderà il secondo elemento e così via.",
			"If all of the items in the array must be unique. Defaults to false.": "Se tutti gli elementi della matrice devono essere univoci. Il valore predefinito è false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Se l\\'istanza è un oggetto, questa parola chiave convalida se tutti i nomi delle proprietà dell\\'istanza sono validi rispetto allo schema specificato.",
			"Incorrect type. Expected \"{0}\".": "Tipo non corretto. Previsto \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Tipo non corretto. Previsto uno di {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Indica che il valore dell\\'istanza è gestito esclusivamente dall\\'autorità proprietaria.",
			"Invalid characters in string. Control characters must be escaped.": "Caratteri non validi nella stringa. I caratteri di controllo devono essere preceduti da un carattere di escape.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Formato colore non valido. Usare #RGB, #RGBA, #RRGGBB o #RRGGBBAA.",
			"Invalid escape character in string.": "Carattere di escape non valido nella stringa.",
			"Invalid number format.": "Formato numerico non valido.",
			"Invalid unicode sequence in string.": "Sequenza Unicode non valida nella stringa.",
			"Item does not match any validation rule from the array.": "L'elemento non corrisponde ad alcuna regola di convalida della matrice.",
			"JSON Language Server": "Server di linguaggio JSON",
			"JSON Outline Status": "Stato struttura JSON",
			"JSON Validation Status": "Stato di convalida JSON",
			"JSON schema cache cleared.": "Cache dello schema JSON cancellata.",
			"JSON schema configured": "Schema JSON configurato",
			"JSON: Schema Resolution Error": "JSON: Errore di risoluzione dello schema",
			"Learn more about JSON schema configuration...": "Altre informazioni sulla configurazione dello schema JSON...",
			"Loading JSON info": "Caricamento delle informazioni JSON in corso",
			"Makes the maximum property exclusive.": "Rende esclusiva la proprietà massima.",
			"Makes the minimum property exclusive.": "Rende esclusiva la proprietà minima.",
			"Matches a schema that is not allowed.": "Corrisponde a uno schema non consentito.",
			"Matches multiple schemas when only one must validate.": "Trova la corrispondenza con più schemi quando ne deve convalidare solo uno.",
			"Missing property \"{0}\".": "Proprietà \"{0}\" mancante.",
			"New array": "Nuova matrice",
			"New object": "Nuovo oggetto",
			"No schema configured for this file": "Nessuno schema configurato per questo file",
			"No schema validation": "Nessuna convalida dello schema",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Non utilizzato per la convalida. Inserire qui i sottoschema a cui si vuole fare riferimento inline con $ref.",
			"Object has fewer properties than the required number of {0}": "L'oggetto ha meno proprietà del numero richiesto di {0}",
			"Object has more properties than limit of {0}.": "L'oggetto ha più proprietà del limite di {0}.",
			"Object is missing property {0} required by property {1}.": "Nell'oggetto manca la proprietà {0} richiesta dalla proprietà {1}.",
			"Open Extension": "Apri estensione",
			"Open Settings": "Apri impostazioni",
			"Outline": "Struttura",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problema durante la lettura dei contenuti da '{0}': UTF-8 con BOM rilevato. È consentito solo UTF 8.",
			"Problems loading reference '{0}': {1}": "Problemi durante il caricamento del riferimento '{0}': {1}",
			"Property expected": "Proprietà prevista",
			"Property keys must be doublequoted": "Le chiavi di proprietà devono essere racchiuse da virgolette doppie",
			"Property {0} is not allowed.": "La proprietà {0} non è consentita.",
			"Reference a definition hosted on any location.": "Fare riferimento a una definizione ospitata in qualsiasi posizione.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Valori JSON di esempio associati a uno schema specifico, allo scopo di illustrare l'utilizzo.",
			"Schema not found: {0}": "Schema non trovato: {0}",
			"Schema validated": "Schema convalidato",
			"Select the schema to use for {0}": "Selezionare lo schema da usare per {0}",
			"Show Schemas": "Mostrare schemi",
			"Sort JSON": "Ordina JSON",
			"String does not match the pattern of \"{0}\".": "La stringa non corrisponde al modello di \"{0}\".",
			"String is longer than the maximum length of {0}.": "La stringa è più lunga della lunghezza massima di {0}.",
			"String is not a RFC3339 date-time.": "La stringa non è una RFC3339 date-time.",
			"String is not a RFC3339 date.": "La stringa non è una RFC3339 date.",
			"String is not a RFC3339 time.": "La stringa non è una RFC3339 time.",
			"String is not a URI: {0}": "La stringa non è un URI: {0}",
			"String is not a hostname.": "La stringa non è un nome host.",
			"String is not an IPv4 address.": "La stringa non è un indirizzo IPv4.",
			"String is not an IPv6 address.": "La stringa non è un indirizzo IPv6.",
			"String is not an e-mail address.": "La stringa non è un indirizzo di posta elettronica.",
			"String is shorter than the minimum length of {0}.": "La stringa è inferiore alla lunghezza minima di {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "\\\"else\\\" subschema viene usato per la convalida quando \\\"if\\\" subschema non riuscito.",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "Il sottoschema \"then\" viene utilizzato per la convalida quando il sottoschema \"if\" ha esito positivo.",
			"The maximum length of a string.": "Lunghezza massima di una stringa.",
			"The maximum number of items that can be inside an array. Inclusive.": "Numero massimo di elementi che possono essere all'interno di una matrice. Incluso.",
			"The maximum number of properties an object can have. Inclusive.": "Numero massimo di proprietà che un oggetto può avere. All inclusive.",
			"The maximum numerical value, inclusive by default.": "Valore numerico massimo, inclusivo per impostazione predefinita.",
			"The minimum length of a string.": "Lunghezza minima di una stringa.",
			"The minimum number of items that can be inside an array. Inclusive.": "Numero minimo di elementi che possono essere all'interno di una matrice. Incluso.",
			"The minimum number of properties an object can have. Inclusive.": "Numero minimo di proprietà che un oggetto può avere. Incluso.",
			"The minimum numerical value, inclusive by default.": "Valore numerico minimo, incluso per impostazione predefinita.",
			"The schema to verify this document against.": "Schema su cui verificare il documento.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Lo schema usa funzionalità meta-schema ({0}) che non sono ancora supportate dal validator.",
			"The set of literal values that are valid.": "Set di valori letterali validi.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Il risultato della convalida del sottoschema \"if\" controlla quali parole chiave \"then\" o \"else\" vengono valutate.",
			"Trailing comma": "Virgola finale",
			"URI expected.": "È previsto un URI.",
			"URI is expected.": "È previsto un URI.",
			"URI with a scheme is expected.": "È previsto un URI con schema.",
			"Unable to compute used schemas: No document": "Impossibile calcolare gli schemi usati: nessun documento",
			"Unable to compute used schemas: {0}": "Non è possibile calcolare gli schemi usati: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Non è possibile caricare lo schema da \\'{0}\\'. Nessun servizio di richiesta dello schema disponibile",
			"Unable to load schema from '{0}': No content.": "Non è possibile caricare lo schema da '{0}': nessun contenuto.",
			"Unable to load schema from '{0}': {1}.": "Non è possibile caricare lo schema da '{0}': {1}.",
			"Unable to load {0}": "Impossibile caricare {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Non è possibile analizzare il contenuto da '{0}': errore di analisi in corrispondenza dell'offset {1}.",
			"Unable to resolve schema. Click to retry.": "Non è possibile risolvere lo schema. Fare clic per riprovare.",
			"Unexpected end of comment.": "Fine del commento imprevista.",
			"Unexpected end of number.": "Fine del numero imprevista.",
			"Unexpected end of string.": "Fine della stringa imprevista.",
			"Value expected": "È previsto un valore",
			"Value is above the exclusive maximum of {0}.": "Il valore è superiore al massimo esclusivo di {0}.",
			"Value is above the maximum of {0}.": "Il valore è superiore al valore massimo di {0}.",
			"Value is below the exclusive minimum of {0}.": "Il valore è inferiore al minimo esclusivo di {0}.",
			"Value is below the minimum of {0}.": "Il valore è inferiore al valore minimo di {0}.",
			"Value is deprecated": "Il valore è deprecato",
			"Value is not accepted. Valid values: {0}.": "Valore non accettato. Valori validi: {0}.",
			"Value is not divisible by {0}.": "Il valore non è divisibile per {0}.",
			"Value must be {0}.": "Il valore deve essere {0}.",
			"multiple JSON schemas configured": "più schemi JSON configurati",
			"no JSON schema configured": "nessuno schema JSON configurato",
			"only {0} document symbols shown for performance reasons": "solo {0} simboli del documento visualizzati per motivi di prestazioni",
			"{0} is a directory, not a file": "{0} è una directory, non un file"
		},
		"package": {
			"description": "Fornisce supporto avanzato del linguaggio per i file JSON.",
			"displayName": "Funzionalità del linguaggio JSON",
			"json.clickToRetry": "Fare clic per riprovare.",
			"json.colorDecorators.enable.deprecationMessage": "L'impostazione `json.colorDecorators.enable` è stata deprecata e sostituita da `editor.colorDecorators`.",
			"json.colorDecorators.enable.desc": "Abilita o disabilita gli elementi Decorator di tipo colore",
			"json.command.clearCache": "Cancella cache dello schema",
			"json.command.sort": "Ordina documento",
			"json.enableSchemaDownload.desc": "Se è abilitata, è possibile recuperare gli schemi JSON da posizioni HTTP e HTTPS.",
			"json.format.enable.desc": "Abilita/Disabilita il formattatore JSON predefinito",
			"json.format.keepLines.desc": "Mantenere tutte le nuove righe esistenti durante la formattazione.",
			"json.maxItemsComputed.desc": "Numero massimo di simboli di struttura e aree di riduzione calcolati (limitato per motivi di prestazioni).",
			"json.maxItemsExceededInformation.desc": "Mostra la notifica quando viene superato il numero massimo di simboli di struttura e di aree di riduzione del codice.",
			"json.schemaResolutionErrorMessage": "Non è possibile risolvere lo schema.",
			"json.schemas.desc": "Associa schemi a file JSON nel progetto corrente.",
			"json.schemas.fileMatch.desc": "Matrice di modelli di file da confrontare durante la risoluzione di file JSON in schemi. '*' e '**' possono essere usati come carattere jolly. I modelli di esclusione possono anche essere definiti e iniziare con '!'. Un file corrisponde quando è presente almeno un criterio di corrispondenza e l'ultimo criterio di corrispondenza non è un criterio di esclusione.",
			"json.schemas.fileMatch.item.desc": "Modello di file che può contenere '*' e '**' per la corrispondenza durante la risoluzione di file JSON in schemi. Quando inizia con '!', definisce un modello di esclusione.",
			"json.schemas.schema.desc": "Definizione dello schema per l'URL specificato. È necessario specificare lo schema per evitare accessi all'URL dello schema.",
			"json.schemas.url.desc": "URL o percorso di file assoluto di uno schema. Può essere un percorso relativo (che comincia con './') nelle impostazioni dell'area di lavoro e della cartella dell'area di lavoro.",
			"json.tracing.desc": "Traccia le comunicazioni tra Visual Studio Code e il server di linguaggio JSON.",
			"json.validate.enable.desc": "Abilita/disabilita la convalida JSON."
		}
	}
}