{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref „{0}“ in „{1}“ kann nicht aufgelöst werden.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Ein Standardwert. Wird von Vorschlägen verwendet.",
			"A descriptive title of the schema.": "Ein beschreibender Titel des Schemas.",
			"A long description of the schema. Used in hover menus and suggestions.": "Eine lange Beschreibung des Schemas. Wird in Daraufzeigemenüs und Vorschlägen verwendet.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Eine Zuordnung von Eigenschaftsnamen zu entweder einem Array von Eigenschaftsnamen oder einem Schema. Ein Array von Eigenschaftsnamen bedeutet, dass die im Schlüssel genannte Eigenschaft davon abhängt, dass die Eigenschaften im Array im Objekt vorhanden sind, um gültig zu sein. Wenn der Wert ein Schema ist, wird das Schema nur dann auf das Objekt angewendet, wenn die Eigenschaft im Schlüssel im Objekt vorhanden ist.",
			"A map of property names to schemas for each property.": "Eine Zuordnung von Eigenschaftennamen zu Schemas für jede Eigenschaft.",
			"A map of regular expressions on property names to schemas for matching properties.": "Eine Zuordnung von regulären Ausdrücken für Eigenschaftsnamen zu Schemata für passende Eigenschaften.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Eine Zahl, die den aktuellen Wert sauber dividieren soll (d. h. keinen Rest haben).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Ein regulärer Ausdruck, mit dem die Zeichenfolge verglichen werden soll. Sie ist nicht implizit verankert.",
			"A schema which must not match.": "Ein Schema, das nicht übereinstimmen darf.",
			"A unique identifier for the schema.": "Ein eindeutiger Bezeichner für das Schema.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Eine Arrayinstanz ist für „contains“ gültig, wenn mindestens eines ihrer Elemente für das angegebene Schema gültig ist.",
			"An array of schemas, all of which must match.": "Ein Array von Schemas, die alle übereinstimmen müssen.",
			"An array of schemas, exactly one of which must match.": "Ein Array von Schemas, von denen genau eines übereinstimmen muss.",
			"An array of schemas, where at least one must match.": "Ein Array von Schemas, wobei mindestens ein Schema übereinstimmen muss.",
			"An array of strings that lists the names of all properties required on this object.": "Ein Array von Zeichenfolgen, das die Namen aller Eigenschaften auflistet, die für dieses Objekt erforderlich sind.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Eine Instanz überprüft dieses Schlüsselwort erfolgreich, wenn ihr Wert mit dem Wert des Schlüsselworts übereinstimmt.",
			"Array does not contain required item.": "Das Array enthält kein erforderliches Element.",
			"Array has duplicate items.": "Das Array weist doppelte Elemente auf.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "Array hat zu wenige Elemente, die der „contains“-Beschränkung entsprechen. Es wurde {0} oder mehr erwartet.",
			"Array has too few items. Expected {0} or more.": "Das Array enthält zu wenige Elemente. Es wurde {0} oder mehr erwartet.",
			"Array has too many items according to schema. Expected {0} or fewer.": "Das Array weist gemäß Schema zu viele Elemente auf. Es wurde {0} oder weniger erwartet.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "Array hat zu viele Elemente, die der „contains“-Beschränkung entsprechen. Es wurde {0} oder weniger erwartet.",
			"Array has too many items. Expected {0} or fewer.": "Das Array enthält zu viele Elemente. Es wurde {0} oder weniger erwartet.",
			"Colon expected": "Ein Doppelpunkt wurde erwartet.",
			"Comments are not permitted in JSON.": "Kommentare sind in JSON nicht zulässig.",
			"Comments from schema authors to readers or maintainers of the schema.": "Kommentare von Schema-Autoren an Leser oder Pfleger des Schemas.",
			"Configure": "Konfigurieren",
			"Configured by extension: {0}": "Konfiguriert durch Erweiterung: {0}",
			"Configured in user settings": "In Benutzereinstellungen konfiguriert",
			"Configured in workspace settings": "In Arbeitsbereichseinstellungen konfiguriert",
			"Default value": "Standardwert",
			"Describes the content encoding of a string property.": "Beschreibt die Inhaltscodierung einer Zeichenfolgeneigenschaft.",
			"Describes the format expected for the value. By default, not used for validation": "Beschreibt das für den Wert erwartete Format. Wird standardmäßig nicht zur Überprüfung verwendet",
			"Describes the media type of a string property.": "Beschreibt den Medientyp einer Zeichenfolgeneigenschaft.",
			"Downloading schemas is disabled through setting '{0}'": "Das Herunterladen von Schemas wird über die Einstellung \"{0}\" deaktiviert.",
			"Downloading schemas is disabled. Click to configure.": "Das Herunterladen von Schemas ist deaktiviert. Klicken Sie, um eine Konfiguration durchzuführen.",
			"Draft-03 schemas are not supported.": "Draft-03-Schemas werden nicht unterstützt.",
			"Duplicate anchor declaration: '{0}'": "Doppelte Ankerdeklaration: „{0}“",
			"Duplicate object key": "Doppelter Objektschlüssel",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Entweder ein Schema oder ein boolescher Wert. Wenn es sich um ein Schema handelt, werden alle Eigenschaften überprüft, die nicht mit „properties“, „propertyNames“ oder „patternProperties“ übereinstimmen. Wenn dies nicht der Fall ist, führen alle Eigenschaften, die nicht durch die angrenzenden Schlüsselwörter definiert sind, zum Scheitern dieses Schemas.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Entweder eine Zeichenfolge eines der grundlegenden Schematypen (Zahl, Ganzzahl, Null, Array, Objekt, Boolescher Wert, Zeichenfolge) oder eine Reihe von Zeichenfolgen, die eine Untermenge dieser Typen angeben.",
			"End of file expected.": "Ende der Datei erwartet.",
			"Expected a JSON object, array or literal.": "Es wurde ein JSON-Objekt, ein Array oder ein Literal erwartet.",
			"Expected comma": "Komma erwartet",
			"Expected comma or closing brace": "Komma oder schließende geschweifte Klammer erwartet",
			"Expected comma or closing bracket": "Komma oder schließende Klammer erwartet",
			"Failed to sort the JSONC document, please consider opening an issue.": "Fehler beim Sortieren des JSONC-Dokuments. Erwägen Sie, ein Problem zu öffnen.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Für Arrays, nur wenn Elemente als Array festgelegt sind. Wenn Elemente ein Schema sind, validiert dieses Schema Elemente nach den im Elementschema angegebenen Elementen. Wenn dies nicht der Fall ist, führen zusätzliche Elemente zu einer fehlgeschlagenen Validierung.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Für Arrays. Kann entweder ein Schema sein, gegen das jedes Element validiert wird, oder ein Array von Schemata, gegen die jedes Element der Reihe nach validiert wird (das erste Schema validiert das erste Element, das zweite Schema validiert das zweite Element usw.).",
			"If all of the items in the array must be unique. Defaults to false.": "Wenn alle Elemente im Array eindeutig sein müssen. Der Standardwert ist „FALSE“.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Wenn es sich bei der Instanz um ein Objekt handelt, prüft dieses Schlüsselwort, ob jeder Eigenschaftsname in der Instanz anhand des angegebenen Schemas validiert wird.",
			"Incorrect type. Expected \"{0}\".": "Falscher Typ. „{0}“ erwartet.",
			"Incorrect type. Expected one of {0}.": "Falscher Typ. Es wurde einer von {0} erwartet.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Gibt an, dass der Wert der Instanz ausschließlich von der besitzenden Autorität verwaltet wird.",
			"Invalid characters in string. Control characters must be escaped.": "Ungültige Zeichen in der Zeichenfolge. Steuerzeichen müssen mit Escapezeichen versehen werden.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Ungültiges Farbformat. Verwenden Sie #RGB, #RGBA, #RRGGBB oder #RRGGBBAA.",
			"Invalid escape character in string.": "Ungültiges Escapezeichen in Zeichenfolge.",
			"Invalid number format.": "Ungültiges Zahlenformat.",
			"Invalid unicode sequence in string.": "Ungültige Unicode-Sequenz in Zeichenfolge.",
			"Item does not match any validation rule from the array.": "Das Element stimmt mit keiner Validierungsregel aus dem Array überein.",
			"JSON Language Server": "JSON-Sprachserver",
			"JSON Outline Status": "JSON-Gliederungsstatus",
			"JSON Validation Status": "JSON-Validierungsstatus",
			"JSON schema cache cleared.": "Der JSON-Schemacache wurde gelöscht.",
			"JSON schema configured": "JSON-Schema konfiguriert",
			"JSON: Schema Resolution Error": "JSON: Schemaauflösungsfehler",
			"Learn more about JSON schema configuration...": "Weitere Informationen zur JSON-Schemakonfiguration...",
			"Loading JSON info": "JSON-Informationen werden geladen.",
			"Makes the maximum property exclusive.": "Macht die maximale Eigenschaft exklusiv.",
			"Makes the minimum property exclusive.": "Macht die minimale Eigenschaft exklusiv.",
			"Matches a schema that is not allowed.": "Entspricht einem unzulässigen Schema.",
			"Matches multiple schemas when only one must validate.": "Gleicht mehrere Schemas ab, wenn nur ein Schema überprüft werden muss.",
			"Missing property \"{0}\".": "Fehlende Eigenschaft: „{0}“.",
			"New array": "Neues Array",
			"New object": "Neues Objekt",
			"No schema configured for this file": "Für diese Datei ist kein Schema konfiguriert",
			"No schema validation": "Keine Schemaüberprüfung",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Wird nicht für die Überprüfung verwendet. Platzieren Sie hier Unterschemas, auf die Sie inline mit $ref verweisen möchten.",
			"Object has fewer properties than the required number of {0}": "Das Objekt hat weniger Eigenschaften als die erforderliche Anzahl von {0}",
			"Object has more properties than limit of {0}.": "Das Objekt hat mehr Eigenschaften als das Limit von {0}.",
			"Object is missing property {0} required by property {1}.": "Dem Objekt fehlt die Eigenschaft {0}, die für die Eigenschaft {1} erforderlich ist.",
			"Open Extension": "Erweiterung öffnen",
			"Open Settings": "Einstellungen öffnen",
			"Outline": "Gliederung",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problem beim Lesen von Inhalt aus „{0}“: UTF-8 mit BOM erkannt, nur UTF 8 ist zulässig.",
			"Problems loading reference '{0}': {1}": "Probleme beim Laden des Verweises „{0}“: {1}",
			"Property expected": "Eigenschaft erwartet",
			"Property keys must be doublequoted": "Eigenschaftsschlüssel müssen mit doppelter Anführungszeichen angegeben werden.",
			"Property {0} is not allowed.": "Eigenschaft {0} ist nicht zulässig.",
			"Reference a definition hosted on any location.": "Verweisen Sie auf eine Definition, die an einem beliebigen Speicherort gehostet wird.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Json-Beispielwerte, die einem bestimmten Schema zugeordnet sind, zur Veranschaulichung der Verwendung.",
			"Schema not found: {0}": "Schema nicht gefunden: {0}",
			"Schema validated": "Schema überprüft",
			"Select the schema to use for {0}": "Wählen Sie das Schema aus, das für {0} verwendet werden soll",
			"Show Schemas": "Schemata anzeigen",
			"Sort JSON": "JSON sortieren",
			"String does not match the pattern of \"{0}\".": "Die Zeichenfolge entspricht nicht dem Muster von „{0}“.",
			"String is longer than the maximum length of {0}.": "Die Zeichenfolge ist länger als die maximale Länge von {0}.",
			"String is not a RFC3339 date-time.": "Die Zeichenfolge ist kein RFC3339-Datums-/Uhrzeitwert.",
			"String is not a RFC3339 date.": "Die Zeichenfolge ist kein RFC3339-Datum.",
			"String is not a RFC3339 time.": "Die Zeichenfolge ist keine RFC3339-Zeit.",
			"String is not a URI: {0}": "Die Zeichenfolge ist kein URI: {0}",
			"String is not a hostname.": "Die Zeichenfolge ist kein Hostname.",
			"String is not an IPv4 address.": "Die Zeichenfolge ist keine IPv4-Adresse.",
			"String is not an IPv6 address.": "Die Zeichenfolge ist keine IPv6-Adresse.",
			"String is not an e-mail address.": "Die Zeichenfolge ist keine E-Mail-Adresse.",
			"String is shorter than the minimum length of {0}.": "Die Zeichenfolge ist kürzer als die Mindestlänge von {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Das Unterschema „else“ wird für die Überprüfung verwendet, wenn das Unterschema „if“ fehlschlägt.",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "Das Unterschema „then“ wird für die Überprüfung verwendet, wenn das Unterschema „if“ erfolgreich ist.",
			"The maximum length of a string.": "Die maximale Länge einer Zeichenfolge.",
			"The maximum number of items that can be inside an array. Inclusive.": "Die maximale Anzahl von Elementen, die sich innerhalb eines Arrays befinden können. Inklusive.",
			"The maximum number of properties an object can have. Inclusive.": "Die maximale Anzahl von Eigenschaften, die ein Objekt aufweisen kann. Inklusive.",
			"The maximum numerical value, inclusive by default.": "Der maximale numerische Wert, standardmäßig inklusive.",
			"The minimum length of a string.": "Die Mindestlänge einer Zeichenfolge.",
			"The minimum number of items that can be inside an array. Inclusive.": "Die Mindestanzahl von Elementen, die sich innerhalb eines Arrays befinden können. Inklusive.",
			"The minimum number of properties an object can have. Inclusive.": "Die Mindestanzahl von Eigenschaften, die ein Objekt aufweisen kann. Inklusive.",
			"The minimum numerical value, inclusive by default.": "Der numerische Mindestwert (standardmäßig einschließlich).",
			"The schema to verify this document against.": "Das Schema, mit dem dieses Dokument überprüft werden soll.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Das Schema verwendet Metaschemafunktionen ({0}), die noch nicht vom Validierungssteuerelement unterstützt werden.",
			"The set of literal values that are valid.": "Der Satz gültiger Literalwerte.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Das Validierungsergebnis des Unterschemas „if“ steuert, welches der Schlüsselwörter „then“ oder „else“ ausgewertet wird.",
			"Trailing comma": "Nachgestelltes Komma",
			"URI expected.": "URI erwartet.",
			"URI is expected.": "Es wird ein URI erwartet.",
			"URI with a scheme is expected.": "Ein URI mit einem Schema wird erwartet.",
			"Unable to compute used schemas: No document": "Die verwendeten Schemas können nicht berechnet werden: Kein Dokument",
			"Unable to compute used schemas: {0}": "Die verwendeten Schemas können nicht berechnet werden: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Das Schema kann nicht aus „{0}“ geladen werden. Kein Schemaanforderungsdienst verfügbar",
			"Unable to load schema from '{0}': No content.": "Das Schema kann nicht aus „{0}“ geladen werden: Kein Inhalt.",
			"Unable to load schema from '{0}': {1}.": "Das Schema kann nicht aus „{0}“ geladen werden: {1}.",
			"Unable to load {0}": "\"{0}\" kann nicht geladen werden.",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Inhalt von „{0}“ kann nicht analysiert werden: Analysefehler bei Offset {1}.",
			"Unable to resolve schema. Click to retry.": "Das Schema kann nicht aufgelöst werden. Klicken Sie, um es noch mal zu versuchen.",
			"Unexpected end of comment.": "Unerwartetes Ende des Kommentars.",
			"Unexpected end of number.": "Unerwartetes Ende der Zahl.",
			"Unexpected end of string.": "Unerwartetes Ende der Zeichenfolge.",
			"Value expected": "Ein Wert wurde erwartet.",
			"Value is above the exclusive maximum of {0}.": "Der Wert liegt über dem exklusiven Maximum von {0}.",
			"Value is above the maximum of {0}.": "Der Wert liegt über dem Maximum von {0}.",
			"Value is below the exclusive minimum of {0}.": "Der Wert liegt unter dem exklusiven Minimum von {0}.",
			"Value is below the minimum of {0}.": "Der Wert liegt unter dem Minimum von {0}.",
			"Value is deprecated": "Der Wert ist veraltet.",
			"Value is not accepted. Valid values: {0}.": "Der Wert wird nicht akzeptiert. Gültige Werte: {0}.",
			"Value is not divisible by {0}.": "Der Wert ist durch {0} nicht teilbar.",
			"Value must be {0}.": "Wert muss {0} sein",
			"multiple JSON schemas configured": "Mehrere JSON-Schemas konfiguriert",
			"no JSON schema configured": "Kein JSON-Schema konfiguriert",
			"only {0} document symbols shown for performance reasons": "aus Leistungsgründen werden nur {0} Dokumentsymbole angezeigt",
			"{0} is a directory, not a file": "{0} ist ein Verzeichnis, keine Datei"
		},
		"package": {
			"description": "Bietet umfangreiche Sprachunterstützung für JSON-Dateien.",
			"displayName": "JSON-Sprachfeatures",
			"json.clickToRetry": "Klicken Sie, um es noch mal zu versuchen.",
			"json.colorDecorators.enable.deprecationMessage": "Die Einstellung \"json.colorDecorators.enable\" ist veraltet und wurde durch \"editor.colorDecorators\" ersetzt.",
			"json.colorDecorators.enable.desc": "Aktiviert oder deaktiviert Farb-Decorators",
			"json.command.clearCache": "Löschen des Schemacaches",
			"json.command.sort": "Dokument sortieren",
			"json.enableSchemaDownload.desc": "Sofern aktiviert, können JSON-Schemas aus HTTP- und HTTPS-Speicherorten abgerufen werden.",
			"json.format.enable.desc": "JSON-Standardformatierer aktivieren/deaktivieren",
			"json.format.keepLines.desc": "Behalten Sie bei der Formatierung alle vorhandenen neuen Zeilen bei.",
			"json.maxItemsComputed.desc": "Die maximale Anzahl der berechneten Umrisssymbole und Faltbereiche (aus Leistungsgründen begrenzt).",
			"json.maxItemsExceededInformation.desc": "Hiermit wird eine Benachrichtigung angezeigt, wenn die maximale Anzahl von Gliederungssymbolen und Faltregionen überschritten wird.",
			"json.schemaResolutionErrorMessage": "Das Schema kann nicht aufgelöst werden.",
			"json.schemas.desc": "Hiermit werden Schemas JSON-Dateien im aktuellen Projekt zugeordnet.",
			"json.schemas.fileMatch.desc": "Ein Array von Dateimustern für den Abgleich, wenn JSON-Dateien in Schemas aufgelöst werden. Die Zeichen \"*\" und \"**\" können als Platzhalter verwendet werden. Ausschlussmuster können ebenfalls definiert werden und beginnen mit \"!\". Eine Datei gilt als Übereinstimmung, wenn mindestens ein übereinstimmendes Muster vorhanden ist und das letzte übereinstimmende Muster kein Ausschlussmuster ist.",
			"json.schemas.fileMatch.item.desc": "Ein Dateimuster, das \"*\" und \"**\" enthalten kann, und das beim Auflösen von JSON-Dateien in Schemas zum Abgleich verwendet wird. Wenn es mit \"!\" beginnt, definiert es ein Ausschlussmuster.",
			"json.schemas.schema.desc": "Die Schemadefinition für die angegebene URL. Das Schema muss nur angegeben werden, um Zugriffe auf die Schema-URL zu vermeiden.",
			"json.schemas.url.desc": "Eine URL oder ein absoluter Dateipfad zu einem Schema. Kann ein relativer Pfad (beginnend mit \"./\") in den Arbeitsbereichs- und Arbeitsbereichsordnereinstellungen sein.",
			"json.tracing.desc": "Verfolgt die Kommunikation zwischen VS Code und JSON-Sprachserver nach.",
			"json.validate.enable.desc": "Aktiviert/deaktiviert die JSON-Überprüfung."
		}
	}
}