{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Exemple",
			"Files by Extension": "Fichiers par extension",
			"Files with Extension": "Fichiers avec extension",
			"Files with Multiple Extensions": "Fichiers avec plusieurs extensions",
			"Files with Path": "Fichiers avec chemin",
			"Files with Siblings by Name": "Fichiers avec frères par nom",
			"Folder by Name (Any Location)": "Dossier par nom (tous les emplacements)",
			"Folder by Name (Top Level)": "Dossier par nom (premier niveau)",
			"Folders with Multiple Names (Top Level)": "Dossiers avec plusieurs noms (premier niveau)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Mappez au langage ayant l'identificateur spécifié tous les fichiers dont le chemin correspond au modèle Glob de chemin absolu.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Mappez au langage ayant l'identificateur spécifié tous les fichiers dont le nom correspond au modèle Glob.",
			"Match a folder with a specific name in any location.": "Faites correspondre un dossier portant un nom spécifique, indépendamment de son emplacement.",
			"Match a top level folder with a specific name.": "Faites correspondre un dossier de premier niveau portant un nom spécifique.",
			"Match all files of a specific file extension.": "Faites correspondre tous les fichiers ayant une extension de fichier spécifique.",
			"Match all files with any of the file extensions.": "Faites correspondre tous les fichiers, indépendamment de leurs extensions.",
			"Match files that have siblings with the same name but a different extension.": "Faites correspondre les fichiers ayant des frères portant le même nom, mais avec une extension distincte.",
			"Match multiple top level folders.": "Faites correspondre plusieurs dossiers de premier niveau.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Caractère utilisé par le système d’exploitation pour séparer les composants dans les chemins d’accès aux fichiers. Est également défini sur l’alias « / ».",
			"The current opened file": "Fichier ouvert actif",
			"The current opened file relative to ${workspaceFolder}": "Fichier ouvert actif relatif à ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Le nom du dossier de l'espace de travail du fichier actuellement ouvert sans aucune barre oblique (/)",
			"The current opened file's basename": "Nom de base du fichier ouvert actif",
			"The current opened file's basename with no file extension": "Nom de base du fichier ouvert actif, sans extension de fichier",
			"The current opened file's dirname": "Nom de répertoire du fichier ouvert actif",
			"The current opened file's dirname relative to ${workspaceFolder}": "Valeur dirname du fichier actuellement ouvert, relative à ${workspaceFolder}",
			"The current opened file's extension": "Extension du fichier ouvert actif",
			"The current selected line number in the active file": "Numéro de la ligne sélectionnée dans le fichier actif",
			"The current selected text in the active file": "Texte sélectionné dans le fichier actif",
			"The file extension of the editor (e.g. txt)": "Extension de fichier de l’éditeur (par exemple, txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Nom de fichier de l’éditeur sans son répertoire ou extension (par exemple, myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Nom de la tâche de build par défaut. S'il y en a plusieurs, une recherche rapide s'affiche pour choisir la tâche de build.",
			"The name of the folder opened in VS Code without any slashes (/)": "Nom du dossier ouvert dans VS Code, sans barres obliques (/)",
			"The nth parent folder name of the editor": "Nom du nième dossier parent de l’éditeur",
			"The parent folder name of the editor (e.g. myFileFolder)": "Nom du dossier parent de l’éditeur (par exemple, myFileFolder)",
			"The path of the folder opened in VS Code": "Chemin du dossier ouvert dans VS Code",
			"The path where an extension is installed.": "Chemin d’accès où une extension est installée.",
			"The task runner's current working directory on startup": "Répertoire de travail actif de l'exécuteur de tâches au démarrage",
			"Use the language of the currently active text editor if any": "Utiliser le langage de l'éditeur de texte actuellement actif le cas échéant",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "séparateur conditionnel (' - ') qui s'affiche uniquement quand il est entouré de variables avec des valeurs",
			"an indicator for when the active editor has unsaved changes": "un indicateur pour quand l’éditeur actif a des modifications non enregistrées.",
			"e.g. SSH": "par ex., SSH",
			"e.g. VS Code": "exemple : VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "chemin d’accès de l’espace de travail (ex: /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "chemin d’accès du dossier de l'espace de travail auquel le fichier appartient (ex: /Users/Development/myFolder)",
			"gist": "Gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "nom du dossier de l'espace de travail auquel le fichier appartient (ex: monDossier)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "nom de l’espace de travail avec un nom distant facultatif et un indicateur d’espace de travail le cas échéant (par exemple, myFolder, myRemoteFolder [SSH] ou myWorkspace (espace de travail))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "nom raccourci de l’espace de travail sans suffixes (par exemple, myFolder ou myWorkspace)",
			"the file name (e.g. myFile.txt)": "le nom du fichier (ex: monfichier.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "chemin complet du fichier (par ex., /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "chemin complet du dossier contenant le fichier (par ex., /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "nom de la branche active dans le référentiel actif (par exemple, principal)",
			"the name of the active repository (e.g. vscode)": "nom du référentiel actif (par exemple, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "nom du dossier contenant le fichier (par ex., myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "chemin de fichier relatif au dossier de l'espace de travail (par ex., myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "chemin du dossier contenant le fichier, relatif au dossier de l'espace de travail (par ex., myFolder/myFileFolder)"
		},
		"package": {
			"description": "Fournit des fonctionnalités (IntelliSense avancé, correction automatique) dans les fichiers de configuration comme les fichiers de paramètres, de lancement et de recommandation d'extension.",
			"displayName": "Configuration de l'édition"
		}
	}
}