{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Emmet Abbreviation": "Zkratka Emmet",
			"Enter Abbreviation": "Zadejte zkratku.",
			"Invalid emmet.variables field. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Neplatné pole emmet.variables Platný příklad najdete na https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration.",
			"Invalid snippets file. See https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets for a valid example.": "Neplatný soubor fragmentů kódu. Platný příklad najdete na https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets.",
			"Invalid syntax profile. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Neplatný profil syntaxe. Platný příklad najdete na https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration."
		},
		"package": {
			"command.balanceIn": "Vyvážení (směrem dovnitř)",
			"command.balanceOut": "Vyvážení (směrem ven)",
			"command.decrementNumberByOne": "Snížit o 1",
			"command.decrementNumberByOneTenth": "Snížit o 0,1",
			"command.decrementNumberByTen": "Snížit o 10",
			"command.evaluateMathExpression": "Vyhodnotit matematický výraz",
			"command.incrementNumberByOne": "Zvýšit o 1",
			"command.incrementNumberByOneTenth": "Zvýšit o 0,1",
			"command.incrementNumberByTen": "Zvýšit o 10",
			"command.matchTag": "Přejít na odpovídající pár",
			"command.mergeLines": "Sloučit řádky",
			"command.nextEditPoint": "Přejít na další bod úprav",
			"command.prevEditPoint": "Přejít na předchozí bod úprav",
			"command.reflectCSSValue": "Rozkopírovat hodnotu CSS",
			"command.removeTag": "Odebrat značku",
			"command.selectNextItem": "Vybrat další položku",
			"command.selectPrevItem": "Vybrat předchozí položku",
			"command.showEmmetCommands": "Zobrazit příkazy Emmet",
			"command.splitJoinTag": "Značka rozdělení/spojení",
			"command.toggleComment": "Přepnout komentář",
			"command.updateImageSize": "Aktualizovat velikost obrázku",
			"command.updateTag": "Aktualizovat značku",
			"command.wrapWithAbbreviation": "Zabalit pomocí zkratky",
			"description": "Podpora modulu plug-in Emmet pro VS Code",
			"emmetExclude": "Pole hodnot jazyků, kde by se neměly rozbalovat zkratky Emmet",
			"emmetExtensionsPath": "Pole cest, kde každá cesta může obsahovat Emmet syntaxProfiles nebo soubory výstřižku.\r\nV případě konfliktu profily nebo výstřižky z pozdějších cest přepíší hodnoty dřívějších cest.\r\nDalší informace a ukázku souboru výstřižku najdete na https://code.visualstudio.com/docs/editor/emmet.",
			"emmetExtensionsPathItem": "Cesta obsahující Emmet syntaxProfiles nebo výstřižky.",
			"emmetIncludeLanguages": "Umožňuje povolit zkratky Emmet v jazycích, které nejsou ve výchozím nastavení podporovány. Sem přidejte mapování mezi jazykem a jazykem podporovaným modulem plug-in Emmet.\r\n Příklad: {\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}",
			"emmetOptimizeStylesheetParsing": "Pokud je nastaveno na hodnotu false, parsuje se celý soubor, aby se zjistilo, jestli je aktuální pozice platná pro rozbalení zkratek Emmet. Pokud je nastaveno na hodnotu true, bude parsován pouze obsah na aktuální pozici v souborech CSS/SCSS/Less.",
			"emmetPreferences": "Předvolby používané k úpravě chování určitých akcí a překladačů v modulu plug-in Emmet",
			"emmetPreferencesAllowCompactBoolean": "Při hodnotě true se vytvoří kompaktní notace logických atributů.",
			"emmetPreferencesBemElementSeparator": "Oddělovač elementů používaný pro třídy při použití filtru BEM",
			"emmetPreferencesBemModifierSeparator": "Oddělovač modifikátorů používaný pro třídy při použití filtru BEM",
			"emmetPreferencesCssAfter": "Symbol, který se má umístit na konec vlastnosti CSS při rozbalování zkratek CSS",
			"emmetPreferencesCssBetween": "Symbol, který se má umístit mezi vlastnost CSS a hodnotu při rozbalování zkratek CSS",
			"emmetPreferencesCssColorShort": "Když se nastaví na true, hodnoty barev, třeba #f, se rozšíří na #fff namísto #ffffff.",
			"emmetPreferencesCssFuzzySearchMinScore": "Minimální skóre (0 až 1), kterého by měla dosáhnout zkratka s částečnou shodou. Nižší hodnoty mohou mít za následek mnoho falešně pozitivních shod, vyšší hodnoty mohou snížit počet možných shod.",
			"emmetPreferencesCssMozProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „moz“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „moz“, nastavte prázdný řetězec.",
			"emmetPreferencesCssMsProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „ms“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „ms“, nastavte prázdný řetězec.",
			"emmetPreferencesCssOProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „o“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „o“, nastavte prázdný řetězec.",
			"emmetPreferencesCssWebkitProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „webkit“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „webkit“, nastavte prázdný řetězec.",
			"emmetPreferencesFilterCommentAfter": "Definice komentáře, který by měl být umístěn za odpovídající element, když je aplikován filtr komentáře",
			"emmetPreferencesFilterCommentBefore": "Definice komentáře, který by měl být umístěn před odpovídajícím elementem, když je aplikován filtr komentáře",
			"emmetPreferencesFilterCommentTrigger": "Seznam názvů atributů oddělených čárkami, které se musí ve zkratce objevit, aby se aplikoval filtr komentářů",
			"emmetPreferencesFloatUnit": "Výchozí jednotka pro hodnoty float",
			"emmetPreferencesFormatForceIndentTags": "Pole hodnot názvů značek, které by mělo vždy získávat vnitřní odsazení",
			"emmetPreferencesFormatNoIndentTags": "Pole hodnot názvů značek, které by nikdy nemělo získávat vnitřní odsazení",
			"emmetPreferencesIntUnit": "Výchozí jednotka pro hodnoty integer",
			"emmetPreferencesOutputInlineBreak": "Počet sousedních vložených elementů, které se vyžadují, aby se mezi tyto elementy vložila zalomení řádků. Pokud se nastaví na 0, vložené elementy se vždy rozšíří na jeden řádek.",
			"emmetPreferencesOutputReverseAttributes": "Pokud se nastaví na true, při vyhodnocování fragmentů obrací směry slučování atributů.",
			"emmetPreferencesOutputSelfClosingStyle": "Styl samouzavíracích značek: HTML (<br>), XML (<br/>) nebo XHTML (<br />).",
			"emmetPreferencesSassAfter": "Symbol, který se má umístit na konec vlastnosti CSS při rozbalování zkratek CSS v souborech Sass",
			"emmetPreferencesSassBetween": "Symbol, který se má umístit mezi vlastnost CSS a hodnotu při rozbalování zkratek CSS v souborech Sass",
			"emmetPreferencesStylusAfter": "Symbol, který se má umístit na konec vlastnosti CSS při rozbalování zkratek CSS v souborech Stylus",
			"emmetPreferencesStylusBetween": "Symbol, který se má umístit mezi vlastnost CSS a hodnotu při rozbalování zkratek CSS v souborech Stylus",
			"emmetShowAbbreviationSuggestions": "Umožňuje zobrazovat možné zkratky Emmet jako návrhy. Nelze použít v šablonách stylů nebo v případě, že má nastavení emmet.showExpandedAbbreviation hodnotu never.",
			"emmetShowExpandedAbbreviation": "Umožňuje zobrazovat rozbalené zkratky Emmet jako návrhy.\r\nMožnost inMarkupAndStylesheetFilesOnly platí pro html, haml, jade, slim, xml, xsl, css, scss, sass, less a stylus.\r\nMožnost always se vztahuje na všechny části souboru bez ohledu na značky/css.",
			"emmetShowSuggestionsAsSnippets": "Pokud má hodnotu true, návrhy Emmet se zobrazí jako fragmenty kódu, což vám umožní uspořádat je podle nastavení #editor.snippetSuggestions#.",
			"emmetSyntaxProfiles": "Definujte profil pro zadanou syntaxi nebo použijte svůj vlastní profil se specifickými pravidly.",
			"emmetTriggerExpansionOnTab": "Pokud je tato možnost povolená, zkratky Emmet se při stisknutí klávesy TAB rozbalí, i když se nezobrazí dokončení. Pokud je tato možnost zakázaná, stále můžete zobrazené dokončení přijmout stisknutím klávesy TAB.",
			"emmetUseInlineCompletions": "V případě hodnoty true bude Emmet navrhovat rozšíření prostřednictvím vloženého dokončování. Pokud chcete (když má toto nastavení hodnotu true) zabránit tomu, aby se poskytovatel položek k dokončení, který není vložený, zobrazoval tak často, pak u položky other přepněte #editor.quickSuggestions# na inline nebo off.",
			"emmetVariables": "Proměnné, které se mají používat ve fragmentech kódu Emmet"
		}
	}
}