{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Exemplo",
			"Files by Extension": "Arquivos por Extensão",
			"Files with Extension": "Arquivos com Extensão",
			"Files with Multiple Extensions": "Arquivos com Várias Extensões",
			"Files with Path": "Arquivos com Caminho",
			"Files with Siblings by Name": "Arquivos com Irmãos por Nome",
			"Folder by Name (Any Location)": "Pasta por Nome (Qualquer Localização)",
			"Folder by Name (Top Level)": "Pasta por Nome (Nível Superior)",
			"Folders with Multiple Names (Top Level)": "Pastas com Vários Nomes (Nível Superior)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Mapear todos os arquivos que correspondem ao padrão glob de caminho absoluto no caminho deles para a linguagem com o identificador especificado.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Mapear todos os arquivos que correspondem ao padrão glob no nome de arquivo deles para a linguagem com o identificador especificado.",
			"Match a folder with a specific name in any location.": "Corresponder uma pasta com um nome específico em qualquer localização.",
			"Match a top level folder with a specific name.": "Corresponder uma pasta de nível superior com um nome específico.",
			"Match all files of a specific file extension.": "Corresponder todos os arquivos de uma extensão de arquivo específica.",
			"Match all files with any of the file extensions.": "Comparar todos os arquivos com qualquer uma das extensões de arquivo.",
			"Match files that have siblings with the same name but a different extension.": "Corresponder arquivos que têm irmãos com o mesmo nome, mas com uma extensão diferente.",
			"Match multiple top level folders.": "Corresponder várias pastas de nível superior.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "O caractere usado pelo sistema operacional para separar componentes em caminhos de arquivos. Também tem o alias de “/”.",
			"The current opened file": "O arquivo aberto no momento",
			"The current opened file relative to ${workspaceFolder}": "O arquivo aberto no momento em relação a ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "O nome da pasta do espaço de trabalho de arquivo aberto atual sem barras (/)",
			"The current opened file's basename": "O nome base do arquivo aberto no momento",
			"The current opened file's basename with no file extension": "O nome base do arquivo aberto no momento sem nenhuma extensão de arquivo",
			"The current opened file's dirname": "O nome do diretório do arquivo aberto no momento",
			"The current opened file's dirname relative to ${workspaceFolder}": "O nome do diretório do arquivo aberto no momento em relação a ${workspaceFolder}",
			"The current opened file's extension": "A extensão do arquivo aberto no momento",
			"The current selected line number in the active file": "O número de linha selecionado no momento no arquivo ativo",
			"The current selected text in the active file": "O texto selecionado no momento no arquivo ativo",
			"The file extension of the editor (e.g. txt)": "A extensão de arquivo do editor (por exemplo, txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "O nome do arquivo do editor sem seu diretório ou extensão (por exemplo, myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "O nome da tarefa de build padrão. Se não houver uma tarefa de build única padrão, uma seleção rápida será mostrada para escolher a tarefa de build.",
			"The name of the folder opened in VS Code without any slashes (/)": "O nome da pasta aberta no VS Code sem barras (/)",
			"The nth parent folder name of the editor": "O nome da enésima pasta pai do editor",
			"The parent folder name of the editor (e.g. myFileFolder)": "O nome da pasta pai do editor (por exemplo, myFileFolder)",
			"The path of the folder opened in VS Code": "O caminho da pasta aberta no VS Code",
			"The path where an extension is installed.": "O caminho onde uma extensão está instalada.",
			"The task runner's current working directory on startup": "O diretório de trabalho atual do executor de tarefas na inicialização",
			"Use the language of the currently active text editor if any": "Use a linguagem do editor de texto ativo no momento, se houver",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "um separador condicional (' - ') que é mostrado apenas quando circundado por variáveis com valores",
			"an indicator for when the active editor has unsaved changes": "um indicador para quando o editor ativo tem alterações não salvas",
			"e.g. SSH": "por exemplo, SSH",
			"e.g. VS Code": "por exemplo, VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "caminho do arquivo do workspace (por exemplo, /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "caminho do arquivo da pasta do workspace na qual o arquivo está contido (por exemplo, /Users/Development/myFolder)",
			"gist": "Essência",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "nome da pasta do workspace na qual o arquivo está contido (por exemplo, myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "nome do espaço de trabalho com nome remoto opcional e indicador de espaço de trabalho, se aplicável (por exemplo, myFolder, myRemoteFolder [SSH] ou myWorkspace (Workspace))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "nome abreviado do espaço de trabalho sem sufixos (por exemplo, myFolder ou myWorkspace)",
			"the file name (e.g. myFile.txt)": "o nome do arquivo (por exemplo, myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "o caminho completo do arquivo (por exemplo, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "o caminho completo da pasta na qual o arquivo está contido (por exemplo, /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "o nome do branch ativo no repositório ativo (por exemplo, principal)",
			"the name of the active repository (e.g. vscode)": "o nome do repositório ativo (por exemplo, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "o nome da pasta na qual o arquivo está contido (por exemplo, myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "o caminho do arquivo em relação à pasta do workspace (por exemplo, myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "o caminho da pasta na qual o arquivo está contido em relação à pasta do workspace (por exemplo, myFolder/myFileFolder)"
		},
		"package": {
			"description": "Fornece recursos (IntelliSense avançado, correção automática) em arquivos de configuração, como arquivos de recomendação de extensão, de inicialização e de configuração.",
			"displayName": "Edição de Configuração"
		}
	}
}