{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Przykład",
			"Files by Extension": "Pliki według rozszerzenia",
			"Files with Extension": "Pliki z rozszerzeniem",
			"Files with Multiple Extensions": "Pliki z wieloma rozszerzeniami",
			"Files with Path": "Pliki ze ścieżką",
			"Files with Siblings by Name": "Pliki z elementami równorzędnymi według nazwy",
			"Folder by Name (Any Location)": "Folder według nazwy (dowolna lokalizacja)",
			"Folder by Name (Top Level)": "Folder według nazwy (najwyższy poziom)",
			"Folders with Multiple Names (Top Level)": "Foldery z wieloma nazwami (najwyższy poziom)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Mapuj wszystkie pliki, których ścieżka jest zgodna z wzorcem globalnym ścieżki bezwzględnej, na język o określonym identyfikatorze.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Mapuj wszystkie pliki, których nazwa jest zgodna z wzorcem globalnym, na język o określonym identyfikatorze.",
			"Match a folder with a specific name in any location.": "Dopasuj folder o konkretnej nazwie w dowolnej lokalizacji.",
			"Match a top level folder with a specific name.": "Dopasuj folder najwyższego poziomu o określonej nazwie.",
			"Match all files of a specific file extension.": "Dopasuj wszystkie pliki konkretnego rozszerzenia pliku.",
			"Match all files with any of the file extensions.": "Dopasuj wszystkie pliki z dowolnymi rozszerzeniami plików.",
			"Match files that have siblings with the same name but a different extension.": "Dopasuj pliki z elementami równorzędnymi o tej samej nazwie, ale innym rozszerzeniu.",
			"Match multiple top level folders.": "Dopasuj wiele folderów najwyższego poziomu.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Znak używany przez system operacyjny do rozdzielania składników w ścieżkach plików. Jest również aliasem „/”.",
			"The current opened file": "Aktualnie otwarty plik",
			"The current opened file relative to ${workspaceFolder}": "Aktualnie otwarty plik względem folderu ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Nazwa aktualnie otwartego folderu obszaru roboczego pliku bez ukośników (/)",
			"The current opened file's basename": "Nazwa podstawowa aktualnie otwartego pliku",
			"The current opened file's basename with no file extension": "Nazwa podstawowa aktualnie otwartego pliku bez rozszerzenia pliku",
			"The current opened file's dirname": "Nazwa katalogu aktualnie otwartego pliku",
			"The current opened file's dirname relative to ${workspaceFolder}": "Nazwa katalogu aktualnie otwartego pliku względem folderu ${workspaceFolder}",
			"The current opened file's extension": "Rozszerzenie aktualnie otwartego pliku",
			"The current selected line number in the active file": "Numer aktualnie zaznaczonego wiersza w aktywnym pliku",
			"The current selected text in the active file": "Aktualnie zaznaczony tekst w aktywnym pliku",
			"The file extension of the editor (e.g. txt)": "Rozszerzenie pliku edytora (e.g. txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Nazwa pliku edytora bez jego katalogu lub rozszerzenia (np. myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Nazwa domyślnego zadania kompilacji. Jeśli nie istnieje żadne domyślne zadanie kompilacji, zostanie wyświetlone menu szybkiego wyboru zadania kompilacji.",
			"The name of the folder opened in VS Code without any slashes (/)": "Nazwa folderu otwartego w programie VS Code bez ukośników (/)",
			"The nth parent folder name of the editor": "N-ta nazwa folderu nadrzędnego edytora",
			"The parent folder name of the editor (e.g. myFileFolder)": "Nazwa folderu nadrzędnego edytora (np. myFileFolder)",
			"The path of the folder opened in VS Code": "Ścieżka folderu otwartego w programie VS Code",
			"The path where an extension is installed.": "Ścieżka, w której zainstalowane jest rozszerzenie.",
			"The task runner's current working directory on startup": "Bieżący katalog roboczy modułu uruchamiającego zadania podczas uruchamiania",
			"Use the language of the currently active text editor if any": "Użyj języka aktualnie aktywnego edytora tekstu, jeśli istnieje",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "separator warunkowy („-”), który jest wyświetlany tylko wtedy, gdy jest otoczony zmiennymi z wartościami",
			"an indicator for when the active editor has unsaved changes": "wskaźnik informujący o tym, kiedy aktywny edytor zawiera niezapisane zmiany",
			"e.g. SSH": "np. SSH",
			"e.g. VS Code": "np. VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "ścieżka pliku obszaru roboczego (np. /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "ścieżka pliku folderu obszaru roboczego, w którym znajduje się plik (np. /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "nazwa folderu obszaru roboczego, w którym znajduje się plik (np. myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "nazwa obszaru roboczego z opcjonalną nazwą zdalną i wskaźnikiem obszaru roboczego, jeśli ma to zastosowanie (np. myFolder, myRemoteFolder [SSH] lub myWorkspace (obszar roboczy))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "skrócona nazwa obszaru roboczego bez sufiksów (np. myFolder lub myWorkspace)",
			"the file name (e.g. myFile.txt)": "nazwa pliku (np. myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "pełna ścieżka pliku (np. /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "pełna ścieżka folderu, w którym znajduje się plik (np. /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "nazwa aktywnej gałęzi w aktywnym repozytorium (np. main)",
			"the name of the active repository (e.g. vscode)": "nazwa aktywnego repozytorium (np. vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "nazwa folderu, w którym znajduje się plik (np. myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "ścieżka pliku względem folderu obszaru roboczego (np. myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "ścieżka folderu, w którym znajduje się plik, względem folderu obszaru roboczego (np. myFolder/myFileFolder)"
		},
		"package": {
			"description": "Udostępnia możliwości (zaawansowana funkcja IntelliSense, automatyczne naprawianie) w plikach konfiguracyjnych, takie jak ustawienia, uruchamianie i zalecenia dotyczące rozszerzeń.",
			"displayName": "Edytowanie konfiguracji"
		}
	}
}