{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "„store” test logiczny na potrzeby późniejszej oceny w funkcji guard lub if().",
			"'from' expected": "oczekiwano wyrażenia „from”",
			"'in' expected": "oczekiwano wyrażenia „in”",
			"'through' or 'to' expected": "oczekiwano wyrażenia „through” lub „to”",
			"'{0}'": "„{0}”",
			"( expected": "Oczekiwano znaku (",
			") expected": "oczekiwano znaku )",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "Reguła @font-face musi definiować właściwości „src” i „font-family”",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Lista właściwości, które nie są weryfikowane względem reguły „unknownProperties”.",
			"Adds quotes to a string.": "Dodaje cudzysłowy do ciągu.",
			"Also define the standard property '{0}' for compatibility": "Zdefiniuj również właściwość standardową „{0}”, aby uzyskać zgodność",
			"Always define standard rule '@keyframes' when defining keyframes.": "Zawsze definiuj regułę standardową „@keyframes” podczas definiowania klatek kluczowych.",
			"Always include all vendor specific properties: Missing: {0}": "Zawsze uwzględniaj wszystkie właściwości specyficzne dla dostawcy: brak: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Zawsze dołączaj wszystkie reguły specyficzne dla dostawcy: brak: {0}",
			"Appends a single value onto the end of a list.": "Dołącza pojedynczą wartość na końcu listy.",
			"Appends selectors to one another without spaces in between.": "Dołącza selektory do siebie bez spacji między nimi.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Unikaj używania właściwości !important. Wskazuje ona na to, że specyficzność całego kodu CSS wymknęła się spod kontroli i wymaga on refaktoryzacji.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Unikaj używania właściwości „float”. Właściwości float powodują, że kod CSS ulega łatwemu uszkodzeniu w przypadku zmiany jednego aspektu układu.",
			"Causes one or more rules to be emitted at the root of the document.": "Powoduje, że co najmniej jedna reguła jest emitowana w katalogu głównym dokumentu.",
			"Changes one or more properties of a color.": "Zmienia co najmniej jedną właściwość koloru.",
			"Changes the alpha component for a color.": "Zmienia składnik alfa na kolor.",
			"Changes the hue of a color.": "Zmienia odcień koloru.",
			"Character entity representing '{0}'": "Jednostka znaku reprezentująca „{0}”",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Jednostka znaku reprezentująca „{0}”, odpowiednik unicode „{1}”",
			"Closing bracket expected.": "Oczekiwano nawiasu zamykającego.",
			"Closing bracket missing.": "Brak nawiasu zamykającego.",
			"Combines several lists into a single multidimensional list.": "Łączy kilka list w jedną listę wielowymiarową.",
			"Configure": "Konfiguruj",
			"Converts a color into the format understood by IE filters.": "Konwertuje kolor na format zrozumiały dla filtrów IE.",
			"Converts a color to grayscale.": "Konwertuje kolor na skalę odcieni szarości.",
			"Converts a string to lower case.": "Konwertuje ciąg na małe litery.",
			"Converts a string to upper case.": "Konwertuje ciąg na wielkie litery.",
			"Converts a unitless number to a percentage.": "Konwertuje liczbę bez jednostek na wartość procentową.",
			"Creates a Color from hue, saturation, and lightness values.": "Tworzy kolor na podstawie wartości odcienia, nasycenia i jasności.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Tworzy kolor na podstawie odcienia, nasycenia, jasności i wartości alfa.",
			"Creates a Color from hue, white, and black values.": "Tworzy kolor z wartości odcienia, bieli i czerni.",
			"Creates a Color from lightness, a, and b values.": "Tworzy kolor na podstawie wartości jasności, a i b.",
			"Creates a Color from lightness, chroma, and hue values.": "Tworzy kolor na podstawie wartości jasności, barwy i odcienia.",
			"Creates a Color from red, green, and blue values.": "Tworzy kolor na podstawie wartości koloru czerwonego, zielonego i niebieskiego.",
			"Creates a Color from red, green, blue, and alpha values.": "Tworzy kolor na podstawie wartości kolorów czerwonego, zielonego, niebieskiego i wartości alfa.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Tworzy kolor na podstawie wartości odcienia, nasycenia i jasności innego koloru.",
			"Creates a Color from the hue, white, and black values of another Color.": "Tworzy kolor na podstawie wartości odcienia, bieli i czerni innego koloru.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Tworzy kolor z wartości jasności, a i b innego koloru.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Tworzy kolor na podstawie wartości jasności, barwy i odcienia innego koloru.",
			"Creates a Color from the red, green, and blue values of another Color.": "Tworzy kolor z czerwonych, zielonych i niebieskich wartości innego koloru.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Tworzy kolor w określonej przestrzeni kolorów z wartości czerwonego, zielonego i niebieskiego.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Tworzy kolor w określonej przestrzeni kolorów na podstawie wartości czerwonego, zielonego i niebieskiego innego koloru.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Definiuje złożone operacje, których można ponownie używać w arkuszach stylów.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Definiuje style, które mogą być ponownie używane w całym arkuszu stylów za pomocą elementu „@include”.",
			"Do not use duplicate style definitions": "Nie używaj zduplikowanych definicji stylów",
			"Do not use empty rulesets": "Nie używaj pustych zestawów reguł",
			"Do not use width or height when using padding or border": "Nie używaj właściwości „width” lub „height”, jeśli używana jest właściwość „padding” lub „border”",
			"Dynamically calls a Sass function.": "Dynamicznie wywołuje funkcję Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Każda pętla, która ustawia element „$var” na każdy element na liście lub mapie, następnie generuje style, które zawiera, używając tej wartości „$var”.",
			"End tag name expected.": "Oczekiwano nazwy tagu końcowego.",
			"Exposes the details of Sass’s inner workings.": "Uwidacznia szczegóły wewnętrznego działania języka Sass.",
			"Extends $extendee with $extender within $selector.": "Rozszerza $extendee o $extender w $selector.",
			"Extracts a substring from $string.": "Wyodrębnia podciąg z $string.",
			"Finds the maximum of several numbers.": "Znajduje wartość maksymalną kilku liczb.",
			"Finds the minimum of several numbers.": "Znajduje wartość minimalną kilku liczb.",
			"Fluidly scales one or more properties of a color.": "Płynnie skaluje co najmniej jedną właściwość koloru.",
			"Folding Region End": "Koniec regionu składania",
			"Folding Region Start": "Początek obszaru składania",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Pętla „For”, która wielokrotnie generuje zestaw stylów dla każdego elementu `$var` w klauzuli `from/through` lub `from/to`.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Generuje nowe kolory na podstawie istniejących, co ułatwia tworzenie motywów kolorów.",
			"Gets the blue component of a color.": "Pobiera niebieski składnik koloru.",
			"Gets the green component of a color.": "Pobiera zielony składnik koloru.",
			"Gets the hue component of a color.": "Pobiera składnik odcienia koloru.",
			"Gets the lightness component of a color.": "Pobiera składnik jasności koloru.",
			"Gets the opacity component of a color.": "Pobiera składnik nieprzezroczystości koloru.",
			"Gets the red component of a color.": "Pobiera czerwony składnik koloru.",
			"Gets the saturation component of a color.": "Pobiera składnik nasycenia koloru.",
			"HTML Language Server": "Serwer języka HTML",
			"Hex colors must consist of three, four, six or eight hex numbers": "Kolory szesnastkowe muszą składać się z trzech, czterech, sześciu lub ośmiu liczb szesnastkowych",
			"IE hacks are only necessary when supporting IE7 and older": "Porady programu IE są niezbędne tylko w przypadku obsługi programu IE7 lub starszego",
			"Import statements do not load in parallel": "Instrukcje importu nie są ładowane równolegle",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Zawiera treść, jeśli wyrażenie nie ma wartości „false” lub „null”.",
			"Includes the styles defined by another mixin into the current rule.": "Dołącza style zdefiniowane przez inną mieszankę do bieżącej reguły.",
			"Increases or decreases one or more components of a color.": "Zwiększa lub zmniejsza co najmniej jeden składnik koloru.",
			"Inherits the styles of another selector.": "Dziedziczy style innego selektora.",
			"Inserts $insert into $string at $index.": "Wstawia $insert do $string w $index.",
			"Invalid number of parameters": "Nieprawidłowa liczba parametrów",
			"Joins together two lists into one.": "Łączy dwie listy w jedną.",
			"Lets you access and modify values in lists.": "Umożliwia dostęp do wartości na listach i modyfikowanie ich.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Ładuje arkusz stylów języka Sass i udostępnia jego mieszanki, funkcje i zmienne po załadowaniu tego arkusza stylów za pomocą reguły @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Ładuje mieszanki, funkcje i zmienne z innych arkuszy stylów języka Sass jako „moduły” i łączy CSS z wielu arkuszy stylów.",
			"Makes a color darker.": "Sprawia, że kolor staje się ciemniejszy.",
			"Makes a color less saturated.": "Sprawia, że kolor jest mniej nasycony.",
			"Makes a color lighter.": "Sprawia, że kolor jest jaśniejszy.",
			"Makes a color more opaque.": "Sprawia, że kolor jest mniej przezroczysty.",
			"Makes a color more saturated.": "Sprawia, że kolor jest bardziej nasycony.",
			"Makes a color more transparent.": "Sprawia, że kolor jest bardziej przezroczysty.",
			"Makes it easy to combine, search, or split apart strings.": "Ułatwia łączenie, wyszukiwanie lub dzielenie ciągów.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Umożliwia wyszukiwanie wartości skojarzonej z kluczem na mapie i nie tylko.",
			"Merges two maps together into a new map.": "Scala dwie mapy w nową mapę.",
			"Mix two colors together in a polar color space.": "Wymieszaj dwa kolory w przestrzeni kolorów biegunowych.",
			"Mix two colors together in a rectangular color space.": "Wymieszaj dwa kolory w prostokątnej przestrzeni kolorów.",
			"Mixes two colors together.": "Łączy ze sobą dwa kolory.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Zagnieżdża selektor poniżej siebie tak, jakby był zagnieżdżony w arkuszu stylów.",
			"No unit for zero needed": "Zero nie wymaga określenia jednostki",
			"Parses a selector into the format returned by &.": "Analizuje selektor w formacie zwróconym przez element &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Drukuje wartość wyrażenia do standardowego strumienia wyjściowego błędu. Przydatne w przypadku debugowania skomplikowanych plików Sass.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Drukuje wartość wyrażenia do standardowego strumienia wyjściowego błędu. Przydatne w przypadku bibliotek, które muszą ostrzegać użytkowników o wycofaniu lub odzyskaniu sprawności po drobnych błędach użycia mieszania. Ostrzeżenia można wyłączyć za pomocą opcji wiersza polecenia „--quiet” lub opcji Sass „quiet”.",
			"Property is ignored due to the display.": "Właściwość jest ignorowana z powodu wyświetlacza.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Właściwość jest ignorowana z powodu wyświetlacza. W przypadku elementu „display: block” nie należy używać wyrównania w pionie.",
			"Provides access to Sass’s powerful selector engine.": "Zapewnia dostęp do zaawansowanego aparatu selektora języka Sass.",
			"Provides functions that operate on numbers.": "Udostępnia funkcje, które działają na liczbach.",
			"Removes quotes from a string.": "Usuwa cudzysłowy z ciągu.",
			"Rename to '{0}'": "Zmień nazwę na „{0}”",
			"Replaces $original with $replacement within $selector.": "Zastępuje $original elementem $replacement w $selector.",
			"Replaces the nth item in a list.": "Zastępuje n-ty element na liście.",
			"Returns a list of all keys in a map.": "Zwraca listę wszystkich kluczy na mapie.",
			"Returns a list of all values in a map.": "Zwraca listę wszystkich wartości na mapie.",
			"Returns a new map with keys removed.": "Zwraca nową mapę z usuniętymi kluczami.",
			"Returns a random number.": "Zwraca liczbę losową.",
			"Returns a specific item in a list.": "Zwraca określony element na liście.",
			"Returns the absolute value of a number.": "Zwraca wartość bezwzględną liczby.",
			"Returns the complement of a color.": "Zwraca uzupełnienie koloru.",
			"Returns the index of the first occurance of $substring in $string.": "Zwraca indeks pierwszego wystąpienia $substring w $string.",
			"Returns the inverse of a color.": "Zwraca odwrotność koloru.",
			"Returns the keywords passed to a function that takes variable arguments.": "Zwraca słowa kluczowe przekazane do funkcji, która przyjmuje argumenty zmiennej.",
			"Returns the length of a list.": "Zwraca długość listy.",
			"Returns the number of characters in a string.": "Zwraca liczbę znaków w ciągu.",
			"Returns the position of a value within a list.": "Zwraca pozycję wartości na liście.",
			"Returns the separator of a list.": "Zwraca separator listy.",
			"Returns the simple selectors that comprise a compound selector.": "Zwraca proste selektory składające się na selektor złożony.",
			"Returns the string representation of a value as it would be represented in Sass.": "Zwraca reprezentację ciągu wartości w postaci, w jakiej będzie ona reprezentowana w języku Sass.",
			"Returns the type of a value.": "Zwraca typ wartości.",
			"Returns the unit(s) associated with a number.": "Zwraca jednostki skojarzone z liczbą.",
			"Returns the value in a map associated with a given key.": "Zwraca wartość z mapy skojarzonej z danym kluczem.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Zwraca, czy $super pasuje do wszystkich elementów, do których pasuje element $sub i ewentualnie innych elementów.",
			"Returns whether a feature exists in the current Sass runtime.": "Zwraca, czy funkcja istnieje w bieżącym środowisku uruchomieniowym Sass.",
			"Returns whether a function with the given name exists.": "Zwraca, czy istnieje funkcja o podanej nazwie.",
			"Returns whether a map has a value associated with a given key.": "Zwraca, czy mapa ma wartość skojarzoną z danym kluczem.",
			"Returns whether a mixin with the given name exists.": "Zwraca, czy istnieje mieszanka o podanej nazwie.",
			"Returns whether a number has units.": "Zwraca, czy liczba ma jednostki.",
			"Returns whether a variable with the given name exists in the current scope.": "Zwraca, czy zmienna o podanej nazwie istnieje w bieżącym zakresie.",
			"Returns whether a variable with the given name exists in the global scope.": "Zwraca, czy zmienna o podanej nazwie istnieje w zakresie globalnym.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Zwraca, czy można dodać, odejmować lub porównać dwie liczby.",
			"Rounds a number down to the previous whole number.": "Zaokrągla liczbę w dół do najbliższej liczby całkowitej.",
			"Rounds a number to the nearest whole number.": "Zaokrągla liczbę do najbliższej liczby całkowitej.",
			"Rounds a number up to the next whole number.": "Zaokrągla liczbę w górę do najbliższej liczby całkowitej.",
			"Sass documentation": "Dokumentacja języka Sass",
			"Selector Specificity": "Specyficzność selektora",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Selektory nie powinny zawierać identyfikatorów, ponieważ te reguły są zbyt mocno powiązane z kodem HTML.",
			"Simple HTML5 starting point": "Prosty punkt początkowy HTML5",
			"Start tag name expected.": "Oczekiwano nazwy tagu początkowego.",
			"Tag name must directly follow the open bracket.": "Nazwa tagu musi znajdować się bezpośrednio po otwartym nawiasie.",
			"The universal selector (*) is known to be slow": "Działanie uniwersalnego selektora (*) jest powolne",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Zgłasza wartość wyrażenia jako błąd krytyczny ze śledzeniem stosu. Przydatne w przypadku sprawdzania poprawności argumentów w miksach i funkcjach.",
			"URI expected": "oczekiwano identyfikatora URI",
			"URL encodes a string": "Adres URL koduje ciąg",
			"Unexpected character in tag.": "Nieoczekiwany znak w tagu.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Ujednolica dwa selektory w celu utworzenia selektora zgodnego z elementami dopasowanymi przez oba.",
			"Unknown at-rule.": "Nieznana reguła at.",
			"Unknown property.": "Nieznana właściwość.",
			"Unknown property: '{0}'": "Nieznana właściwość: „{0}”",
			"Unknown vendor specific property.": "Nieznana właściwość specyficzna dla dostawcy.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "Program VS Code teraz ma wbudowaną obsługę automatycznego zmieniania nazw tagów. Czy chcesz ją włączyć?",
			"When using a vendor-specific prefix also include the standard property": "W przypadku używania prefiksu specyficznego dla dostawcy należy dołączyć również standardową właściwość",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "W przypadku używania prefiksu specyficznego dla dostawcy należy dołączyć wszystkie inne właściwości specyficzne dla dostawcy",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Pętla „while”, która przyjmuje wyrażenie i wielokrotnie generuje zagnieżdżone style, dopóki instrukcja nie zwróci wartości „false”.",
			"[ expected": "oczekiwano znaku [",
			"] expected": "Oczekiwano znaku ]",
			"absolute value of a number": "wartość bezwzględna liczby",
			"arccosine - inverse of cosine function": "arcus cosinus — odwrotność funkcji cosinusu",
			"arcsine - inverse of sine function": "arcus sinus — odwrotność funkcji sinusa",
			"arctangent - inverse of tangent function": "arcus tangens — odwrotność funkcji tangens",
			"argument from '{0}'": "argument z elementu „{0}”",
			"at-rule or selector expected": "oczekiwano reguły at-rule lub selektora",
			"at-rule unknown": "nieznana reguła at-rule",
			"bind the evaluation of a ruleset to each member of a list.": "powiąż ocenę zestawu reguł z każdym elementem członkowskim listy.",
			"calculates square root of a number": "oblicza pierwiastek kwadratowy liczby",
			"colon expected": "oczekiwano dwukropka",
			"comma expected": "oczekiwano przecinka",
			"condition expected": "oczekiwano warunku",
			"converts numbers from one type into another": "konwertuje liczby z jednego typu na inny",
			"converts to a %, e.g. 0.5 > 50%": "konwertuje na %, np. 0,5 > 50%",
			"cosine function": "funkcja cosinus",
			"creates a #AARRGGBB": "tworzy #AARRGGBB",
			"creates a color": "tworzy kolor",
			"dot expected": "oczekiwano kropki",
			"escape string content": "zawartość ciągu ucieczki",
			"expression expected": "oczekiwano wyrażenia",
			"first argument modulus second argument": "pierwszy argument wartości bezwzględnej drugiego argumentu",
			"first argument raised to the power of the second argument": "pierwszy argument podniesiony do potęgi drugiego argumentu",
			"generate a list spanning a range of values": "wygeneruj listę obejmującą zakres wartości",
			"identifier expected": "oczekiwano identyfikatora",
			"identifier or variable expected": "oczekiwano identyfikatora lub zmiennej",
			"identifier or wildcard expected": "oczekiwano identyfikatora lub symbolu wieloznacznego",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "blok wbudowany jest ignorowany z powodu właściwości float. Jeśli właściwość „float” ma wartość inną niż „brak”, pole jest przestawiane, a element „display” jest traktowany jako „block”",
			"inlines a resource and falls back to `url()`": "umieszcza zasób w tekście i powraca do elementu „url()”",
			"media query expected": "oczekiwano zapytania dotyczącego multimediów",
			"number expected": "oczekiwano liczby",
			"operator expected": "oczekiwano operatora",
			"page directive or declaraton expected": "oczekiwano dyrektywy lub deklaracji strony",
			"parses a string to a color": "analizuje ciąg do koloru",
			"percentage expected": "oczekiwano wartości procentowych",
			"property value expected": "oczekiwano wartości właściwości",
			"remove or change the unit of a dimension": "usuń lub zmień jednostkę wymiaru",
			"return `@color` 10% points darker": "zwróć wartość `@color` o 10% ciemniejszą",
			"return `@color` 10% points less saturated": "zwraca wartość „@color” o 10% mniej nasyconą",
			"return `@color` 10% points less transparent": "zwróć element `@color` o 10% mniej przezroczysty",
			"return `@color` 10% points lighter": "zwróć element „@color” o 10% jaśniejszy",
			"return `@color` 10% points more saturated": "zwróć wartość `@color` o 10% bardziej nasyconą",
			"return `@color` 10% points more transparent": "zwróć element `@color` o 10% bardziej przezroczysty",
			"return `@color` with 50% transparency": "zwróć element `@color` z 50% przezroczystością",
			"return `@color` with a 10 degree larger in hue": "zwróć wartość `@color` o 10 stopni większą w odcieniu",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "zwróć wartość „@darkcolor”, jeśli wartość „@color1 jest> 43% luminacji”, w przeciwnym razie zwróć wartość „@lightcolor”, zobacz notatki",
			"return a mix of `@color1` and `@color2`": "zwróć kombinację elementów `@color1` i `@color2`",
			"returns a grey, 100% desaturated color": "zwraca szary, 100% nienasycony kolor",
			"returns a value at the specified position in the list": "zwraca wartość na określonej pozycji na liście",
			"returns one of two values depending on a condition.": "Zwraca jedną z dwóch wartości w zależności od warunku.",
			"returns pi": "zwraca PI",
			"returns the `alpha` channel of `@color`": "zwraca kanał `alpha` elementu `@color`",
			"returns the `blue` channel of `@color`": "zwraca kanał `blue` elementu `@color`",
			"returns the `green` channel of `@color`": "zwraca kanał „green” elementu „@color”",
			"returns the `hue` channel of `@color` in the HSL space": "zwraca kanał „hue” elementu „@color” w przestrzeni HSL",
			"returns the `hue` channel of `@color` in the HSV space": "zwraca kanał „hue” elementu „@color” w przestrzeni HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "zwraca kanał `lightness` elementu `@color` w przestrzeni HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "zwraca wartość „luma” (jasność percepcyjna) elementu „@color”",
			"returns the `red` channel of `@color`": "zwraca kanał „red” elementu „@color”",
			"returns the `saturation` channel of `@color` in the HSL space": "zwraca kanał „nasycenie” elementu „@color” w przestrzeni HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "zwraca kanał `saturation` elementu `@color` w przestrzeni HSV",
			"returns the `value` channel of `@color` in the HSV space": "zwraca kanał `value` elementu `@color` w przestrzeni HSV",
			"returns the lowest of one or more values": "zwraca najniższą z co najmniej jednej wartości",
			"returns the number of elements in a value list": "zwraca liczbę elementów na liście wartości",
			"rounds a number to a number of places": "zaokrągla liczbę do wielu miejsc",
			"rounds down to an integer": "zaokrągla w dół do liczby całkowitej",
			"rounds up to an integer": "zaokrągla w górę do liczby całkowitej",
			"selector expected": "oczekiwano selektora",
			"semi-colon expected": "oczekiwano średnika",
			"sine function": "funkcja sinusoidalna",
			"string literal expected": "Oczekiwano literału ciągu",
			"string replace": "zamiana ciągu",
			"tangent function": "funkcja styczna",
			"term expected": "oczekiwano terminu",
			"unknown keyword": "nieznane słowo kluczowe",
			"uri or string expected": "oczekiwano identyfikatora URI lub ciągu",
			"variable name expected": "oczekiwano nazwy zmiennej",
			"variable value expected": "Oczekiwano wartości zmiennej",
			"whitespace expected": "oczekiwano odstępów",
			"wildcard expected": "oczekiwano symbolu wieloznacznego",
			"{ expected": "Oczekiwano znaku {",
			"{0}, '{1}'": "{0}, „{1}”",
			"} expected": "Oczekiwano znaku }"
		},
		"package": {
			"description": "Udostępnia zaawansowaną obsługę języka dla plików HTML i Handlebar",
			"displayName": "Funkcje języka HTML",
			"html.autoClosingTags": "Włącz/wyłącz automatyczne zamykanie tagów HTML.",
			"html.autoCreateQuotes": "Włącz/wyłącz automatyczne tworzenie cudzysłowów dla przypisania atrybutów HTML. Typ cudzysłowów można skonfigurować za pomocą elementu „#html.completion.attributeDefaultValue#”.",
			"html.completion.attributeDefaultValue": "Steruje domyślną wartością atrybutów po zaakceptowaniu zakończenia.",
			"html.completion.attributeDefaultValue.doublequotes": "Wartość atrybutu jest ustawiona na „”.",
			"html.completion.attributeDefaultValue.empty": "Wartość atrybutu nie jest ustawiona.",
			"html.completion.attributeDefaultValue.singlequotes": "Wartość atrybutu jest ustawiona na „”.",
			"html.customData.desc": "Lista względnych ścieżek plików wskazujących pliki JSON występująca po [niestandardowym formacie danych](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nProgram VS Code ładuje dane niestandardowe podczas uruchamiania, aby zwiększyć obsługę HTML w przypadku niestandardowych tagów HTML, atrybutów i wartości atrybutów określonych w plikach JSON.\r\n\r\nŚcieżki plików są odpowiednie dla obszaru roboczego i są uwzględniane tylko ustawienia folderu obszaru roboczego.",
			"html.format.contentUnformatted.desc": "Rozdzielona przecinkami lista tagów, w których zawartość nie powinna być ponownie formatowana. Wartość domyślna „null” to tag „pre”.",
			"html.format.enable.desc": "Włącz/wyłącz domyślny program formatujący HTML.",
			"html.format.extraLiners.desc": "Rozdzielona przecinkami lista tagów, przed którymi powinien znajdować się dodatkowy wiersz. Wartość domyślna „null” to „head, body, /html”.",
			"html.format.indentHandlebars.desc": "Format i wcięcie „{{#foo}}” i „{{/foo}}”.",
			"html.format.indentInnerHtml.desc": "Wcięcie sekcji „<head>” i „<body>”.",
			"html.format.maxPreserveNewLines.desc": "Maksymalna liczba podziałów wierszy, które mają zostać zachowane w jednym fragmencie. Użyj wartości „null”, aby znieść limit.",
			"html.format.preserveNewLines.desc": "Określa, czy istniejące przerwy w wierszach przed elementami powinny zostać zachowane. Działa tylko przed elementami, nie wewnątrz tagów ani w przypadku tekstu.",
			"html.format.templating.desc": "Uwzględniaj tagi języków tworzenia szablonów Django, ERB, Handlebars i PHP.",
			"html.format.unformatted.desc": "Rozdzielona przecinkami lista tagów, które nie powinny być ponownie formatowane. Wartość domyślna „null” to wszystkie tagi wymienione na stronie https://www.w3.org/TR/html5/dom.html#phrasing-content.",
			"html.format.unformattedContentDelimiter.desc": "Przechowuj zawartość tekstową razem między tym ciągiem.",
			"html.format.wrapAttributes.alignedmultiple": "Zawijaj, gdy długość linii zostanie przekroczona, Wyrównaj atrybuty w pionie.",
			"html.format.wrapAttributes.auto": "Zawijaj atrybuty tylko wtedy, gdy długość linii zostanie przekroczona.",
			"html.format.wrapAttributes.desc": "Zawijaj atrybuty.",
			"html.format.wrapAttributes.force": "Zawijaj każdy atrybut oprócz pierwszego.",
			"html.format.wrapAttributes.forcealign": "Zawijaj każdy atrybut oprócz pierwszego i utrzymaj wyrównanie.",
			"html.format.wrapAttributes.forcemultiline": "Zawijaj każdy atrybut.",
			"html.format.wrapAttributes.preserve": "Zachowaj zawijanie atrybutów.",
			"html.format.wrapAttributes.preservealigned": "Zachowaj zawijanie atrybutów, ale wyrównaj je.",
			"html.format.wrapAttributesIndentSize.desc": "Wcięcie zawiniętych atrybutów po N znakach. Użyj wartości `null`, aby użyć domyślnego rozmiaru wcięcia. Ignorowane jeśli parametr `#html.format.wrapAttributes#` jest ustawiony na wartość `aligned`.",
			"html.format.wrapLineLength.desc": "Maksymalna liczba znaków na wiersz (0 = wyłącz).",
			"html.hover.documentation": "Pokaż dokumentację tagów i atrybutów po zatrzymaniu wskaźnika myszy.",
			"html.hover.references": "Pokaż odwołania do dokumentacji MDN po zatrzymaniu wskaźnika myszy.",
			"html.mirrorCursorOnMatchingTag": "Włącz/wyłącz dublowanie kursora w dopasowanym tagu HTML.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Przestarzałe na rzecz elementu „editor.linkedEditing”",
			"html.suggest.html5.desc": "Określa, czy wbudowane funkcje obsługi języka HTML sugerują tagi, właściwości i wartości języka HTML5.",
			"html.trace.server.desc": "Śledzi komunikację między programem VS Code i serwerem języka HTML.",
			"html.validate.scripts": "Określa, czy wbudowane funkcje obsługi języka HTML weryfikują osadzone skrypty.",
			"html.validate.styles": "Określa, czy wbudowane funkcje obsługi języka HTML weryfikują osadzone style."
		}
	}
}