{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Ejemplo",
			"Files by Extension": "Archivos por extensión",
			"Files with Extension": "Archivos con extensión",
			"Files with Multiple Extensions": "Archivos con varias extensiones",
			"Files with Path": "Archivos con ruta de acceso",
			"Files with Siblings by Name": "Archivos con elementos del mismo nivel por nombre",
			"Folder by Name (Any Location)": "Carpeta por nombre (cualquier ubicación)",
			"Folder by Name (Top Level)": "Carpeta por nombre (nivel superior)",
			"Folders with Multiple Names (Top Level)": "Carpetas con varios nombres (nivel superior)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Asigna todos los archivos cuya ruta de acceso al lenguaje con el identificador especificado coincide con el patrón global de ruta de acceso absoluta.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Asigna todos los archivos cuyo nombre coincide con el patrón global al lenguaje con el identificador especificado.",
			"Match a folder with a specific name in any location.": "Hacer coincidir una carpeta con un nombre determinado en cualquier ubicación.",
			"Match a top level folder with a specific name.": "Hacer coincidir una carpeta de nivel superior con un nombre específico.",
			"Match all files of a specific file extension.": "Hacer coincidir todos los archivos que tengan una extensión de archivo determinada.",
			"Match all files with any of the file extensions.": "Hacer coincidir todos los archivos con cualquiera de las extensiones de archivo.",
			"Match files that have siblings with the same name but a different extension.": "Hacer coincidir archivos que tienen elementos del mismo nivel con el mismo nombre pero con extensión diferente.",
			"Match multiple top level folders.": "Hacer coincidir varias carpetas de nivel superior.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Carácter que usa el sistema operativo para separar los componentes en las rutas de acceso de los archivos. También tiene el alias '/'.",
			"The current opened file": "El archivo abierto actualmente",
			"The current opened file relative to ${workspaceFolder}": "El archivo abierto actualmente relativo a ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Nombre de la carpeta del área de trabajo de archivos abierta actualmente sin barras diagonales (/)",
			"The current opened file's basename": "Nombre base del archivo abierto actual ",
			"The current opened file's basename with no file extension": "Nombre base del archivo abierto actual sin extensión de archivo ",
			"The current opened file's dirname": "Nombre del directorio del archivo abierto actual",
			"The current opened file's dirname relative to ${workspaceFolder}": "Nombre de directorio del archivo abierto actual en relación con ${workspaceFolder}",
			"The current opened file's extension": "Extensión del archivo abierto actualmente",
			"The current selected line number in the active file": "El número de línea seleccionado actual en el archivo activo",
			"The current selected text in the active file": "El texto actual seleccionado en el archivo activo ",
			"The file extension of the editor (e.g. txt)": "Extensión de archivo del editor (e.g. txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Nombre de archivo del editor sin su directorio o extensión (p. ej., miArchivo)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "El nombre de la tarea de compilación predeterminada. Si no hay una única tarea de compilación predeterminada se muestra una selección rápida para elegir la tarea de compilación.",
			"The name of the folder opened in VS Code without any slashes (/)": "El nombre de la carpeta abierta en VS Code sin ninguna barra diagonal (/)",
			"The nth parent folder name of the editor": "El enésimo nombre de carpeta primaria del editor",
			"The parent folder name of the editor (e.g. myFileFolder)": "Nombre de la carpeta principal del editor (p. ej., miCarpetaDeArchivo)",
			"The path of the folder opened in VS Code": "La ruta de la carpeta abierta en VS Code",
			"The path where an extension is installed.": "Ruta de acceso en que se instala una extensión.",
			"The task runner's current working directory on startup": "El directorio de trabajo del ejecutor de tarea en el arranque",
			"Use the language of the currently active text editor if any": "Utilice el idioma del editor de texto actualmente activo, si existe",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "un separador condicional (\"-\") que aparece solo cuando está rodeado de variables con valores",
			"an indicator for when the active editor has unsaved changes": "un indicador para cuando el editor activo tiene cambios sin guardar",
			"e.g. SSH": "por ejemplo, SSH",
			"e.g. VS Code": "p. ej. VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "ruta del archivo del área de trabajo (p. ej. /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "ruta de acceso de archivo de la carpeta del área de trabajo en la que el archivo está contenido (p. ej. /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "nombre de la carpeta del área de trabajo en la que el archivo está contenido (p. ej. myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "nombre del área de trabajo con el nombre remoto opcional y el indicador del área de trabajo si procede (por ejemplo, myFolder, myRemoteFolder [SSH] o myWorkspace (Workspace))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "nombre abreviado del área de trabajo sin sufijos (por ejemplo, myFolder o myWorkspace)",
			"the file name (e.g. myFile.txt)": "el nombre del archivo (por ejemplo miarchivo.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "la ruta de acceso completa del archivo (por ejemplo, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "la ruta completa de la carpeta que contiene el archivo (por ejemplo, /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "el nombre de la rama activa en el repositorio activo (por ejemplo, main)",
			"the name of the active repository (e.g. vscode)": "el nombre del repositorio activo (por ejemplo, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "el nombre de la carpeta en que se encuentra el archivo (por ejemplo, myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "la ruta de acceso de archivo relativa a la carpeta de área de trabajo (p. ej. myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "la ruta de la carpeta que contiene el archivo, relativa a la carpeta del área de trabajo (por ejemplo myFolder/myFileFolder)"
		},
		"package": {
			"description": "Proporciona características (IntelliSense avanzado, corrección automática) en archivos de configuración, como archivos de valores, de inicio y de recomendación de extensiones. ",
			"displayName": "Edición de configuración"
		}
	}
}