{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Příklad",
			"Files by Extension": "Soubory podle přípony",
			"Files with Extension": "Soubory s příponou",
			"Files with Multiple Extensions": "Soubory s více příponami",
			"Files with Path": "Soubory s cestou",
			"Files with Siblings by Name": "Soubory s položkami na stejné úrovni podle názvu",
			"Folder by Name (Any Location)": "Složka podle názvu (libovolné umístění)",
			"Folder by Name (Top Level)": "Složka podle názvu (nejvyšší úroveň)",
			"Folders with Multiple Names (Top Level)": "Složky s více názvy (nejvyšší úroveň)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Umožňuje namapovat všechny soubory odpovídající vzoru glob absolutní cesty v jejich cestě na jazyk s daným identifikátorem.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Umožňuje namapovat všechny soubory odpovídající vzoru glob v názvu souboru na jazyk s daným identifikátorem.",
			"Match a folder with a specific name in any location.": "Umožňuje vyhledat složku s určitým názvem v libovolném umístění.",
			"Match a top level folder with a specific name.": "Umožňuje vyhledat složku nejvyšší úrovně s určitým názvem.",
			"Match all files of a specific file extension.": "Umožňuje vyhledat všechny soubory s konkrétní příponou.",
			"Match all files with any of the file extensions.": "Umožňuje vyhledat všechny soubory s kteroukoli z uvedených přípon.",
			"Match files that have siblings with the same name but a different extension.": "Umožňuje vyhledat soubory, které mají položky na stejné úrovni se stejným názvem, ale jiným rozšířením",
			"Match multiple top level folders.": "Umožňuje vyhledat více složek nejvyšší úrovně.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Znak používaný operačním systémem k oddělení komponent v cestách k souborům. Je také aliasován pomocí /.",
			"The current opened file": "Aktuálně otevřený soubor",
			"The current opened file relative to ${workspaceFolder}": "Aktuálně otevřený soubor relativně ke složce ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Název aktuálně otevřené složky pracovního prostoru souborů bez lomítek (/)",
			"The current opened file's basename": "Základní název aktuálně otevřeného souboru",
			"The current opened file's basename with no file extension": "Základní název aktuálně otevřeného souboru bez přípony souboru",
			"The current opened file's dirname": "Název adresáře aktuálně otevřeného souboru",
			"The current opened file's dirname relative to ${workspaceFolder}": "Název adresáře aktuálně otevřeného souboru relativně ke složce ${workspaceFolder}",
			"The current opened file's extension": "Přípona aktuálně otevřeného souboru",
			"The current selected line number in the active file": "Číslo aktuálně vybraného řádku v aktivním souboru",
			"The current selected text in the active file": "Aktuálně vybraný text v aktivním souboru",
			"The file extension of the editor (e.g. txt)": "Přípona souboru editoru (například txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Název souboru editoru bez adresáře nebo přípony (např. myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Název výchozí úlohy sestavení. Pokud neexistuje žádná výchozí úloha sestavení, zobrazí se nabídka rychlého výběru pro zvolení úlohy sestavení.",
			"The name of the folder opened in VS Code without any slashes (/)": "Název složky otevřené ve VS Code bez lomítek (/)",
			"The nth parent folder name of the editor": "Název n-té nadřazené složky editoru",
			"The parent folder name of the editor (e.g. myFileFolder)": "Název nadřazené složky editoru (např. myFileFolder)",
			"The path of the folder opened in VS Code": "Cesta ke složce otevřené ve VS Code",
			"The path where an extension is installed.": "Cesta, kde je nainstalováno rozšíření",
			"The task runner's current working directory on startup": "Aktuální pracovní adresář spouštěče úloh při spuštění",
			"Use the language of the currently active text editor if any": "Použít jazyk aktuálně aktivního textového editoru, pokud existuje",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "podmíněný oddělovač (-), který se zobrazí pouze v případě uzavření do proměnných s hodnotami",
			"an indicator for when the active editor has unsaved changes": "indikuje, jestli aktivní editor obsahuje neuložené změny",
			"e.g. SSH": "například SSH",
			"e.g. VS Code": "například VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "cesta k souboru pracovního prostoru (například /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "cesta ke složce pracovního prostoru, ve které je soubor obsažen (například /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "název složky pracovního prostoru, ve které je soubor obsažen (například myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "název pracovního prostoru s volitelným vzdáleným názvem a indikátorem pracovního prostoru (např. myFolder, myRemoteFolder [SSH] nebo myWorkspace (pracovní prostor))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "zkrácený název pracovního prostoru bez přípon (např. myFolder nebo myWorkspace)",
			"the file name (e.g. myFile.txt)": "název souboru (například myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "úplná cesta k souboru (například /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "úplná cesta ke složce, ve které je soubor obsažen (například /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "název aktivní větve v aktivním úložišti (např. main)",
			"the name of the active repository (e.g. vscode)": "název aktivního úložiště (např. vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "název složky, ve které je soubor obsažen (například myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "cesta k souboru relativně ke složce pracovního prostoru (například myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "cesta ke složce, ve které je soubor obsažen, relativně ke složce pracovního prostoru (například myFolder/myFileFolder)"
		},
		"package": {
			"description": "Poskytuje funkce (pokročilá funkce IntelliSense, automatické opravy) v konfiguračních souborech, jako jsou například soubory nastavení, soubory spuštění a soubory doporučení rozšíření.",
			"displayName": "Úpravy konfigurace"
		}
	}
}