{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref “{0}” in “{1}” não pode ser resolvido.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Um valor padrão. Usado pelas sugestões.",
			"A descriptive title of the schema.": "Um título descritivo do esquema.",
			"A long description of the schema. Used in hover menus and suggestions.": "Uma descrição longa do esquema. Usado em menus de foco e sugestões.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Um mapa de nomes de propriedade para uma matriz de nomes de propriedade ou um esquema. Uma matriz de nomes de propriedade significa que a propriedade nomeada na chave depende das propriedades na matriz que estão presentes no objeto para serem válidas. Se o valor for um esquema, o esquema só será aplicado ao objeto se a propriedade na chave existir no objeto.",
			"A map of property names to schemas for each property.": "Um mapa de nomes de propriedades para esquemas para cada propriedade.",
			"A map of regular expressions on property names to schemas for matching properties.": "Um mapa de expressões regulares em nomes de propriedades para esquemas para propriedades correspondentes.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Um número que deve dividir corretamente o valor atual (ou seja, sem resto).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Uma expressão regular com a qual corresponder a cadeia. Não é ancorada implicitamente.",
			"A schema which must not match.": "Um esquema que não deve corresponder.",
			"A unique identifier for the schema.": "Um identificador exclusivo para o esquema.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Uma instância de matriz é válida em relação a \"contém\" se pelo menos um de seus elementos for válido em relação ao esquema fornecido.",
			"An array of schemas, all of which must match.": "Uma matriz de esquemas, todos os quais devem corresponder.",
			"An array of schemas, exactly one of which must match.": "Uma matriz de esquemas, exatamente um dos quais deve corresponder.",
			"An array of schemas, where at least one must match.": "Uma matriz de esquemas, em que pelo menos um deve corresponder.",
			"An array of strings that lists the names of all properties required on this object.": "Uma matriz de cadeias de caracteres que lista os nomes de todas as propriedades necessárias neste objeto.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Uma instância será validada com êxito em relação a esta palavra-chave se seu valor for igual ao valor da palavra-chave.",
			"Array does not contain required item.": "A matriz não contém o item necessário.",
			"Array has duplicate items.": "A matriz tem itens duplicados.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "A matriz tem poucos itens que correspondem à restrição de conteúdo. Esperava-se {0} ou mais.",
			"Array has too few items. Expected {0} or more.": "A matriz tem poucos itens. Esperava-se {0} ou mais.",
			"Array has too many items according to schema. Expected {0} or fewer.": "A matriz tem muitos itens de acordo com o esquema. Esperava-se {0} ou menos.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "A matriz tem muitos itens que correspondem à restrição de conteúdo. Esperava-se {0} ou menos.",
			"Array has too many items. Expected {0} or fewer.": "A matriz tem muitos itens. Esperava-se {0} ou menos.",
			"Colon expected": "Dois-pontos esperados",
			"Comments are not permitted in JSON.": "Os comentários não são permitidos no JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Comentários de autores de esquema para leitores ou mantenedores do esquema.",
			"Configure": "Configurar",
			"Configured by extension: {0}": "Configurado pela extensão: {0}",
			"Configured in user settings": "Definido nas configurações do usuário",
			"Configured in workspace settings": "Definindo nas configurações do espaço de trabalho",
			"Default value": "Valor padrão",
			"Describes the content encoding of a string property.": "Descreve a codificação de conteúdo de uma propriedade de cadeia.",
			"Describes the format expected for the value. By default, not used for validation": "Descreve o formato esperado para o valor. Por padrão, não é usado para validação",
			"Describes the media type of a string property.": "Descreve o tipo de mídia de uma propriedade de cadeia.",
			"Downloading schemas is disabled through setting '{0}'": "O download de esquemas está desabilitado pela configuração '{0}'",
			"Downloading schemas is disabled. Click to configure.": "O download de esquemas está desabilitado. Clique para configurar.",
			"Draft-03 schemas are not supported.": "Não há suporte para esquemas draft-03.",
			"Duplicate anchor declaration: '{0}'": "Declaração de âncora duplicada: “{0}”",
			"Duplicate object key": "Chave de objeto duplicada",
			"Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Um esquema ou um valor booliano. Se for um esquema, usado para validar todas as propriedades que não correspondem a 'properties', 'propertyNames' ou 'patternProperties'. Se falso, quaisquer propriedades não definidas pelas palavras-chave adjacentes farão com que este esquema falhe.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Uma cadeia de um dos tipos de esquema básicos (número, inteiro, nulo, matriz, objeto, booliano, cadeia) ou uma matriz de cadeias de caracteres especificando um subconjunto desses tipos.",
			"End of file expected.": "Fim do arquivo esperado.",
			"Expected a JSON object, array or literal.": "Esperava-se um objeto JSON, matriz ou literal.",
			"Expected comma": "Vírgula esperada",
			"Expected comma or closing brace": "Esperava-se vírgula ou chave de fechamento",
			"Expected comma or closing bracket": "Esperava-se vírgula ou colchete de fechamento",
			"Failed to sort the JSONC document, please consider opening an issue.": "Falha ao classificar o documento JSONC. Considere abrir um problema.",
			"For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Para matrizes, somente quando os itens são definidos como uma matriz. Se os itens forem um esquema, este esquema valida os itens após aqueles especificados pelo esquema de itens. Se falso, itens adicionais farão com que a validação falhe.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Para matrizes. Pode ser um esquema para validar cada elemento ou uma matriz de esquemas para validar cada item em ordem (o primeiro esquema validará o primeiro elemento, o segundo esquema validará o segundo elemento e assim por diante.",
			"If all of the items in the array must be unique. Defaults to false.": "Se todos os itens na matriz devem ser exclusivos. O padrão é false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Se a instância for um objeto, essa palavra-chave validará se cada nome de propriedade na instância for validado em relação ao esquema fornecido.",
			"Incorrect type. Expected \"{0}\".": "Tipo incorreto. Esperava-se \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Tipo incorreto. Esperava-se um dos {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Indica que o valor da instância é gerenciado exclusivamente pela autoridade proprietária.",
			"Invalid characters in string. Control characters must be escaped.": "Caracteres inválidos na cadeia. Os caracteres de controle devem ter escape.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Formato de cor inválido. Use #RGB, #RGBA, #RRGGBB ou #RRGGBBAA.",
			"Invalid escape character in string.": "Caractere de escape inválido na cadeia.",
			"Invalid number format.": "Formato de número inválido.",
			"Invalid unicode sequence in string.": "Sequência unicode inválida na cadeia de caracteres.",
			"Item does not match any validation rule from the array.": "O item não corresponde a nenhuma regra de validação da matriz.",
			"JSON Language Server": "Servidor de Linguagem JSON",
			"JSON Outline Status": "Status da Estrutura de Tópicos JSON",
			"JSON Validation Status": "Status de Validação JSON",
			"JSON schema cache cleared.": "Cache de esquema JSON limpo.",
			"JSON schema configured": "Esquema JSON configurado",
			"JSON: Schema Resolution Error": "JSON: Erro de Resolução de Esquema",
			"Learn more about JSON schema configuration...": "Saiba mais sobre a configuração do esquema JSON...",
			"Loading JSON info": "Carregando informações JSON",
			"Makes the maximum property exclusive.": "Torna a propriedade máxima exclusiva.",
			"Makes the minimum property exclusive.": "Torna a propriedade mínima exclusiva.",
			"Matches a schema that is not allowed.": "Corresponde a um esquema que não é permitido.",
			"Matches multiple schemas when only one must validate.": "Corresponde a vários esquemas quando apenas um deve ser validado.",
			"Missing property \"{0}\".": "A propriedade \"{0}\" está ausente.",
			"New array": "Nova matriz",
			"New object": "Novo objeto",
			"No schema configured for this file": "Nenhum esquema configurado para este arquivo",
			"No schema validation": "Sem validação de esquema",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Não é usado para validação. Coloque aqui os subesquemas que você deseja referenciar embutidos com $ref.",
			"Object has fewer properties than the required number of {0}": "O objeto tem menos propriedades do que o número necessário de {0}",
			"Object has more properties than limit of {0}.": "O objeto tem mais propriedades do que o limite de {0}.",
			"Object is missing property {0} required by property {1}.": "O objeto não tem a propriedade {0} exigida pela propriedade {1}.",
			"Open Extension": "Extensão Abrir",
			"Open Settings": "Abrir Configurações",
			"Outline": "Estrutura do Código",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Problema ao ler conteúdo de “{0}”: UTF-8 com BOM detectado, somente UTF 8 é permitido.",
			"Problems loading reference '{0}': {1}": "Problemas ao carregar referência “{0}”: {1}",
			"Property expected": "Propriedade esperada",
			"Property keys must be doublequoted": "As chaves de propriedade devem ter aspas duplas",
			"Property {0} is not allowed.": "A propriedade {0} não é permitida.",
			"Reference a definition hosted on any location.": "Referenciar uma definição hospedada em qualquer localização.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Exemplo de valores JSON associados a um esquema específico, com a finalidade de ilustrar o uso.",
			"Schema not found: {0}": "Esquema não encontrado: {0}",
			"Schema validated": "Esquema validado",
			"Select the schema to use for {0}": "Selecione o esquema a ser usado para {0}",
			"Show Schemas": "Mostrar Esquemas",
			"Sort JSON": "Classificar JSON",
			"String does not match the pattern of \"{0}\".": "A cadeia não corresponde ao padrão de \"{0}\".",
			"String is longer than the maximum length of {0}.": "A cadeia de caracteres é maior que o comprimento máximo {0}.",
			"String is not a RFC3339 date-time.": "A cadeia não é uma data/hora RFC3339.",
			"String is not a RFC3339 date.": "A cadeia não é uma data RFC3339.",
			"String is not a RFC3339 time.": "A cadeia não é um horário RFC3339.",
			"String is not a URI: {0}": "A cadeia de caracteres não é um URI: {0}",
			"String is not a hostname.": "A cadeia de caracteres não é um nome do host.",
			"String is not an IPv4 address.": "A cadeia não é um endereço IPv4.",
			"String is not an IPv6 address.": "A cadeia não é um endereço IPv6.",
			"String is not an e-mail address.": "A cadeia não é um endereço de email.",
			"String is shorter than the minimum length of {0}.": "A cadeia é menor que o comprimento mínimo de {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "O subesquema \"else\" é usado para validação quando o subesquema \"if\" falha.",
			"The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "O subesquema \"then\" é usado para validação quando o subesquema \"if\" é bem-sucedido.",
			"The maximum length of a string.": "O comprimento máximo de uma cadeia de caracteres.",
			"The maximum number of items that can be inside an array. Inclusive.": "O número máximo de itens que podem estar dentro de uma matriz. Inclusivo.",
			"The maximum number of properties an object can have. Inclusive.": "O número máximo de propriedades que um objeto pode ter. Inclusivo.",
			"The maximum numerical value, inclusive by default.": "O valor numérico máximo, inclusive por padrão.",
			"The minimum length of a string.": "O comprimento mínimo de uma cadeia.",
			"The minimum number of items that can be inside an array. Inclusive.": "O número mínimo de itens que podem estar dentro de uma matriz. Inclusivo.",
			"The minimum number of properties an object can have. Inclusive.": "O número mínimo de propriedades que um objeto pode ter. Inclusivo.",
			"The minimum numerical value, inclusive by default.": "O valor numérico mínimo, inclusive por padrão.",
			"The schema to verify this document against.": "O esquema para verificar esse documento.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "O esquema usa recursos meta-schema ({0}) que ainda não são compatíveis com o validador.",
			"The set of literal values that are valid.": "O conjunto de valores literais que são válidos.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "O resultado da validação do subesquema \"if\" controla quais das palavras-chave \"then\" ou \"else\" são avaliadas.",
			"Trailing comma": "Vírgula à direita",
			"URI expected.": "URI esperado.",
			"URI is expected.": "O URI é esperado.",
			"URI with a scheme is expected.": "É esperado um URI com um esquema.",
			"Unable to compute used schemas: No document": "Não é possível calcular os esquemas usados: Nenhum documento",
			"Unable to compute used schemas: {0}": "Não é possível calcular os esquemas usados: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Não foi possível carregar o esquema de “{0}”. Nenhum serviço de solicitação de esquema disponível",
			"Unable to load schema from '{0}': No content.": "Não foi possível carregar o esquema de “{0}”: Sem conteúdo.",
			"Unable to load schema from '{0}': {1}.": "Não foi possível carregar o esquema de '{0}': {1}.",
			"Unable to load {0}": "Não é possível carregar {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Não é possível analisar o conteúdo de “{0}”: erro de análise no deslocamento {1}.",
			"Unable to resolve schema. Click to retry.": "Não é possível resolver o esquema. Clique para tentar novamente.",
			"Unexpected end of comment.": "Fim inesperado do comentário.",
			"Unexpected end of number.": "Fim inesperado do número.",
			"Unexpected end of string.": "Fim inesperado da cadeia de caracteres.",
			"Value expected": "Valor esperado",
			"Value is above the exclusive maximum of {0}.": "O valor está acima do máximo exclusivo de {0}.",
			"Value is above the maximum of {0}.": "O valor está acima do máximo de {0}.",
			"Value is below the exclusive minimum of {0}.": "O valor está abaixo do mínimo exclusivo de {0}.",
			"Value is below the minimum of {0}.": "O valor está abaixo do mínimo de {0}.",
			"Value is deprecated": "O valor foi preterido",
			"Value is not accepted. Valid values: {0}.": "Valor não aceito. Valores válidos: {0}.",
			"Value is not divisible by {0}.": "O valor não é divisível por {0}.",
			"Value must be {0}.": "O valor deve ser {0}.",
			"multiple JSON schemas configured": "vários esquemas JSON configurados",
			"no JSON schema configured": "nenhum esquema JSON configurado",
			"only {0} document symbols shown for performance reasons": "apenas {0} símbolos de documento mostrados por motivos de desempenho",
			"{0} is a directory, not a file": "{0} é um diretório, não um arquivo"
		},
		"package": {
			"description": "Fornece suporte de linguagem avançada para arquivos JSON.",
			"displayName": "Recursos de Linguagem JSON",
			"json.clickToRetry": "Clique para tentar novamente.",
			"json.colorDecorators.enable.deprecationMessage": "A configuração `json.colorDecorators.enable` foi preterida em favor de `editor.colorDecorators`.",
			"json.colorDecorators.enable.desc": "Habilita ou desabilita os decoradores de cor",
			"json.command.clearCache": "Limpar Cache do Esquema",
			"json.command.sort": "Classificar Documento",
			"json.enableSchemaDownload.desc": "Quando habilitados, os esquemas JSON podem ser buscados em locais http e https.",
			"json.format.enable.desc": "Habilitar/desabilitar o formatador JSON padrão",
			"json.format.keepLines.desc": "Mantenha todas as novas linhas existentes ao formatar.",
			"json.maxItemsComputed.desc": "O número máximo computado de símbolos de estrutura de tópicos e regiões de dobragem (limitados por motivos de desempenho).",
			"json.maxItemsExceededInformation.desc": "Mostrar uma notificação ao exceder o número máximo de símbolos de estrutura de tópicos e de regiões de dobra.",
			"json.schemaResolutionErrorMessage": "Não é possível resolver o esquema.",
			"json.schemas.desc": "Associar os esquemas aos arquivos JSON no projeto atual.",
			"json.schemas.fileMatch.desc": "Uma matriz de padrões de arquivos para corresponder ao resolver arquivos JSON para esquemas. `*` e '**' podem ser usados como curinga. Padrões de exclusão também podem ser definidos e começam com ''!''. Um arquivo corresponde quando há pelo menos um padrão de correspondência e o último padrão de correspondência não é um padrão de exclusão.",
			"json.schemas.fileMatch.item.desc": "Um padrão de arquivos que pode conter '*' e '**' para fazer a correspondência ao resolver arquivos JSON para esquemas. Ao começar com ''!'', ele define um padrão de exclusão.",
			"json.schemas.schema.desc": "A definição de esquema para a URL fornecida. O esquema precisa ser fornecido apenas para evitar acessos à URL do esquema.",
			"json.schemas.url.desc": "Um URL ou caminho de arquivo absoluto para um esquema. Pode ser um caminho relativo (começando com \"./\") nas configurações do espaço de trabalho e da pasta do espaço de trabalho.",
			"json.tracing.desc": "Rastreia a comunicação entre o VS Code e o servidor de linguagem JSON.",
			"json.validate.enable.desc": "Habilitar/desabilitar a validação JSON."
		}
	}
}