{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Checkout on vscode.dev": "Apri in vscode.dev",
			"Commit Changes": "Esegui il commit delle modifiche",
			"Copy Anyway": "Copia comunque",
			"Copy vscode.dev Link": "Copiare collegamento vscode.dev",
			"Create Fork": "Crea fork",
			"Create GitHub fork": "Crea fork GitHub",
			"Create PR": "Crea richiesta pull",
			"Creating GitHub Pull Request...": "Creazione della richiesta pull GitHub...",
			"Creating first commit": "Creazione del primo commit",
			"Forking \"{0}/{1}\"...": "Creazione del fork per \"{0}/{1}\"...",
			"Learn More": "Altre informazioni",
			"Log level: {0}": "Livello log: {0}",
			"No": "No",
			"No template": "Nessun modello",
			"Open PR": "Apri richiesta pull",
			"Open on GitHub": "Apri in GitHub",
			"Pick a folder to publish to GitHub": "Seleziona una cartella da pubblicare in GitHub",
			"Publish Branch & Copy Link": "Pubblicare il ramo e copiare il collegamento",
			"Publishing to a private GitHub repository": "Pubblicazione in un repository GitHub privato",
			"Publishing to a public GitHub repository": "Pubblicazione in un repository GitHub pubblico",
			"Pull Changes & Copy Link": "Eseguire il pull delle modifiche e copiare il collegamento",
			"Push Commits & Copy Link": "Eseguire il push dei commit e copiare il collegamento",
			"Pushing changes...": "Push delle modifiche...",
			"Select the Pull Request template": "Selezionare il modello di richiesta pull",
			"Select which files should be included in the repository.": "Selezionare i file da includere nel repository.",
			"Successfully published the \"{0}\" repository to GitHub.": "Il repository \"{0}\" è stato pubblicato in GitHub.",
			"The PR \"{0}/{1}#{2}\" was successfully created on GitHub.": "La richiesta pull \"{0}/{1}#{2}\" è stata creata in GitHub.",
			"The current branch has unpublished commits. Would you like to push your commits before copying a link?": "Il ramo corrente ha dei commit non pubblicati. Eseguire il push dei commit prima di copiare un collegamento?",
			"The current branch is not published to the remote. Would you like to publish your branch before copying a link?": "Il ramo corrente non è pubblicato su remoto. Pubblicare il ramo prima di copiare un collegamento?",
			"The current branch is not up to date. Would you like to pull before copying a link?": "Il ramo corrente non è aggiornato. Eseguire il pull prima di copiare un collegamento?",
			"The current file has uncommitted changes. Please commit your changes before copying a link.": "Il file corrente contiene modifiche di cui non è stato eseguito il commit. Eseguire il commit delle modifiche prima di copiare un collegamento.",
			"The fork \"{0}\" was successfully created on GitHub.": "Il fork \"{0}\" è stato creato in GitHub.",
			"Uploading files": "Caricamento dei file",
			"You don't have permissions to push to \"{0}/{1}\" on GitHub. Would you like to create a fork and push to it instead?": "Non si dispone delle autorizzazioni per eseguire il push in \"{0}/{1}\" in GitHub. Creare invece un fork e aggiungervi il push?",
			"Your push to \"{0}/{1}\" was rejected by GitHub because push protection is enabled and one or more secrets were detected.": "Il push in \"{0}/{1}\" è stato rifiutato da GitHub perché la protezione push è abilitata e sono stati rilevati uno o più segreti."
		},
		"package": {
			"config.branchProtection": "Controlla se eseguire query sulle regole di repository per i repository GitHub",
			"config.gitAuthentication": "Controlla se abilitare l'autenticazione GitHub automatica per i comandi GIT all'interno di VS Code.",
			"config.gitProtocol": "Controlla il protocollo usato per clonare un repository GitHub",
			"description": "Funzionalità di GitHub per VS Code",
			"displayName": "GitHub",
			"welcome.publishFolder": "È possibile pubblicare direttamente questa cartella in un repository GitHub. Dopo la pubblicazione, sarà possibile accedere alle funzionalità di controllo del codice sorgente basate su Git e GitHub.\r\n[$(github) Pubblica in GitHub](command:github.publish)",
			"welcome.publishWorkspaceFolder": "È possibile pubblicare direttamente una cartella dell'area di lavoro in un repository GitHub. Dopo la pubblicazione, sarà possibile accedere alle funzionalità di controllo del codice sorgente basate su Git e GitHub.\r\n[$(github) Pubblica in GitHub](command:github.publish)"
		}
	}
}