{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Örnek",
			"Files by Extension": "Uzantıya Göre Dosyalar",
			"Files with Extension": "Şu Uzantıya Sahip Dosyalar",
			"Files with Multiple Extensions": "Birden Çok Uzantısı Olan Dosyalar",
			"Files with Path": "Şu Yoldaki Dosyalar",
			"Files with Siblings by Name": "Ada Göre Eş Öğeleri Olan Dosyalar",
			"Folder by Name (Any Location)": "Ada Göre Klasör (Herhangi Bir Konum)",
			"Folder by Name (Top Level)": "Ada Göre Klasör (Üst Düzey)",
			"Folders with Multiple Names (Top Level)": "Birden Çok Ada Sahip Klasörler (Üst Düzey)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Yolu mutlak yol glob deseniyle eşleşen tüm dosyaları verili tanımlayıcıya sahip dille eşle.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Dosya adı glob deseniyle eşleşen tüm dosyaları verili tanımlayıcıya sahip dille eşle.",
			"Match a folder with a specific name in any location.": "Herhangi bir konumdaki belirli bir ada sahip bir klasörü eşleştir.",
			"Match a top level folder with a specific name.": "Belirli bir ada sahip en üst düzey klasörü eşleştir.",
			"Match all files of a specific file extension.": "Belirli bir dosya uzantısına sahip tüm dosyaları eşleştir.",
			"Match all files with any of the file extensions.": "Dosya uzantılarından herhangi birine sahip tüm dosyaları eşleştir.",
			"Match files that have siblings with the same name but a different extension.": "Aynı ada ancak farklı bir uzantıya sahip eş öğeleri olan dosyaları eşleştir.",
			"Match multiple top level folders.": "Birden çok üst düzey klasörle eşleştir.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Dosya yollarındaki bileşenleri ayırmak için işletim sistemi tarafından kullanılan karakter. '/' olarak diğer adı vardır.",
			"The current opened file": "Açılan dosya",
			"The current opened file relative to ${workspaceFolder}": "${workspaceFolder} klasörüne göre açılan dosya",
			"The current opened file workspace folder name without any slashes (/)": "Geçerli açık dosya çalışma alanı klasör adı, eğik çizgi (/) olmadan",
			"The current opened file's basename": "Açılan dosyanın baseName'i",
			"The current opened file's basename with no file extension": "Açılan dosyanın dosya uzantısı olmadan temel adı",
			"The current opened file's dirname": "Açılan dosyanın dirname'i",
			"The current opened file's dirname relative to ${workspaceFolder}": "Açılan dosyanın ${workspaceFolder} klasörüne göre dirname'i",
			"The current opened file's extension": "Açılan dosyanın uzantısı",
			"The current selected line number in the active file": "Etkin dosyada seçili olan satır numarası",
			"The current selected text in the active file": "Etkin dosyada seçili olan metin",
			"The file extension of the editor (e.g. txt)": "Düzenleyicinin dosya uzantısı (ör. txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Düzenleyicinin dizini veya uzantısı olmadan dosya adı (örn. myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Varsayılan derleme görevinin adı. Tek bir varsayılan derleme görevi yoksa, derleme görevini seçmek için bir hızlı seçme görüntülenir.",
			"The name of the folder opened in VS Code without any slashes (/)": "Eğik çizgiler (/) olmadan VS Code içinde açılan klasörün adı",
			"The nth parent folder name of the editor": "Düzenleyicinin n'inci ana klasör adı",
			"The parent folder name of the editor (e.g. myFileFolder)": "Düzenleyicinin ana klasör adı (örn. myFileFolder)",
			"The path of the folder opened in VS Code": "VS Code içinde açılan klasörün yolu",
			"The path where an extension is installed.": "Uzantının yüklendiği yol.",
			"The task runner's current working directory on startup": "Görev çalıştırıcısının başlangıçtaki geçerli çalışma dizini",
			"Use the language of the currently active text editor if any": "Varsa şu anda etkin olan metin düzenleyicisinin dilini kullan",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "yalnızca değerler içeren değişkenlerle çevrelendiğinde görünen bir koşullu ayırıcı ('-')",
			"an indicator for when the active editor has unsaved changes": "etkin düzenleyicide kaydedilmemiş değişiklikler olduğunda kullanılacak gösterge",
			"e.g. SSH": "örneğin SSH",
			"e.g. VS Code": "örneğin VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "çalışma alanının dosya yolu (örneğin, /Users/Development/calismaAlanim)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "dosyanın bulunduğu çalışma alanı klasörünün yolu (örneğin, /Users/Development/klasorum)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "dosyanın bulunduğu çalışma alanı klasörünün adı (örneğin klasorum)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "isteğe bağlı uzak ad ve varsa çalışma alanı göstergesine sahip çalışma alanının adı (ör. myFolder, myRemoteFolder [SSH] veya myWorkspace (Çalışma Alanı))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "çalışma alanının son ekler olmadan kısaltılmış adı (ör. myFolder veya myWorkspace)",
			"the file name (e.g. myFile.txt)": "dosya adı (örneğin dosyam.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "dosyanın tam yolu (ör. /Users/Development/klasorum/dosyaKlasorum/dosyam.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "dosyanın bulunduğu klasörün tam yolu (ör. /Users/Development/klasorum/dosyaKlasorum)",
			"the name of the active branch in the active repository (e.g. main)": "etkin depodaki etkin dalın adı (ör. ana)",
			"the name of the active repository (e.g. vscode)": "etkin deponun adı (ör. vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "dosyanın bulunduğu klasörün adı (ör. klasorum)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "dosyanın çalışma alanı klasörüyle ilişkili yolu (ör. klasorum/dosyaKlasorum/dosyam.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "dosyanın bulunduğu klasörün, çalışma alanı klasörüne göre yolu (ör. klasorum/dosyaKlasorum)"
		},
		"package": {
			"description": "Yapılandırma dosyalarında ayarlar, başlatma ve uzantı öneri dosyaları gibi olanaklar (gelişmiş IntelliSense, otomatik düzeltme) sağlar.",
			"displayName": "Düzenleme Yapılandırması"
		}
	}
}