{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"guarda\" una prueba booleana para su evaluación posterior en una restricción o if().",
			"'from' expected": "se esperaba \"from\"",
			"'in' expected": "Se esperaba \"in\"",
			"'through' or 'to' expected": "se esperaba \"through\" o \"to\"",
			"'{0}'": "'{0}'",
			"( expected": "Se esperaba (",
			") expected": "Se esperaba )",
			"<undefined>": "<undefined>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "La regla @font-face debe definir las propiedades \"src\" y \"font-family\"",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Lista de propiedades que no se validan con la regla \"unknownProperties\".",
			"Adds quotes to a string.": "Agrega comillas a una cadena.",
			"Also define the standard property '{0}' for compatibility": "Define también la propiedad estándar \"{0}\" por compatibilidad",
			"Always define standard rule '@keyframes' when defining keyframes.": "Defina siempre la regla estándar \"@keyframes\" al definir fotogramas clave.",
			"Always include all vendor specific properties: Missing: {0}": "Incluir siempre todas las propiedades específicas del proveedor. Falta: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Incluir siempre todas las reglas específicas del proveedor: falta: {0}",
			"Appends a single value onto the end of a list.": "Anexa un único valor al final de una lista.",
			"Appends selectors to one another without spaces in between.": "Anexa selectores entre sí sin espacios entre sí.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Evite usar \"!important\". Es una indicación de que la especificidad de todo el CSS se ha salido de control y debe ser refactorizada.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Le recomendamos no usar \"float\". Los valores float producen CSS vulnerables que pueden dañarse fácilmente si se cambia cualquier aspecto del diseño.",
			"CSS Language Server": "Servidor de lenguaje CSS",
			"CSS fix is outdated and can't be applied to the document.": "La corrección CSS está obsoleta y no se puede aplicar al documento.",
			"Causes one or more rules to be emitted at the root of the document.": "Hace que se emitan una o varias reglas en la raíz del documento.",
			"Changes one or more properties of a color.": "Cambia una o varias propiedades de un color.",
			"Changes the alpha component for a color.": "Cambia el componente alfa de un color.",
			"Changes the hue of a color.": "Cambia el matiz de un color.",
			"Combines several lists into a single multidimensional list.": "Combina varias listas en una sola lista multidimensional.",
			"Converts a color into the format understood by IE filters.": "Convierte un color en el formato entendido por los filtros IE.",
			"Converts a color to grayscale.": "Convierte un color en escala de grises.",
			"Converts a string to lower case.": "Convierte una cadena en minúsculas.",
			"Converts a string to upper case.": "Convierte una cadena en mayúsculas.",
			"Converts a unitless number to a percentage.": "Convierte un número sin unidad en un porcentaje.",
			"Creates a Color from hue, saturation, and lightness values.": "Crea un color a partir de valores de matiz, saturación y claridad.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Crea un color a partir de valores de matiz, saturación, claridad y alfa.",
			"Creates a Color from hue, white, and black values.": "Crea un color a partir de valores de matiz, blanco y negro.",
			"Creates a Color from lightness, a, and b values.": "Crea un color a partir de los valores de luminosidad, a y b.",
			"Creates a Color from lightness, chroma, and hue values.": "Crea un color a partir de los valores de luminosidad, croma y tono.",
			"Creates a Color from red, green, and blue values.": "Crea un color a partir de los valores rojo, verde y azul.",
			"Creates a Color from red, green, blue, and alpha values.": "Crea un color a partir de valores rojos, verdes, azules y alfa.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Crea un color a partir de los valores de matiz, saturación y luminosidad de otro color.",
			"Creates a Color from the hue, white, and black values of another Color.": "Crea un color a partir de los valores de matiz, blanco y negro de otro color.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Crea un color a partir de los valores de luminosidad, a y b de otro color.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Crea un color a partir de los valores de luminosidad, tono y matiz de otro color.",
			"Creates a Color from the red, green, and blue values of another Color.": "Crea un color a partir de los valores rojo, verde y azul de otro color.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Crea un color en un espacio de color específico a partir de los valores rojo, verde y azul.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Crea un color en un espacio de color específico a partir de los valores rojo, verde y azul de otro color.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Define operaciones complejas que se pueden volver a usar en hojas de estilos.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Define estilos que se pueden volver a usar en toda la hoja de estilos con \"@include\".",
			"Do not use duplicate style definitions": "No use definiciones de estilo duplicadas",
			"Do not use empty rulesets": "No usar conjuntos de reglas vacíos",
			"Do not use width or height when using padding or border": "No use el ancho ni la altura al emplear el relleno o el borde.",
			"Dynamically calls a Sass function.": "Llama dinámicamente a una función SASS.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Cada bucle que establece \"$var\" en cada elemento de la lista o asignación y, a continuación, genera los estilos que contiene con ese valor de \"$var\".",
			"Exposes the details of Sass’s inner workings.": "Expone los detalles del funcionamiento interno de Sass.",
			"Extends $extendee with $extender within $selector.": "Extiende $extendee con $extender dentro de $selector.",
			"Extracts a substring from $string.": "Extrae una subcadena de $string.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "No se pudo aplicar la corrección CSS al documento. Considere la posibilidad de abrir una incidencia con los pasos a reproducir.",
			"Finds the maximum of several numbers.": "Busca el máximo de varios números.",
			"Finds the minimum of several numbers.": "Busca el mínimo de varios números.",
			"Fluidly scales one or more properties of a color.": "Escala de forma fluida una o varias propiedades de un color.",
			"Folding Region End": "Fin de la región plegable",
			"Folding Region Start": "Inicio de la región plegable",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Bucle For que genera repetidamente un conjunto de estilos para cada \"$var\" en la cláusula \"from/through\" o \"from/to\".",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Genera nuevos colores basados en los existentes, lo que facilita la creación de temas de color.",
			"Gets the blue component of a color.": "Obtiene el componente azul de un color.",
			"Gets the green component of a color.": "Obtiene el componente verde de un color.",
			"Gets the hue component of a color.": "Obtiene el componente de matiz de un color.",
			"Gets the lightness component of a color.": "Obtiene el componente de claridad de un color.",
			"Gets the opacity component of a color.": "Obtiene el componente de opacidad de un color.",
			"Gets the red component of a color.": "Obtiene el componente rojo de un color.",
			"Gets the saturation component of a color.": "Obtiene el componente de saturación de un color.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Los colores hexadecimales deben constar de tres, cuatro, seis u ocho números hexadecimales",
			"IE hacks are only necessary when supporting IE7 and older": "Las modificaciones de IE solo son necesarias cuando se admite IE7 y versiones anteriores.",
			"Import statements do not load in parallel": "Las instrucciones Import no se cargan en paralelo.",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Incluye el cuerpo si la expresión no se evalúa como \"false\" o \"null\".",
			"Includes the styles defined by another mixin into the current rule.": "Incluye los estilos definidos por otra combinación en la regla actual.",
			"Increases or decreases one or more components of a color.": "Aumenta o disminuye uno o varios componentes de un color.",
			"Inherits the styles of another selector.": "Hereda los estilos de otro selector.",
			"Insert url() Function": "Insertar función url()",
			"Insert url() Functions": "Insertar funciones url()",
			"Inserts $insert into $string at $index.": "Inserta $insert en $string en $index.",
			"Invalid number of parameters": "Número de parámetros incorrecto",
			"Joins together two lists into one.": "Combina dos listas en una.",
			"Lets you access and modify values in lists.": "Permite acceder a los valores de las listas y modificarlos.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Carga una hoja de estilos Sass y hace que sus mixins, funciones y variables estén disponibles cuando esta hoja de estilos se cargue con la regla de @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Carga mixins, funciones y variables de otras hojas de estilos SASS como \"módulos\" y combina CSS de varias hojas de estilos a la vez.",
			"Makes a color darker.": "Hace que un color sea más oscuro.",
			"Makes a color less saturated.": "Hace que un color esté menos saturado.",
			"Makes a color lighter.": "Hace que un color sea más claro.",
			"Makes a color more opaque.": "Hace que un color sea más opaco.",
			"Makes a color more saturated.": "Hace que un color esté más saturado.",
			"Makes a color more transparent.": "Hace que un color sea más transparente.",
			"Makes it easy to combine, search, or split apart strings.": "Facilita la combinación, búsqueda o división de cadenas.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Permite buscar el valor asociado a una clave en una asignación y mucho más.",
			"Merges two maps together into a new map.": "Combina dos mapas en un mapa nuevo.",
			"Mix two colors together in a polar color space.": "Combinar dos colores en un espacio de colores polares.",
			"Mix two colors together in a rectangular color space.": "Combina dos colores en un espacio de colores rectangular.",
			"Mixes two colors together.": "Combina dos colores.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Anida el selector debajo de otro como si estuviera anidado en una hoja de estilos.",
			"No unit for zero needed": "No se necesita ninguna unidad para cero",
			"Parses a selector into the format returned by &.": "Analiza un selector en el formato devuelto por &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Imprime el valor de una expresión en el flujo de salida de error estándar. Resulta útil para depurar archivos Sass complicados.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Imprime el valor de una expresión en el flujo de salida de error estándar. Es útil para bibliotecas que necesitan advertir a los usuarios sobre software en desuso o recuperarse de errores leves de uso de mixin. Las advertencias se pueden desactivar con la opción de línea de comandos \"--quiet\" o la opción de Sass \":quiet\".",
			"Property is ignored due to the display.": "La propiedad se omite debido a la pantalla.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "La propiedad se omite debido a la pantalla. Con \"display: block\", no se debe usar la alineación vertical.",
			"Provides access to Sass’s powerful selector engine.": "Proporciona acceso al eficaz motor de selector de Sass.",
			"Provides functions that operate on numbers.": "Proporciona funciones que funcionan en números.",
			"Removes quotes from a string.": "Quita comillas de una cadena.",
			"Rename to '{0}'": "Cambiar el nombre a \"{0}\"",
			"Replaces $original with $replacement within $selector.": "Reemplaza $original por $replacement en $selector.",
			"Replaces the nth item in a list.": "Reemplaza el elemento nth de una lista.",
			"Returns a list of all keys in a map.": "Devuelve una lista de todas las claves de una asignación.",
			"Returns a list of all values in a map.": "Devuelve una lista de todos los valores de una asignación.",
			"Returns a new map with keys removed.": "Devuelve una nueva asignación con claves quitadas.",
			"Returns a random number.": "Devuelve un número aleatorio.",
			"Returns a specific item in a list.": "Devuelve un elemento específico de una lista.",
			"Returns the absolute value of a number.": "Devuelve el valor absoluto de un número.",
			"Returns the complement of a color.": "Devuelve el complemento de un color.",
			"Returns the index of the first occurance of $substring in $string.": "Devuelve el índice de la primera instancia de $substring en $string.",
			"Returns the inverse of a color.": "Devuelve el inverso de un color.",
			"Returns the keywords passed to a function that takes variable arguments.": "Devuelve las palabras clave pasadas a una función que toma argumentos de variable.",
			"Returns the length of a list.": "Devuelve la longitud de una lista.",
			"Returns the number of characters in a string.": "Devuelve el número de caracteres de una cadena.",
			"Returns the position of a value within a list.": "Devuelve la posición de un valor dentro de una lista.",
			"Returns the separator of a list.": "Devuelve el separador de una lista.",
			"Returns the simple selectors that comprise a compound selector.": "Devuelve los selectores simples que componen un selector compuesto.",
			"Returns the string representation of a value as it would be represented in Sass.": "Devuelve la representación de cadena de un valor tal como se representaría en Sass.",
			"Returns the type of a value.": "Devuelve el tipo de un valor.",
			"Returns the unit(s) associated with a number.": "Devuelve las unidades asociadas a un número.",
			"Returns the value in a map associated with a given key.": "Devuelve el valor de un mapa asociado a una clave determinada.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Devuelve la respuesta a si $super coincide con todos los elementos $sub y, posiblemente, con más.",
			"Returns whether a feature exists in the current Sass runtime.": "Devuelve si existe una característica en el tiempo de ejecución de SASS actual.",
			"Returns whether a function with the given name exists.": "Devuelve si existe una función con el nombre especificado.",
			"Returns whether a map has a value associated with a given key.": "Devuelve si una asignación tiene un valor asociado a una clave determinada.",
			"Returns whether a mixin with the given name exists.": "Devuelve si existe un mixin con el nombre especificado.",
			"Returns whether a number has units.": "Devuelve si un número tiene unidades.",
			"Returns whether a variable with the given name exists in the current scope.": "Devuelve si existe una variable con el nombre especificado en el ámbito actual.",
			"Returns whether a variable with the given name exists in the global scope.": "Devuelve si existe una variable con el nombre especificado en el ámbito global.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Devuelve si se pueden sumar, restar o comparar dos números.",
			"Rounds a number down to the previous whole number.": "Redondea un número hacia abajo hasta el número entero anterior.",
			"Rounds a number to the nearest whole number.": "Redondea un número al número entero más cercano.",
			"Rounds a number up to the next whole number.": "Redondea un número al siguiente número entero.",
			"Sass documentation": "Documentación de Sass",
			"Selector Specificity": "Especificidad del selector",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Los selectores no deben contener identificadores porque estas reglas están estrechamente ligadas a HTML.",
			"The universal selector (*) is known to be slow": "Se sabe que el selector universal \"*\" es lento.",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Inicia el valor de una expresión como un error irrecuperable con el seguimiento de la pila. Es útil para validar argumentos en mixins y funciones.",
			"URI expected": "Se esperaba el URI",
			"URL encodes a string": "La dirección URL codifica una cadena",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Unifica dos selectores para generar un selector que coincida con los elementos coincidentes con ambos.",
			"Unknown at-rule.": "Regla At desconocida.",
			"Unknown property.": "Propiedad desconocida.",
			"Unknown property: '{0}'": "Propiedad desconocida: \"{0}\"",
			"Unknown vendor specific property.": "Propiedad específica del proveedor desconocida.",
			"When using a vendor-specific prefix also include the standard property": "Cuando use un prefijo específico del proveedor, incluya también la propiedad estándar.",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Cuando use un prefijo específico del proveedor, compruebe que también haya incluido el resto de las propiedades específicas del proveedor.",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Bucle While que toma una expresión y genera repetidamente los estilos anidados hasta que la instrucción se evalúa como \"false\".",
			"[ expected": "Se esperaba [",
			"] expected": "se esperaba ]",
			"absolute value of a number": "valor absoluto de un número",
			"arccosine - inverse of cosine function": "arcocoseno: inverso de la función de coseno",
			"arcsine - inverse of sine function": "arcoseno: inverso de la función de seno",
			"arctangent - inverse of tangent function": "arcotangente: inversa de la función tangente",
			"argument from '{0}'": "argumento de \"{0}\"",
			"at-rule or selector expected": "se esperaba un selector o una regla en la regla",
			"at-rule unknown": "at-rule desconocida",
			"bind the evaluation of a ruleset to each member of a list.": "enlaza la evaluación de un conjunto de reglas a cada miembro de una lista.",
			"calculates square root of a number": "calcula la raíz cuadrada de un número",
			"colon expected": "Se esperaban dos puntos",
			"comma expected": "se esperaba una coma",
			"condition expected": "condición esperada",
			"converts numbers from one type into another": "convierte números de un tipo a otro",
			"converts to a %, e.g. 0.5 > 50%": "se convierte en %, por ejemplo, 0,5 > 50 %",
			"cosine function": "función de coseno",
			"creates a #AARRGGBB": "crea un #AARRGGBB",
			"creates a color": "crea un color",
			"dot expected": "se esperaba un punto",
			"escape string content": "contenido de cadena de escape",
			"expression expected": "se esperaba una expresión",
			"first argument modulus second argument": "primer argumento módulo segundo argumento",
			"first argument raised to the power of the second argument": "primer argumento elevado a la potencia del segundo argumento",
			"generate a list spanning a range of values": "generar una lista que abarque un rango de valores",
			"identifier expected": "se esperaba un identificador",
			"identifier or variable expected": "se esperaba un identificador o una variable",
			"identifier or wildcard expected": "se esperaba un identificador o un carácter comodín",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "\"inline-block\" se omite debido al float. Si \"float\" tiene un valor distinto de \"none\", el cuadro es floated y \"display\" se trata como \"block\"",
			"inlines a resource and falls back to `url()`": "coloca en línea un recurso y vuelve a \"url()\"",
			"media query expected": "se esperaba una consulta multimedia",
			"number expected": "se esperaba un número",
			"operator expected": "se esperaba un operador",
			"page directive or declaraton expected": "se esperaba una directiva de página o una declaración",
			"parses a string to a color": "analiza una cadena en un color",
			"percentage expected": "porcentaje esperado",
			"property value expected": "se esperaba un valor de propiedad",
			"remove or change the unit of a dimension": "quita o cambia la unidad de una dimensión",
			"return `@color` 10% points darker": "devuelve \"@color\" con un 10 % de puntos más oscuros",
			"return `@color` 10% points less saturated": "devuelve \"@color\" con un 10 % menos de puntos de saturación",
			"return `@color` 10% points less transparent": "devuelve \"@color\" con un 10 % de puntos menos transparentes",
			"return `@color` 10% points lighter": "devuelve \"@color\" con un 10 % más de puntos de luminosidad",
			"return `@color` 10% points more saturated": "devuelve \"@color\" con un 10 % más de puntos de saturación",
			"return `@color` 10% points more transparent": "devuelve \"@color\" con un 10 % más de puntos de transparencia",
			"return `@color` with 50% transparency": "devuelve \"@color\" con transparencia del 50 %",
			"return `@color` with a 10 degree larger in hue": "devuelve \"@color\" con un matiz mayor de 10 grados",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "devuelve \"@darkcolor\" si \"@color1 is> 43% luma\"; de lo contrario, devuelve \"@lightcolor\". Consulte las notas",
			"return a mix of `@color1` and `@color2`": "devuelve una combinación de \"@color1\" y \"@color2\"",
			"returns a grey, 100% desaturated color": "devuelve un color gris, 100 % desaturado",
			"returns a value at the specified position in the list": "devuelve un valor en la posición especificada de la lista",
			"returns one of two values depending on a condition.": "devuelve uno de los dos valores en función de una condición.",
			"returns pi": "devuelve PI",
			"returns the `alpha` channel of `@color`": "devuelve el canal \"alfa\" de \"@color\"",
			"returns the `blue` channel of `@color`": "devuelve el canal \"blue\" de \"@color\"",
			"returns the `green` channel of `@color`": "devuelve el canal \"verde\" de \"@color\"",
			"returns the `hue` channel of `@color` in the HSL space": "devuelve el canal \"hue\" de \"@color\" en el espacio HSL.",
			"returns the `hue` channel of `@color` in the HSV space": "devuelve el canal \"matiz\" de \"@color\" en el espacio HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "devuelve el canal \"lightness\" de \"@color\" en el espacio HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "devuelve el valor \"luma\" (brillo perceptual) de \"@color\"",
			"returns the `red` channel of `@color`": "devuelve el canal \"rojo\" de \"@color\"",
			"returns the `saturation` channel of `@color` in the HSL space": "devuelve el canal \"saturación\" de \"@color\" en el espacio HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "devuelve el canal \"saturación\" de \"@color\" en el espacio HSV",
			"returns the `value` channel of `@color` in the HSV space": "devuelve el canal \"value\" de \"@color\" en el espacio HSV",
			"returns the lowest of one or more values": "devuelve el valor más bajo de uno o más valores",
			"returns the number of elements in a value list": "devuelve el número de elementos de una lista de valores",
			"rounds a number to a number of places": "redondea un número a un número de lugares decimales",
			"rounds down to an integer": "redondea a un entero",
			"rounds up to an integer": "redondea a un entero",
			"selector expected": "se esperaba un selector",
			"semi-colon expected": "se esperaba punto y coma",
			"sine function": "función seno",
			"string literal expected": "se esperaba un literal de cadena",
			"string replace": "reemplazo de cadena",
			"tangent function": "función tangente",
			"term expected": "término esperado",
			"unknown keyword": "palabra clave desconocida",
			"uri or string expected": "Se esperaba un URI o una cadena",
			"variable name expected": "se espera un nombre de variable",
			"variable value expected": "se esperaba un valor de variable",
			"whitespace expected": "se esperaba un espacio en blanco",
			"wildcard expected": "se esperaba un carácter comodín",
			"{ expected": "se esperaba {",
			"{0}, '{1}'": "{0}, \"{1}\"",
			"} expected": "se esperaba }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "El valor \"css.colorDecorators.enable\" está en desuso en favor de \"editor.colorDecorators\".",
			"css.completion.completePropertyWithSemicolon.desc": "Inserta punto y coma al final de la línea al completar las propiedades CSS.",
			"css.completion.triggerPropertyValueCompletion.desc": "De forma predeterminada, VS Code desencadena la finalización de valores de propiedad tras seleccionar una propiedad CSS. Use esta opción para deshabilitar este comportamiento.",
			"css.customData.desc": "Una lista de rutas de archivo relativas que apuntan a archivos JSON siguiendo el [formato de datos personalizados](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code carga datos personalizados al inicio para mejorar la compatibilidad de CSS con las propiedades personalizadas (variables), las reglas, las pseudoclases y los pseudoelementos que especifique en los archivos JSON.\r\n\r\nLas rutas de los archivos son relativas al área de trabajo y solo se consideran las configuraciones de la carpeta del espacio de trabajo.",
			"css.format.braceStyle.desc": "Ponga llaves en la misma línea que las reglas ('collapse') o coloque llaves en su propia línea ('expand').",
			"css.format.enable.desc": "Habilita o deshabilita el formateador CSS predeterminado.",
			"css.format.maxPreserveNewLines.desc": "Número máximo de saltos de línea que se conservarán en un fragmento cuando `#css.format.preserveNewLines#` esté habilitado.",
			"css.format.newlineBetweenRules.desc": "Separe los conjuntos de reglas con una línea en blanco.",
			"css.format.newlineBetweenSelectors.desc": "Separa los selectores con una nueva línea.",
			"css.format.preserveNewLines.desc": "Indica si se deben conservar los saltos de línea existentes antes de los elementos.",
			"css.format.spaceAroundSelectorSeparator.desc": "Asegúrate de que haya un carácter de espacio alrededor de los separadores de selector '>', '+', '~' (por ejemplo, 'a > b').",
			"css.hover.documentation": "Muestra la documentación de propiedades y valores en los desplazamientos de CSS.",
			"css.hover.references": "Mostrar las referencias a MDN mediante movimientos del puntero de CSS.",
			"css.lint.argumentsInColorFunction.desc": "Número de parámetros incorrecto.",
			"css.lint.boxModel.desc": "No use \"width\" o \"height\" al usar \"padding\" o \"border\".",
			"css.lint.compatibleVendorPrefixes.desc": "Cuando use un prefijo específico del proveedor, compruebe que también haya incluido el resto de propiedades específicas del proveedor.",
			"css.lint.duplicateProperties.desc": "No use definiciones de estilo duplicadas.",
			"css.lint.emptyRules.desc": "No use conjuntos de reglas vacíos.",
			"css.lint.float.desc": "Le recomendamos no usar \"float\". Los valores float producen CSS frágiles que pueden dañarse fácilmente si cambia cualquier aspecto del diseño.",
			"css.lint.fontFaceProperties.desc": "La regla \"@font-face\" debe definir las propiedades \"src\" y \"font-family\".",
			"css.lint.hexColorLength.desc": "Los colores hexadecimales deben constar de 3, 4, 6 u 8 números hexadecimales.",
			"css.lint.idSelector.desc": "Los selectores no deben contener identificadores porque estas reglas están estrechamente ligadas a HTML.",
			"css.lint.ieHack.desc": "Las modificaciones de IE solo son necesarias cuando se admite IE7 y versiones anteriores.",
			"css.lint.importStatement.desc": "Las instrucciones Import no se cargan en paralelo.",
			"css.lint.important.desc": "Evite usar `!important`. Es una indicación que la especificidad de todo el CSS se ha salido de control y debe ser refactorizada.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "La propiedad se ignora a causa de la pantalla. Por ejemplo, con \"display: inline\", las propiedades \"width\", \"height\", \"margin-top\", \"margin-bottom\" y \"float\" no tienen ningún efecto.",
			"css.lint.universalSelector.desc": "Se sabe que el selector universal (\"*\") es lento.",
			"css.lint.unknownAtRules.desc": "Regla At desconocida.",
			"css.lint.unknownProperties.desc": "Propiedad desconocida.",
			"css.lint.unknownVendorSpecificProperties.desc": "Propiedad específica del proveedor desconocida.",
			"css.lint.validProperties.desc": "Lista de propiedades que no se validan con la regla \"unknownProperties\".",
			"css.lint.vendorPrefix.desc": "Cuando use un prefijo específico del proveedor, incluya también la propiedad estándar.",
			"css.lint.zeroUnits.desc": "No se necesita una unidad para cero.",
			"css.title": "CSS",
			"css.trace.server.desc": "Hace un seguimiento de la comunicación entre VSCode y el servidor de lenguaje CSS.",
			"css.validate.desc": "Habilita o deshabilita todas las validaciones.",
			"css.validate.title": "Controla la validación de CSS y la gravedad de los problemas.",
			"description": "Proporciona un potente soporte de lenguaje para archivos CSS, LESS y SCSS.",
			"displayName": "Características del lenguaje CSS",
			"less.colorDecorators.enable.deprecationMessage": "El valor \"less.colorDecorators.enable\" está en desuso en favor de \"editor.colorDecorators\".",
			"less.completion.completePropertyWithSemicolon.desc": "Inserta punto y coma al final de la línea al completar las propiedades CSS.",
			"less.completion.triggerPropertyValueCompletion.desc": "De forma predeterminada, VS Code desencadena la finalización de valores de propiedad tras seleccionar una propiedad CSS. Use esta opción para deshabilitar este comportamiento.",
			"less.format.braceStyle.desc": "Ponga llaves en la misma línea que las reglas ('collapse') o coloque llaves en su propia línea ('expand').",
			"less.format.enable.desc": "Habilite o deshabilite el formateador LESS predeterminado.",
			"less.format.maxPreserveNewLines.desc": "Número máximo de saltos de línea que se conservarán en un fragmento cuando `#less.format.preserveNewLines#` esté habilitado.",
			"less.format.newlineBetweenRules.desc": "Separa los conjuntos de reglas con una línea en blanco.",
			"less.format.newlineBetweenSelectors.desc": "Separa los selectores con una nueva línea.",
			"less.format.preserveNewLines.desc": "Indica si se deben conservar los saltos de línea existentes antes de los elementos.",
			"less.format.spaceAroundSelectorSeparator.desc": "Asegúrate de que haya un carácter de espacio alrededor de los separadores de selector '>', '+', '~' (por ejemplo, 'a > b').",
			"less.hover.documentation": "Muestra la documentación de propiedades y valores en los desplazamientos de LESS.",
			"less.hover.references": "Mostrar las referencias a MDN mediante movimientos del puntero de LESS.",
			"less.lint.argumentsInColorFunction.desc": "Número de parámetros incorrecto.",
			"less.lint.boxModel.desc": "No use \"width\" o \"height\" al usar \"padding\" o \"border\".",
			"less.lint.compatibleVendorPrefixes.desc": "Cuando use un prefijo específico del proveedor, compruebe que también haya incluido el resto de propiedades específicas del proveedor.",
			"less.lint.duplicateProperties.desc": "No use definiciones de estilo duplicadas.",
			"less.lint.emptyRules.desc": "No use conjuntos de reglas vacíos.",
			"less.lint.float.desc": "Le recomendamos no usar \"float\". Los valores float producen CSS frágiles que pueden dañarse fácilmente si cambia cualquier aspecto del diseño.",
			"less.lint.fontFaceProperties.desc": "La regla \"@font-face\" debe definir las propiedades \"src\" y \"font-family\".",
			"less.lint.hexColorLength.desc": "Los colores hexadecimales deben constar de 3, 4, 6 u 8 números hexadecimales.",
			"less.lint.idSelector.desc": "Los selectores no deben contener identificadores porque estas reglas están estrechamente ligadas a HTML.",
			"less.lint.ieHack.desc": "Las modificaciones de IE solo son necesarias cuando se admite IE7 y versiones anteriores.",
			"less.lint.importStatement.desc": "Las instrucciones Import no se cargan en paralelo.",
			"less.lint.important.desc": "Evite usar `!important`. Es una indicación que la especificidad de todo el CSS se ha salido de control y debe ser refactorizada.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "La propiedad se ignora a causa de la pantalla. Por ejemplo, con \"display: inline\", las propiedades \"width\", \"height\", \"margin-top\", \"margin-bottom\" y \"float\" no tienen ningún efecto.",
			"less.lint.universalSelector.desc": "Se sabe que el selector universal (\"*\") es lento.",
			"less.lint.unknownAtRules.desc": "Regla At desconocida.",
			"less.lint.unknownProperties.desc": "Propiedad desconocida.",
			"less.lint.unknownVendorSpecificProperties.desc": "Propiedad específica del proveedor desconocida.",
			"less.lint.validProperties.desc": "Lista de propiedades que no se validan con la regla \"unknownProperties\".",
			"less.lint.vendorPrefix.desc": "Cuando use un prefijo específico del proveedor, incluya también la propiedad estándar.",
			"less.lint.zeroUnits.desc": "No se necesita una unidad para cero.",
			"less.title": "LESS",
			"less.validate.desc": "Habilita o deshabilita todas las validaciones.",
			"less.validate.title": "Controla la validación de LESS y la gravedad de los problemas.",
			"scss.colorDecorators.enable.deprecationMessage": "El valor \"scss.colorDecorators.enable\" está en desuso en favor de \"editor.colorDecorators\".",
			"scss.completion.completePropertyWithSemicolon.desc": "Inserta punto y coma al final de la línea al completar las propiedades CSS.",
			"scss.completion.triggerPropertyValueCompletion.desc": "De forma predeterminada, VS Code desencadena la finalización de valores de propiedad tras seleccionar una propiedad CSS. Use esta opción para deshabilitar este comportamiento.",
			"scss.format.braceStyle.desc": "Ponga llaves en la misma línea que las reglas ('collapse') o coloque llaves en su propia línea ('expand').",
			"scss.format.enable.desc": "Habilita o deshabilita el formateador SCSS predeterminado.",
			"scss.format.maxPreserveNewLines.desc": "Número máximo de saltos de línea que se conservarán en un fragmento cuando `#scss.format.preserveNewLines#` esté habilitado.",
			"scss.format.newlineBetweenRules.desc": "Separa los conjuntos de reglas con una línea en blanco.",
			"scss.format.newlineBetweenSelectors.desc": "Separa los selectores con una nueva línea.",
			"scss.format.preserveNewLines.desc": "Indica si se deben conservar los saltos de línea existentes antes de los elementos.",
			"scss.format.spaceAroundSelectorSeparator.desc": "Asegúrate de que haya un carácter de espacio alrededor de los separadores de selector '>', '+', '~' (por ejemplo, 'a > b').",
			"scss.hover.documentation": "Muestra la documentación de propiedades y valores en los desplazamientos de SCSS.",
			"scss.hover.references": "Mostrar las referencias a MDN mediante movimientos del puntero de SCSS.",
			"scss.lint.argumentsInColorFunction.desc": "Número de parámetros incorrecto.",
			"scss.lint.boxModel.desc": "No use \"width\" o \"height\" al usar \"padding\" o \"border\".",
			"scss.lint.compatibleVendorPrefixes.desc": "Cuando use un prefijo específico del proveedor, compruebe que también haya incluido el resto de propiedades específicas del proveedor.",
			"scss.lint.duplicateProperties.desc": "No use definiciones de estilo duplicadas.",
			"scss.lint.emptyRules.desc": "No use conjuntos de reglas vacíos.",
			"scss.lint.float.desc": "Le recomendamos no usar \"float\". Los valores float producen CSS frágiles que pueden dañarse fácilmente si cambia cualquier aspecto del diseño.",
			"scss.lint.fontFaceProperties.desc": "La regla \"@font-face\" debe definir las propiedades \"src\" y \"font-family\".",
			"scss.lint.hexColorLength.desc": "Los colores hexadecimales deben constar de 3, 4, 6 u 8 números hexadecimales.",
			"scss.lint.idSelector.desc": "Los selectores no deben contener identificadores porque estas reglas están estrechamente ligadas a HTML.",
			"scss.lint.ieHack.desc": "Las modificaciones de IE solo son necesarias cuando se admite IE7 y versiones anteriores.",
			"scss.lint.importStatement.desc": "Las instrucciones Import no se cargan en paralelo.",
			"scss.lint.important.desc": "Evite usar `!important`. Es una indicación que la especificidad de todo el CSS se ha salido de control y debe ser refactorizada.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "La propiedad se ignora a causa de la pantalla. Por ejemplo, con \"display: inline\", las propiedades \"width\", \"height\", \"margin-top\", \"margin-bottom\" y \"float\" no tienen ningún efecto.",
			"scss.lint.universalSelector.desc": "Se sabe que el selector universal (\"*\") es lento.",
			"scss.lint.unknownAtRules.desc": "Regla de entrada desconocida.",
			"scss.lint.unknownProperties.desc": "Propiedad desconocida.",
			"scss.lint.unknownVendorSpecificProperties.desc": "Propiedad específica del proveedor desconocida.",
			"scss.lint.validProperties.desc": "Lista de propiedades que no se validan con la regla \"unknownProperties\".",
			"scss.lint.vendorPrefix.desc": "Cuando use un prefijo específico del proveedor, incluya también la propiedad estándar.",
			"scss.lint.zeroUnits.desc": "No se necesita una unidad para cero.",
			"scss.title": "SCSS (Sass)",
			"scss.validate.desc": "Habilita o deshabilita todas las validaciones.",
			"scss.validate.title": "Controla la validación de SCSS y la gravedad de los problemas."
		}
	}
}