{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Checkout on vscode.dev": "Checkout em vscode.dev",
			"Commit Changes": "Fazer Commit de Alterações",
			"Copy Anyway": "Copiar Mesmo Assim",
			"Copy vscode.dev Link": "Copiar vscode.dev Link",
			"Create Fork": "Criar Bifurcação",
			"Create GitHub fork": "Criar bifurcação do GitHub",
			"Create PR": "Criar PR",
			"Creating GitHub Pull Request...": "Criando Solicitação de Pull do GitHub...",
			"Creating first commit": "Criando o primeiro commit",
			"Forking \"{0}/{1}\"...": "Bifurcando \"{0}/{1}\"...",
			"Learn More": "Saiba Mais",
			"Log level: {0}": "Nível de log: {0}",
			"No": "Não",
			"No template": "Nenhum modelo",
			"Open PR": "Abrir PR",
			"Open on GitHub": "Abrir no GitHub",
			"Pick a folder to publish to GitHub": "Selecionar uma pasta para publicar no GitHub",
			"Publish Branch & Copy Link": "Publicar Branch e Copiar Link",
			"Publishing to a private GitHub repository": "Fazendo a publicação em um repositório privado do GitHub",
			"Publishing to a public GitHub repository": "Fazendo a publicação em um repositório público do GitHub",
			"Pull Changes & Copy Link": "Puxe as Alterações e Copie o Link",
			"Push Commits & Copy Link": "Enviar Confirmações e Copiar Link",
			"Pushing changes...": "Enviando alterações por push...",
			"Select the Pull Request template": "Selecione o modelo de Solicitação de Pull",
			"Select which files should be included in the repository.": "Selecionar quais arquivos devem ser incluídos no repositório.",
			"Successfully published the \"{0}\" repository to GitHub.": "O repositório \"{0}\" foi publicado com êxito no GitHub.",
			"The PR \"{0}/{1}#{2}\" was successfully created on GitHub.": "O PR \"{0}/{1}#{2}\" foi criado com êxito no GitHub.",
			"The current branch has unpublished commits. Would you like to push your commits before copying a link?": "O branch atual tem commits não publicados. Deseja enviar seus commits por push antes de copiar um link?",
			"The current branch is not published to the remote. Would you like to publish your branch before copying a link?": "O branch atual não está publicado no remoto. Deseja publicar seu branch antes de copiar um link?",
			"The current branch is not up to date. Would you like to pull before copying a link?": "A ramificação atual não está atualizada. Gostaria de puxar antes de copiar um link?",
			"The current file has uncommitted changes. Please commit your changes before copying a link.": "O arquivo atual tem alterações sem commit. Faça commit de suas alterações antes de copiar um link.",
			"The fork \"{0}\" was successfully created on GitHub.": "A bifurcação \"{0}\" foi criada com êxito no GitHub.",
			"Uploading files": "Carregando os arquivos",
			"You don't have permissions to push to \"{0}/{1}\" on GitHub. Would you like to create a fork and push to it instead?": "Você não tem permissões para efetuar push para \"{0}/{1}\" no GitHub. Em vez disso, deseja criar um fork e efetuar push para ele?",
			"Your push to \"{0}/{1}\" was rejected by GitHub because push protection is enabled and one or more secrets were detected.": "Seu push para \"{0}/{1}\" foi rejeitado pelo GitHub porque a proteção push está habilitada e um ou mais segredos foram detectados."
		},
		"package": {
			"config.branchProtection": "Controla se as regras do repositório devem ser consultadas para repositórios GitHub",
			"config.gitAuthentication": "Controla se a autenticação automática do GitHub deve ser habilitada para comandos git no VS Code.",
			"config.gitProtocol": "Controla qual protocolo é utilizado para clonar um repositório do GitHub",
			"description": "Recursos do GitHub para VS Code",
			"displayName": "GitHub",
			"welcome.publishFolder": "Você pode publicar diretamente esta pasta em um repositório do GitHub. Depois de publicado, você terá acesso aos recursos de controle do código-fonte das plataformas Git e GitHub.\r\n[$(github) Publicar no GitHub](command:github.publish)",
			"welcome.publishWorkspaceFolder": "Você pode publicar diretamente uma pasta de espaço de trabalho em um repositório do GitHub. Depois de publicado, você terá acesso aos recursos de controle do código-fonte das plataformas Git e GitHub.\r\n[$(github) Publicar no GitHub](command:github.publish)"
		}
	}
}