{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "esempio",
			"Files by Extension": "File in base all'estensione",
			"Files with Extension": "File con estensione",
			"Files with Multiple Extensions": "File con più estensioni",
			"Files with Path": "File con percorso",
			"Files with Siblings by Name": "File con elementi di pari livello in base al nome",
			"Folder by Name (Any Location)": "Cartella in base al nome (qualsiasi percorso)",
			"Folder by Name (Top Level)": "Cartella in base al nome (primo livello)",
			"Folders with Multiple Names (Top Level)": "Cartella con più nomi (primo livello)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Esegue il mapping di tutti i file il cui percorso assoluto corrisponde al criterio GLOB alla lingua con l'identificatore specificato.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Esegue il mapping di tutti i file il cui nome file corrisponde al criterio GLOB alla lingua con l'identificatore specificato.",
			"Match a folder with a specific name in any location.": "Trova una cartella con un nome specifico in qualsiasi percorso.",
			"Match a top level folder with a specific name.": "Trova una cartella di primo livello con un nome specifico.",
			"Match all files of a specific file extension.": "Trova tutti i file di un'estensione di file specifica.",
			"Match all files with any of the file extensions.": "Trova tutti i file con qualsiasi estensione di file.",
			"Match files that have siblings with the same name but a different extension.": "Trova file con elementi di pari livello e nome identico ma estensione diversa.",
			"Match multiple top level folders.": "Trova più cartelle di primo livello.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Carattere utilizzato dal sistema operativo per separare i componenti nei percorsi dei file. Ha anche l'alias '/'.",
			"The current opened file": "File attualmente aperto",
			"The current opened file relative to ${workspaceFolder}": "File attualmente aperto relativo a ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Nome della cartella dell'area di lavoro file attualmente aperta senza barre (/)",
			"The current opened file's basename": "Nome di base del file attualmente aperto",
			"The current opened file's basename with no file extension": "Nome di base del file attualmente aperto senza estensione",
			"The current opened file's dirname": "Nome della directory del file attualmente aperto",
			"The current opened file's dirname relative to ${workspaceFolder}": "Nome di directory del file attualmente aperto relativo a ${workspaceFolder}",
			"The current opened file's extension": "Estensione del file attualmente aperto",
			"The current selected line number in the active file": "Numero di riga corrente selezionato nel file attivo",
			"The current selected text in the active file": "Testo selezionato nel file attivo",
			"The file extension of the editor (e.g. txt)": "L'estensione di file dell'editor (ad es. txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Il nome file dell'editor senza la relativa directory o estensione (ad es. myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Nome dell'attività di compilazione predefinita. Se non è presente un'unica attività di compilazione predefinita, viene mostrata una selezione rapida per consentire la selezione dell'attività di compilazione.",
			"The name of the folder opened in VS Code without any slashes (/)": "Nome della cartella aperta In VS Code senza barre di separazione (/)",
			"The nth parent folder name of the editor": "Il nome n della cartella padre dell'editor",
			"The parent folder name of the editor (e.g. myFileFolder)": "Il nome della cartella padre dell'editor (ad es. myFileFolder)",
			"The path of the folder opened in VS Code": "Percorso della cartella aperta in VS Code",
			"The path where an extension is installed.": "Percorso in cui è installata un'estensione.",
			"The task runner's current working directory on startup": "Directory di lavoro corrente dello strumento di esecuzione attività all'avvio",
			"Use the language of the currently active text editor if any": "Usa la lingua dell'editor di testo attualmente attivo se presente",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "un separatore condizionale (' - ') visualizzato solo se circondato da variabili con valori",
			"an indicator for when the active editor has unsaved changes": "un indicatore per il momento in cui l'editor attivo contiene modifiche non salvate",
			"e.g. SSH": "ad esempio SSH",
			"e.g. VS Code": "ad esempio VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "percorso dell'Area di lavoro (ad es. /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "percorso della cartella dell'area di lavoro in cui è contenuto il file (ad es. /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "nome della cartella dell'area di lavoro in cui è contenuto il file (ad es. myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "nome dell'area di lavoro con il nome remoto facoltativo e l'indicatore dell'area di lavoro, se applicabile, (ad esempio cartella, cartella personale [SSH] o area di lavoro (area di lavoro))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "nome abbreviato dell'area di lavoro senza suffissi (ad esempio myFolder o myWorkspace)",
			"the file name (e.g. myFile.txt)": "il nome del file (ad esempio MyFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "percorso completo del file (ad esempio /Utenti/Sviluppo/Cartella/CartellaFile/File.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "percorso completo della cartella che contiene il file (ad esempio /Utenti/Sviluppo/Cartella/CartellaFile)",
			"the name of the active branch in the active repository (e.g. main)": "il nome del ramo attivo nel repository attivo (ad esempio, main)",
			"the name of the active repository (e.g. vscode)": "il nome del repository attivo (ad esempio, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "nome della cartella in cui si trova il file (ad esempio CartellaFile)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "percorso del file relativo alla cartella dell'area di lavoro (ad esempio Cartella/CartellaFile/File.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "percorso della cartella che contiene il file, relativo alla cartella dell'area di lavoro (ad esempio Cartella/CartellaFile)"
		},
		"package": {
			"description": "Offre funzionalità (IntelliSense avanzato, correzione automatica) nei file di configurazione come quelli degli elementi consigliati per impostazioni, avvio ed estensioni.",
			"displayName": "Modifica della configurazione"
		}
	}
}