{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Emmet Abbreviation": "Emmet-Abkürzung",
			"Enter Abbreviation": "Abkürzung eingeben",
			"Invalid emmet.variables field. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Ungültiges emmet.variables-Feld. Ein gültiges Beispiel finden Sie unter „https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration“.",
			"Invalid snippets file. See https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets for a valid example.": "Ungültige Codeschnipseldatei. Ein gültiges Beispiel finden Sie unter „https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets“.",
			"Invalid syntax profile. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Ungültiges Syntaxprofil. Ein gültiges Beispiel finden Sie unter „https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration“."
		},
		"package": {
			"command.balanceIn": "Ausgleichen (einwärts)",
			"command.balanceOut": "Ausgleichen (auswärts)",
			"command.decrementNumberByOne": "Um 1 verringern",
			"command.decrementNumberByOneTenth": "Um 0,1 verringern",
			"command.decrementNumberByTen": "Um 10 verringern",
			"command.evaluateMathExpression": "Mathematischen Ausdruck auswerten",
			"command.incrementNumberByOne": "Um 1 erhöhen",
			"command.incrementNumberByOneTenth": "Um 0,1 erhöhen",
			"command.incrementNumberByTen": "Um 10 erhöhen",
			"command.matchTag": "Gehe zu übereinstimmendem Paar",
			"command.mergeLines": "Zeilen mergen",
			"command.nextEditPoint": "Gehe zum nächsten Bearbeitungspunkt",
			"command.prevEditPoint": "Gehe zum vorherigen Bearbeitungspunkt",
			"command.reflectCSSValue": "CSS-Wert reflektieren",
			"command.removeTag": "Tag entfernen",
			"command.selectNextItem": "Nächstes Element auswählen",
			"command.selectPrevItem": "Vorheriges Element auswählen",
			"command.showEmmetCommands": "Emmet-Befehle anzeigen",
			"command.splitJoinTag": "Tag teilen/verknüpfen",
			"command.toggleComment": "Kommentar ein-/ausschalten",
			"command.updateImageSize": "Bildgröße aktualisieren",
			"command.updateTag": "Tag aktualisieren",
			"command.wrapWithAbbreviation": "Mit Abkürzung umschließen",
			"description": "Emmet-Unterstützung für VS Code",
			"emmetExclude": "Ein Array von Sprachen, in dem Emmet-Abkürzungen nicht erweitert werden sollten.",
			"emmetExtensionsPath": "Ein Array von Pfaden, in dem jeder Pfad Emmet-syntaxProfiles und/oder Schnipseldateien enthalten kann.\r\nBei Konflikten überschreiben die Profile/Schnipsel der späteren Pfade die der früheren Pfade.\r\nWeitere Informationen und eine Beispielschnipseldatei finden Sie unter https://code.visualstudio.com/docs/editor/emmet.",
			"emmetExtensionsPathItem": "Ein Pfad, der Emmet-syntaxProfiles und/oder-Schnipsel enthält.",
			"emmetIncludeLanguages": "Aktivieren Sie Emmet-Abkürzungen in Sprachen, die nicht standardmäßig unterstützt werden. Fügen Sie hier eine Zuordnung zwischen der unterstützten Sprache und der unterstützten Emmet-Sprache hinzu.\r\n Beispiel: {\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}",
			"emmetOptimizeStylesheetParsing": "Bei FALSE wird die gesamte Datei analysiert, um zu ermitteln, ob das Erweitern von Emmet-Abkürzungen an der aktuellen Position möglich ist. Bei TRUE wird nur der Inhalt vor und nach der aktuellen Position in CSS-, SCSS-, und LESS-Dateien analysiert.",
			"emmetPreferences": "Einstellungen, die zum Ändern des Verhaltens einiger Aktionen und Konfliktlöser von Emmet verwendet werden.",
			"emmetPreferencesAllowCompactBoolean": "Bei TRUE wird eine kompakte Notation boolescher Attribute erzeugt.",
			"emmetPreferencesBemElementSeparator": "Elementtrennzeichen für Klassen unter Verwendung des BEM-Filters.",
			"emmetPreferencesBemModifierSeparator": "Modifizierertrennzeichen für Klassen unter Verwendung des BEM-Filters.",
			"emmetPreferencesCssAfter": "Symbol, das beim Erweitern von CSS-Abkürzungen am Ende der CSS-Eigenschaft eingefügt werden soll.",
			"emmetPreferencesCssBetween": "Symbol, das beim Erweitern von CSS-Abkürzungen zwischen der CSS-Eigenschaft und dem Wert eingefügt werden soll.",
			"emmetPreferencesCssColorShort": "Bei „true“ werden Farbwerte wie `#f auf `#fff anstelle von `#ffffff erweitert.",
			"emmetPreferencesCssFuzzySearchMinScore": "Das Mindestergebnis (zwischen 0 und 1), das die Abkürzung mit Fuzzyübereinstimmung erreichen muss. Niedrigere Werte führen zu vielen falsch positiven Übereinstimmungen, höhere Werte verringern unter Umständen die möglichen Übereinstimmungen.",
			"emmetPreferencesCssMozProperties": "Durch Trennzeichen getrennte CSS-Eigenschaften, die das \"moz\"-Herstellerpräfix erhalten, wenn sie in einer Emmet-Abkürzung verwendet werden, die mit \"-\" beginnt. Legen Sie eine leere Zeichenfolge fest, um das \"moz\"-Präfix immer zu vermeiden.",
			"emmetPreferencesCssMsProperties": "Durch Trennzeichen getrennte CSS-Eigenschaften, die das \"ms\"-Herstellerpräfix erhalten, wenn sie in einer Emmet-Abkürzung verwendet werden, die mit \"-\" beginnt. Legen Sie eine leere Zeichenfolge fest, um das \"ms\"-Präfix immer zu vermeiden.",
			"emmetPreferencesCssOProperties": "Durch Trennzeichen getrennte CSS-Eigenschaften, die das \"o\"-Herstellerpräfix erhalten, wenn sie in einer Emmet-Abkürzung verwendet werden, die mit \"-\" beginnt. Legen Sie eine leere Zeichenfolge fest, um das \"o\"-Präfix immer zu vermeiden.",
			"emmetPreferencesCssWebkitProperties": "Durch Trennzeichen getrennte CSS-Eigenschaften, die das \"webkit\"-Herstellerpräfix erhalten, wenn sie in einer Emmet-Abkürzung verwendet werden, die mit \"-\" beginnt. Legen Sie eine leere Zeichenfolge fest, um das \"webkit\"-Präfix immer zu vermeiden.",
			"emmetPreferencesFilterCommentAfter": "Eine Kommentardefinition, die nach dem abgeglichenen Element platziert werden muss, wenn ein Kommentarfilter angewendet wird.",
			"emmetPreferencesFilterCommentBefore": "Eine Kommentardefinition, die vor dem abgeglichenen Element platziert werden muss, wenn ein Kommentarfilter angewendet wird.",
			"emmetPreferencesFilterCommentTrigger": "Eine durch Trennzeichen getrennte Liste von Attributnamen, die in abgekürzter Form vorliegen müssen, damit der Kommentarfilter angewendet werden kann.",
			"emmetPreferencesFloatUnit": "Standardeinheit für Floatwerte.",
			"emmetPreferencesFormatForceIndentTags": "Ein Array von Tagnamen, die immer einen inneren Einzug erhalten.",
			"emmetPreferencesFormatNoIndentTags": "Ein Array von Tagnamen, die nie einen inneren Einzug erhalten.",
			"emmetPreferencesIntUnit": "Standardeinheit für Integerwerte.",
			"emmetPreferencesOutputInlineBreak": "Die Anzahl gleichgeordneter Inline-Elemente, die erforderlich sind, damit Zeilenumbrüche zwischen diesen Elementen eingefügt werden. Bei \"0\" werden Inline-Elemente immer auf einer einzigen Zeile platziert.",
			"emmetPreferencesOutputReverseAttributes": "Bei TRUE werden beim Auflösen von Schnipseln die Richtungen von Attributzusammenführungen umgekehrt.",
			"emmetPreferencesOutputSelfClosingStyle": "Formatvorlage der selbstschließenden Tags: HTML („<br>“), XML („<br/>“) oder XHTML („<br />“).",
			"emmetPreferencesSassAfter": "Symbol, das beim Erweitern von CSS-Abkürzungen in Sass-Dateien am Ende der CSS-Eigenschaft eingefügt werden soll.",
			"emmetPreferencesSassBetween": "Symbol, das beim Erweitern von CSS-Abkürzungen in Sass-Dateien zwischen der CSS-Eigenschaft und dem Wert eingefügt werden soll.",
			"emmetPreferencesStylusAfter": "Symbol, das beim Erweitern von CSS-Abkürzungen in Stylus-Dateien am Ende der CSS-Eigenschaft eingefügt werden soll.",
			"emmetPreferencesStylusBetween": "Symbol, das beim Erweitern von CSS-Abkürzungen in Stylus-Dateien zwischen der CSS-Eigenschaft und dem Wert eingefügt werden soll.",
			"emmetShowAbbreviationSuggestions": "Zeigt mögliche Emmet-Abkürzungen als Vorschläge an. Diese Option gilt nicht in Stylesheets oder wenn emmet.showExpandedAbbreviation auf `\"never`\" festgelegt ist.",
			"emmetShowExpandedAbbreviation": "Zeigt erweiterte Emmet-Abkürzungen als Vorschläge an.\r\nDie Option \"inMarkupAndStylesheetFilesOnly\" gilt für: html, haml, jade, slim, xml, xsl, css, scss, sass, less, stylus.\r\nDie Option \"always\" gilt unabhängig von Markup/CSS für alle Teile der Datei.",
			"emmetShowSuggestionsAsSnippets": "Bei TRUE werden die Emmet-Vorschläge als Schnipsel angezeigt. Dadurch können Sie die Vorschläge entsprechend der `#editor.snippetSuggestions#`-Einstellung anordnen.",
			"emmetSyntaxProfiles": "Definieren Sie das Profil für die angegebene Syntax, oder verwenden Sie Ihr eigenes Profil mit bestimmten Regeln.",
			"emmetTriggerExpansionOnTab": "Wenn diese Option aktiviert ist, werden Emmet-Abkürzungen beim Drücken der TAB-TASTE erweitert, auch wenn keine Vervollständigungen angezeigt werden. Wenn diese Option deaktiviert ist, können Vervollständigungen, die angezeigt werden, weiterhin durch Drücken der TAB-TASTE akzeptiert werden.",
			"emmetUseInlineCompletions": "Wenn \"true\", verwendet Emmet Inline-Vervollständigungen, um Erweiterungen vorzuschlagen. Um zu verhindern, dass der Nicht-Inline-Vervollständigungselementanbieter so oft angezeigt wird, während diese Einstellung auf „true“ gesetzt ist, schalten Sie „#editor.quickSuggestions#“ für das „andere“ Element auf „inline“ oder „off“.",
			"emmetVariables": "In Emmet-Schnipseln zu verwendende Codeschnipsel."
		}
	}
}