{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Checkout on vscode.dev": "Finalizar la compra en vscode.dev",
			"Commit Changes": "Confirmar cambios",
			"Copy Anyway": "Copiar de todos modos",
			"Copy vscode.dev Link": "Copiar vínculo de vscode.dev",
			"Create Fork": "Crear bifurcación",
			"Create GitHub fork": "Crear bifurcación de GitHub",
			"Create PR": "Crear PR",
			"Creating GitHub Pull Request...": "Creando solicitud de incorporación de cambios de GitHub...",
			"Creating first commit": "Creando el primer \"commit\"",
			"Forking \"{0}/{1}\"...": "Bifurcando “{0}/{1}”...",
			"Learn More": "Más información",
			"Log level: {0}": "Nivel de registro: {0}",
			"No": "No",
			"No template": "Ninguna plantilla",
			"Open PR": "Abrir PR",
			"Open on GitHub": "Abrir en GitHub",
			"Pick a folder to publish to GitHub": "Seleccionar una carpeta para publicar en GitHub",
			"Publish Branch & Copy Link": "Publicar rama y copiar vínculo",
			"Publishing to a private GitHub repository": "Publicando en un repositorio de GitHub privado",
			"Publishing to a public GitHub repository": "Publicando en un repositorio de GitHub público",
			"Pull Changes & Copy Link": "Cambios de extracción & copiar vínculo",
			"Push Commits & Copy Link": "Confirmaciones de inserción > Copiar vínculo",
			"Pushing changes...": "Insertando cambios...",
			"Select the Pull Request template": "Seleccionar la plantilla de solicitud de incorporación de cambios",
			"Select which files should be included in the repository.": "Seleccione los archivos que se deben incluir en el repositorio.",
			"Successfully published the \"{0}\" repository to GitHub.": "El repositorio “{0}” se publicó correctamente en GitHub.",
			"The PR \"{0}/{1}#{2}\" was successfully created on GitHub.": "La PR “{0}/{1}#{2}” se creó correctamente en GitHub.",
			"The current branch has unpublished commits. Would you like to push your commits before copying a link?": "La rama actual tiene confirmaciones no publicadas. ¿Desea insertar las confirmaciones antes de copiar un vínculo?",
			"The current branch is not published to the remote. Would you like to publish your branch before copying a link?": "La rama actual no está publicada en el remoto. ¿Desea publicar la rama antes de copiar un vínculo?",
			"The current branch is not up to date. Would you like to pull before copying a link?": "La rama actual no está actualizada. ¿Desea extraer antes de copiar un vínculo?",
			"The current file has uncommitted changes. Please commit your changes before copying a link.": "El archivo actual tiene cambios sin confirmar. Confirme los cambios antes de copiar un vínculo.",
			"The fork \"{0}\" was successfully created on GitHub.": "La bifurcación “{0}” se creó correctamente en GitHub.",
			"Uploading files": "Cargando archivos",
			"You don't have permissions to push to \"{0}/{1}\" on GitHub. Would you like to create a fork and push to it instead?": "No tiene permisos para insertar en \"{0}/{1}\" en GitHub. ¿Desea crear una bifurcación e insertarla en ella en su lugar?",
			"Your push to \"{0}/{1}\" was rejected by GitHub because push protection is enabled and one or more secrets were detected.": "GitHub rechazó la inserción en \"{0}/{1}\" porque la protección de inserción está habilitada y se detectaron uno o varios secretos."
		},
		"package": {
			"config.branchProtection": "Controla si se deben consultar las reglas del repositorio para repositorios de GitHub.",
			"config.gitAuthentication": "Controla si se debe habilitar la autenticación automática de GitHub para los comandos GIT dentro de VS Code.",
			"config.gitProtocol": "Controla qué protocolo se usa para clonar un repositorio de GitHub",
			"description": "Características de GitHub para VS Code",
			"displayName": "GitHub",
			"welcome.publishFolder": "Puede publicar directamente esta carpeta en un repositorio de GitHub. Una vez publicada, tendrá acceso a las características de control de código fuente con tecnología de Git y GitHub.\r\n[$(github) Publicar en GitHub](command:github.publish)",
			"welcome.publishWorkspaceFolder": "Puede publicar directamente una carpeta del área de trabajo en un repositorio de GitHub. Una vez publicada, tendrá acceso a las características de control de código fuente con tecnología de Git y GitHub.\r\n[$(github) Publicar en GitHub](command:github.publish)"
		}
	}
}