{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Emmet Abbreviation": "Skrót Emmeta",
			"Enter Abbreviation": "Wprowadź skrót",
			"Invalid emmet.variables field. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Nieprawidłowe pole emmet.variables. Aby uzyskać prawidłowy przykład, zobacz https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration.",
			"Invalid snippets file. See https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets for a valid example.": "Nieprawidłowy plik fragmentów kodu. Aby uzyskać prawidłowy przykład, zobacz https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets.",
			"Invalid syntax profile. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Nieprawidłowy profil składni. Aby uzyskać prawidłowy przykład, zobacz https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration."
		},
		"package": {
			"command.balanceIn": "Równoważ (do wewnątrz)",
			"command.balanceOut": "Równoważ (na zewnątrz)",
			"command.decrementNumberByOne": "Zmniejsz o 1",
			"command.decrementNumberByOneTenth": "Zmniejsz o 0,1",
			"command.decrementNumberByTen": "Zmniejsz o 10",
			"command.evaluateMathExpression": "Oblicz wyrażenie matematyczne",
			"command.incrementNumberByOne": "Zwiększ o 1",
			"command.incrementNumberByOneTenth": "Zwiększ o 0,1",
			"command.incrementNumberByTen": "Zwiększ o 10",
			"command.matchTag": "Przejdź do pasującej pary",
			"command.mergeLines": "Scal wiersze",
			"command.nextEditPoint": "Przejdź do następnego punktu edycji",
			"command.prevEditPoint": "Przejdź do poprzedniego punktu edycji",
			"command.reflectCSSValue": "Odzwierciedlaj wartość CSS",
			"command.removeTag": "Usuń tag",
			"command.selectNextItem": "Wybierz następny element",
			"command.selectPrevItem": "Wybierz poprzedni element",
			"command.showEmmetCommands": "Pokaż polecenia Emmet",
			"command.splitJoinTag": "Podziel/Połącz tag",
			"command.toggleComment": "Przełącz komentarz",
			"command.updateImageSize": "Zaktualizuj rozmiar obrazu",
			"command.updateTag": "Zaktualizuj tag",
			"command.wrapWithAbbreviation": "Zawijaj przy użyciu skrótu",
			"description": "Obsługa wtyczki Emmet dla programu VS Code",
			"emmetExclude": "Tablica języków, w których skróty wtyczki Emmet nie powinny być rozwijane.",
			"emmetExtensionsPath": "Tablica ścieżek, gdzie każda ścieżka może zawierać pliki Emmet syntaxProfiles i/lub wycinki.\r\nW przypadku konfliktów profile/fragmenty kolejnych ścieżek zastąpią te, które są wcześniej ścieżkami.\r\nZobacz https://code.visualstudio.com/docs/editor/emmet, aby uzyskać więcej informacji i przykładowe wycinki.",
			"emmetExtensionsPathItem": "Ścieżka zawierająca Emmet syntaxProfiles i/lub fragmenty kodu.",
			"emmetIncludeLanguages": "Włącz skróty Emmet w językach, które nie są domyślnie obsługiwane. Dodaj tutaj mapowanie pomiędzy językiem a językiem obsługiwanym przez Emmet.\r\n Na przykład: `{„vue-html”: „html”, „javascript”: „javascriptreact”}`",
			"emmetOptimizeStylesheetParsing": "Jeśli ustawiono wartość `false`, analizowany jest cały plik w celu określenia, czy bieżąca pozycja jest odpowiednia do rozwijania skrótów wtyczki Emmet. Jeśli ustawiono wartość `true`, analizowana jest tylko zawartość znajdującą się w bieżącym położeniu w plikach CSS/SCSS/Less.",
			"emmetPreferences": "Preferencje używane do modyfikowania zachowania niektórych akcji i programów do rozpoznawania we wtyczce Emmet.",
			"emmetPreferencesAllowCompactBoolean": "Jeśli `true`, to tworzona jest zwarta notacja atrybutów boolean.",
			"emmetPreferencesBemElementSeparator": "Separator elementów używany w klasach podczas używania filtru BEM.",
			"emmetPreferencesBemModifierSeparator": "Separator modyfikatorów używany dla klas podczas korzystania z filtra BEM.",
			"emmetPreferencesCssAfter": "Symbol należy umieścić na końcu właściwości CSS podczas rozwijania skrótów CSS.",
			"emmetPreferencesCssBetween": "Symbol należy umieścić między właściwością CSS a wartością podczas rozwijania skrótów CSS.",
			"emmetPreferencesCssColorShort": "W przypadku ustawienia wartości \"true\" wartości kolorów takie jak #f będą rozszerzane do wartości #fff, a nie do #ffffff.",
			"emmetPreferencesCssFuzzySearchMinScore": "Minimalny wynik (od 0 do 1), jaki powinien osiągnąć częściowo dopasowany skrót. Niższe wartości mogą dawać wiele dopasowań fałszywie pozytywnych, a wyższe wartości mogą zmniejszyć liczbę możliwych dopasowań.",
			"emmetPreferencesCssMozProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „moz”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „moz”.",
			"emmetPreferencesCssMsProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „ms”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „ms”.",
			"emmetPreferencesCssOProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „o”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „o”.",
			"emmetPreferencesCssWebkitProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „webkit”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „webkit”.",
			"emmetPreferencesFilterCommentAfter": "Definicja komentarza, która powinna zostać umieszczona po dopasowanym elemencie po zastosowaniu filtru komentarzy.",
			"emmetPreferencesFilterCommentBefore": "Definicja komentarza, która powinna zostać umieszczona przed dopasowanym elementem po zastosowaniu filtru komentarzy.",
			"emmetPreferencesFilterCommentTrigger": "Lista oddzielonych przecinkami nazw atrybutów, które powinny występować w skrócie, aby filtr komentarzy mógł zostać zastosowany.",
			"emmetPreferencesFloatUnit": "Domyślna jednostka dla wartości typu float.",
			"emmetPreferencesFormatForceIndentTags": "Tablica nazw tagów, które zawsze powinny otrzymać wewnętrzne wcięcie.",
			"emmetPreferencesFormatNoIndentTags": "Tablica nazw tagów, które nigdy nie powinny otrzymać wewnętrznego wcięcia.",
			"emmetPreferencesIntUnit": "Jednostka domyślna dla wartości całkowitych.",
			"emmetPreferencesOutputInlineBreak": "Liczba śródwierszowych elementów równorzędnych, które są potrzebne do umieszczenia podziałów wierszy między tymi elementami. W przypadku wartości `0` elementy środwierszowe są zawsze rozwijane w jeden wiersz.",
			"emmetPreferencesOutputReverseAttributes": "Wartość `true` powoduje odwrócenie kierunków scalania atrybutów podczas rozpoznawania fragmentów.",
			"emmetPreferencesOutputSelfClosingStyle": "Styl tagów samozamykających: html (\"<br>\"), xml (\"<br/>\") lub xhtml (\"<br />\").",
			"emmetPreferencesSassAfter": "Symbol należy umieścić na końcu właściwości CSS podczas rozwijania skrótów CSS w plikach Sass.",
			"emmetPreferencesSassBetween": "Symbol należy umieścić między właściwością CSS a wartością podczas rozwijania skrótów CSS w plikach Sass.",
			"emmetPreferencesStylusAfter": "Symbol należy umieścić na końcu właściwości CSS podczas rozwijania skrótów CSS w plikach Stylus.",
			"emmetPreferencesStylusBetween": "Symbol należy umieścić między właściwością CSS a wartością podczas rozwijania skrótów CSS w plikach Stylus.",
			"emmetShowAbbreviationSuggestions": "Pokazuje możliwe skróty wtyczki Emmet jako sugestie. Nie dotyczy arkuszy stylów lub gdy właściwość emmet.showExpandedAbbreviation ma wartość „never”.",
			"emmetShowExpandedAbbreviation": "Pokazuje rozwinięte skróty wtyczki Emmet jako sugestie.\r\nOpcja `„inMarkupAndStylesheetFilesOnly”` ma zastosowanie do plików html, haml, jade, slim, xml, xsl, css, scss, sass, less i stylus.\r\nOpcja `„always”` ma zastosowanie do wszystkich części pliku, niezależnie od znaczników / kodu css.",
			"emmetShowSuggestionsAsSnippets": "W przypadku wartości „true” sugestie wtyczki Emmet będą wyświetlane jako wstawki, co umożliwi ich porządkowanie zgodnie z ustawieniem „#editor.snippetSuggestions#”.",
			"emmetSyntaxProfiles": "Zdefiniuj profil dla określonej składni lub użyj własnego profilu z określonymi regułami.",
			"emmetTriggerExpansionOnTab": "Gdy ta opcja jest włączona, skróty Emmet są rozwijane po naciśnięciu klawisza TAB, nawet jeśli uzupełnienia nie są wyświetlane. Po wyłączeniu tej opcji, uzupełnienia które są wyświetlane, mogą być nadal akceptowane przez naciśnięcie klawisza TAB.",
			"emmetUseInlineCompletions": "W przypadku wartości „true” funkcja Emmet będzie używać uzupełnień śródwierszowych do sugerowania rozwinięć. Aby uniemożliwić dostawcy elementów uzupełniania innego niż śródwierszowy wyświetlanie tak często, gdy to ustawienie ma wartość „true”, zmień ustawienie „#editor.quickSuggestions#” na wartość „inline\" lub „off” dla elementu „other”.",
			"emmetVariables": "Zmienne, które mają być używane we wstawkach wtyczki Emmet."
		}
	}
}